[
  {
    "name": "Khu trung tâm Hoàng thành Thăng Long - Hà Nội",
    "location": "Quận Ba Đình, thành phố Hà Nội\n21°02′11″B 105°50′35″Đ",
    "types": "Di tích lịch sử, khảo cổ[4]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ho%C3%A0ng_th%C3%A0nh_Th%C4%83ng_Long",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Citadelle_de_Hano%C3%AF_%283%29.jpg/250px-Citadelle_de_Hano%C3%AF_%283%29.jpg",
    "description": "Hoàng thành Thăng Long (chữ Hán: 昇龍皇城; Hán-Việt: Thăng Long Hoàng thành) là quần thể di tích gắn với lịch sử kinh thành Thăng Long - Đông Kinh và tỉnh thành Hà Nội bắt đầu từ thời kì tiền Thăng Long (An Nam đô hộ phủ thế kỷ VII) qua thời Đinh - Tiền Lê, phát triển mạnh dưới thời Lý, Trần, Lê và thành Hà Nội dưới triều Nguyễn. Đây là công trình kiến trúc các triều vua xây dựng trong nhiều giai đoạn lịch sử và trở thành một trong những di tích quan trọng bậc nhất trong hệ thống các di tích Việt Nam.",
    "events": [
      {
        "description": "Thời kỳ Nhà Đường, An Nam được chia thành 12 châu với 50 huyện, Tống Bình là trung tâm của An Nam đô hộ phủ, lần đầu tiên vùng đất sau này là kinh thành Thăng Long nắm giữ vai trò một trung tâm quyền lực chính trị. Năm 866, viên tướng nhà Đường là Cao Biền xây dựng một thành trì mới, Tống Bình được đổi tên thành Đại La – thủ phủ của Tĩnh Hải quân. Theo truyền thuyết, khi đắp thành, Cao Biền thấy một vị thần hiện lên tự xưng là thần Long Đỗ. Vì vậy, sử sách còn gọi Thăng Long là đất Long Đỗ.\n\nCuối thế kỷ IX, chính quyền trung ương nhà Đường suy yếu nghiêm trọng. Đầu thế kỷ X, các thế lực cát cứ nổi lên đánh giết lẫn nhau, tạo ra thế loạn chia cắt Ngũ Đại Thập Quốc. Khúc Thừa Dụ, khi đó là Hào trưởng Chu Diên, được dân chúng ủng hộ, đã tiến ra chiếm đóng phủ thành Đại La, tự xưng là Tiết độ sứ. Sau khi đã nắm được quyền lực thực tế trên đất Tĩnh Hải quân, ông đã cho xây dựng chính quyền dựa trên danh xưng của chính quyền đô hộ nhà Đường, nhưng thực chất là một chính quyền độc lập và do người Việt quản lý.\n\nNăm 931, Dương Đình Nghệ đem quân từ Ái Châu ra Đại La đánh đuổi thứ sử Lý Tiến của nước Nam Hán. Lý Tiến bỏ chạy, Dương Đình Nghệ giải phóng thành Đại La giành quyền tự chủ cho đất nước Việt được 6 năm thì bị Kiều Công Tiễn giết hại. Năm 938, Ngô Quyền hạ thành Đại La, tiêu diệt Kiều Công Tiễn. Sau đó, ông chỉ huy trận Bạch Đằng, đánh bại quân Nam Hán, giết chết Hoằng Tháo. Mùa xuân năm 939, ông xưng là Ngô Vương, không đóng đô ở Đại La mà về Cổ Loa. Sau khi Đinh Tiên Hoàng dẹp loạn 12 sứ quân, các Triều đại Đinh, Tiền Lê đóng đô ở Hoa Lư. Đại La lúc này do Đô hộ phủ sĩ sư Lưu Cơ cai quản và tu sửa Hoàng thành quay về hướng nam (hướng về kinh đô Hoa Lư thay vì hướng về phương bắc như chính quyền đô hộ đã làm) vì thế mà vị quan này được coi là người \"giao chìa khóa\" thành Đại La cho Lý Thái Tổ.[4][5]",
        "title": "Giai đoạn Tiền Thăng Long"
      },
      {
        "description": "Quy hoạch Thăng Long thời Lý\n\nNăm 1010, tại kinh đô Hoa Lư, vua Lý Thái Tổ ban chiếu dời đô để thiên đô về thành Đại La và đổi tên kinh thành này là Thăng Long. Lý Thái Tổ cùng các quần thần đã gấp rút xây dựng những công trình cơ bản của Kinh thành Thăng Long. Đến đầu năm 1011 thì hoàn thành. Khi mới xây dựng, Kinh thành Thăng Long được xây dựng theo mô hình Tam trùng thành quách gồm: vòng ngoài cùng gọi là La Thành hay Kinh Thành, vòng thành thứ hai là Hoàng Thành, giữa hai lớp thành này là nơi sinh sống của cư dân, lớp thành còn lại là Tử Cấm Thành hay Cấm Thành hay Long Phượng thành là nơi ở của nhà vua. Các thời sau đều theo cách ấy mà phân chia.\n\nMục Chiếu dời đô của sách Đại Việt sử ký toàn thư viết: ... Thành Đại La, đô cũ của Cao Vương (tức Cao Biền), ở giữa khu vực trời đất, được thế rồng cuộn hổ ngồi, chính giữa Nam Bắc Đông Tây, tiện nghi núi sông sau trước. Vùng này mặt đất rộng mà bằng phẳng, thế đất cao mà sáng sủa, dân cư không khổ thấp trũng tối tăm, muôn vật hết sức tươi tốt phồn thịnh. Xem khắp đất Việt đó là nơi thắng địa, thực là chỗ tụ hội quan yếu của bốn phương.\n\nNgay từ năm 1010, khi mới định đô Thăng Long, Lý Thái Tổ đã khởi công xây dựng Hoàng Thành và hàng loạt cung điện ở trong Hoàng Thành. Hoàng thành đắp bằng đất, phía ngoài có hào, mở 4 cửa: Tường Phù ở phía đông, Quảng Phúc ở phía tây, Đại Hưng ở phía nam, Diệu Đức ở phía bắc. Tuy còn những ý kiến khác nhau, nhưng căn cứ vào sử liệu và di tích còn lại, có thể xác định cửa Tường Phù mở ra phía Chợ Đông và khu phố buôn bán tấp nập của phường Giang Khẩu và đền Bạch Mã. Cửa Quảng Phúc mở ra phía chùa Một Cột và chợ Tây Nhai (chợ Ngọc Hà). Cửa Đại Hưng ở khoảng gần Cửa Nam hiện nay. Cửa Diệu Đức nhìn ra trước sông Tô Lịch, khoảng đường Phan Đình Phùng hiện nay. Những cung điện chính còn thấy trong sử sách như: điện Càn Nguyên là nơi thiết triều đặt trên núi Nùng tức núi Long Đỗ, hai bên tả hữu là điện Tập Hiền và điện Giảng Võ. Bên trái mở cửa Phi Long thông với cung Nghinh Xuân, bên phải mở cửa Đan Phượng thông với cung Uy Viễn, chính Bắc dựng điện Cao Minh. Thềm các quan chầu vua gọi là Long Trì có hành lang chạy xung quanh. Đằng sau điện Càn Nguyên là điện Long An và điện Long Thụy làm nơi nhà vua nghỉ ngơi. Bên trái xây điện Nhật Quang, bên phải xây điện Nguyệt Minh, đằng sau là cung Thúy Hoa là nơi ở của các phi tần.\n\nNăm 1029, Lý Thái Tông xây dựng lại toàn bộ khu Cấm Thành sau khi nơi đây bị tàn phá bởi vụ Loạn tam vương. Trên nền cũ điện Càn Nguyên, Lý Thái Tông cho dựng điện Thiên An làm nơi thiết triều. Hai bên tả hữu là điện Tuyên Đức và điện Thiên Phúc. Phía trước điện Thiên An là sân Rồng có đặt một quả chuông lớn. Hai bên tả hữu sân rồng có đặt gác chuông. Phía đông, tây sân Rồng là điện Văn Minh và điện Quảng Vũ, phía trước sân rồng là điện Phụng Tiên, trên điện có lầu Chính Dương là nơi báo canh báo khắc. Sau điện Thiên An là điện Thiên Khánh hình Bát Giác. Sau điện Thiên Khánh là điện Trường Xuân. Trên điện Trường Xuân có gác Đồ Long. Từ điện Thiên Khánh nối với điện Thiên An ở phía sau đều có bắc cầu gọi là cầu Phượng Hoàng.\n\nNăm 1203, vua Lý Cao Tông bắt đầu một đợt xây dựng mới. Cung điện mới được xây ở phía tây tẩm điện. Bên trái dựng điện Dương Minh, bên phải dựng điện Chính Nghi, ở trên xây điện Kính Thiên, thềm gọi là Lệ Giao. ở giữa mở cửa Vĩnh Nghiêm, bên phải mở cửa Việt Thành, thềm gọi là Ngân Hồng. Đằng sau xây điện Thắng Thọ. Bên trái xây gác Nhật Kim, bên phải xây gác Nguyệt Bảo, xung quanh dựng hành lang thềm gọi là Kim Tinh. Bên trái gác Nguyệt Bảo là tòa Lương Thạch, phía tây xây gác Dục Đường (nhà tắm). Phía sau xây gác Phú Quốc, thềm gọi là Phượng Tiêu. Phía sau dựng cửa Thấu Viên, ao Dưỡng Ngư,  trên ao xây đình Ngoạn Y. Ba mặt đình có trồng hoa thơm cỏ lạ nước thông với sông.\n[6]\nNgoài ra các cung điện khác cũng được xây dựng liên tục, không đòi nào không có không mấy năm không có. Mỗi cung điện thường đều có tường bao xung quanh và làm cửa thông với cung điện khác. Ngoài cung điện, các vị vua nhà Lý còn cho xây dựng nhiều công trình văn hóa tín ngưỡng khác để phục vụ cho vua và hoàng tộc như: đền Quán Thánh, chùa Chân Giáo (nơi vua Lý Huệ Tông đã tu hành), đài Chúng Tiên dựng năm 1161 tầng trên lợp ngói bạc, hồ ao làm cảnh cũng được lập khá nhiều trong Hoàng thành. Năm 1049, đào hồ Kim Minh Vạn Tuế, đắp núi đá cao ba ngọn trên mặt hồ và xây cầu Vũ Phượng đi vào, 10 năm sau lại xây thêm điện Hồ Thiên bát giác ở đấy. Năm 1051 đào hồ Thụy Thanh, hồ Ứng Minh. Năm 1098, đào hồ Phượng Liên và xây tại đây điện Sùng Uyên, bên trái lập điện Huy Dương, đình Lai Phượng, bên phải dựng điện Ánh Thiềm, đình Át Vân, phía trước xây lầu Trường Minh, phía sau bắc cầu Ngoạn Hoa.\n\nNhiều vườn ngự cũng được dựng nên trong Hoàng thành. Mùa thu năm 1048, mở luôn 3 vườn ngự: vườn Quỳnh Lâm, vườn Thắng Cảnh và vườn Xuân Quang. Năm 1065, mở thêm vườn Thượng Lâm. \n\nQuy hoạch Thăng Long thời Trần\n\nVề quy hoạch xây dựng Thăng Long thời Trần, ta có thể hình dung dựa trên đoạn mô tả của các đoàn sứ Nguyên khi đến Đại Việt. Cửa chính của Cấm thành là Chính Dương môn, gồm cổng chính Dương Minh môn, 2 cổng phụ là Nhật Tân môn và Vân Hội môn. Đi qua Dương Minh môn là giếng trời rộng vài chục trượng, sau đó đến điện Tập Hiền, gác Minh Linh, 2 cửa nách là Kiều Ứng và Đồng Lạc. Từ chái bên phải đi đến là điện Đức Huy, từ chái bên trái đi tới là điện Thọ Quang, gác Minh Hà. Chính điện vẫn là Thiên An Ngự điện, giữ nguyên như cũ từ thời Lý.[7] Vua ở cung Quan Triều, nền cũ là Tân điện của Lý Cao Tông, Thái Thượng hoàng ở cung Thánh Từ, nền cũ là cung Uy Viễn. Khu Thái miếu tiếp tục được tu bổ và trở thành nơi thờ cúng các tiên đế của cả 2 triều đại Lý-Trần. Cũng trong thời kì này, cung Thái tử được gọi là Sừ cung, Thái tử sẽ sinh sống và đào tạo trong Hoàng thành chứ không phải ở phủ riêng bên ngoài Hoàng thành như thời Lý. Các cung nữ ở trong cung Lệ Thiên hoặc Thưởng Xuân.\n\nGiữa thế kỷ XIV lại dựng một vườn ngự nữa nối liền với hậu cung. Theo sử cũ còn ghi giữa vườn có đào một cái hồ lớn: \"Trong hồ chất đá làm núi, trên bờ hồ trồng thông, trúc và nhiều thứ kỳ hoa diệu thảo khác thêm vào đấy là chim quý thú lạ. Bốn mặt khai cho sông nước thông vào, gọi hồ ấy là Lạc Thanh Trì. Về phía tây hồ trồng hai cây quế, dựng một tòa điện gọi là điện Lạc Thanh. Lại đào các hồ nhỏ khác, bắt người ở Hải Đông chở nước mặn chứa vào hồ ấy, để nuôi các loài hải sản như đồi mồi cá biển và các loại ba ba. Rồi bắt người Hóa Châu bắt cá sấu thả vào đấy. Lại có hồ Thanh Ngư để nuôi cá Thanh Phụ (cá diếc đuôi đỏ vảy biếc)... Lại làm dãy hành lang ở tây điện thẳng đến cửa Hoàng Phúc, dựng dãy Trường Lang từ gác Nguyên Huyền đến cửa Đại Triều phía tây.\n\nCác cung điện dưới thời Trần được xây dựng với quy mô rất hoành tráng, có trình độ kỹ thuật cao. Thậm chí, trên các gác 2 có thể xây dựng hành lang rộng, có thể nối từ công trình kiến trúc này tới công trình kiến trúc khác.",
        "title": "Giai đoạn Lý - Trần từ thế kỷ XI đến thế kỷ XIV"
      },
      {
        "description": "Sau khi chiến thắng giặc Minh, Lê Thái Tổ vẫn đóng đô ở Thăng Long nhưng đổi tên là Đông Kinh. Về cơ bản Đông Kinh thời Lê không khác nhiều Thăng Long đời Lý,Trần,Hồ, Lê Thái Tổ sửa chữa lại hoàng thành do cuộc chiến tranh chống quân Minh để lại.\n\nCung thành thời Lê có hình chữ nhật, tường thành được xây bằng gạch cao khoảng hơn 5m, cửa chính nằm ở phía Nam. Hai bên có hai cửa nách là Đông Tràng An và Tây Tràng An.  Năm 1428, Lê Thái Tổ cho xây dựng lại một loạt cung điện làm nơi thiết triều, nơi nhà vua làm việc và nơi ở của hoàng cung. Trục thần đạo đi từ Đoan Môn vào là cửa Chu Tước, điện Thị Triều, điện Kính Thiên, điện Cần Chánh và Hậu Cung. Tương truyền điện Ngọc Hà được xây trên nền của khu vực trước là 1 nhánh của sông Hồng. Sau này xây thành Đại La người ta đã lấp nhánh sông đó đi, nước dồn lại thành 1 cái hồ nằm ngay trước điện, muốn đi vào điện phải đi qua 1 cây cầu. Do đó mà điện mới có tên là điện Ngọc Hà. Ngoài ra, điện Vạn Thọ, là nơi ở của các hoàng đế nhà Lê trong suốt 100 năm tồn tại. Phía đông điện này là Đông Cung, nơi ở của Thái tử. Lê Thái Tổ cũng cho dựng nhiều cung điện lớn như Hội Anh, Cẩn Đức, Tường Quang, Giảng Võ, Thúy Ngọc, Thừa Hoa, Kim Loan, Bảo Quang, Thừa Thiên...\n\nTừ năm 1490 cho đến thế kỷ XVI, kinh thành mới có nhiều thay đổi. Trong thời gian này tường hoàng thành cũng như Đại La thành luôn được xây đắp mở rộng thêm ra. Năm 1490, để đề phòng những nạn loạn đảng như Lê Nghi Dân đang đêm trèo tường vào giết Lê Nhân Tông ở trong cung, Lê Thánh Tông cho xây lại Hoàng Thành mở rộng thêm 8 dặm nữa. Công việc xây dựng trong 8 tháng mới xong. Trong Hoàng Thành, vua Lê Thánh Tông cũng cho xây thêm cung điện và lập vườn Thượng lâm để nuôi bách thú. Lê Hiến Tông, ông vua thứ 5 của triều đại Lê Sơ, trị vì từ năm 1497 đến năm 1504 lại cho xây dựng thêm nhiều cung điện tráng lệ: Thượng Dương, Giám Trị, Đồ Trị, Trường Sinh, hay điện Lưu Bôi với hệ thống dẫn nước từ xa về.Năm 1512, Lê Tương Dực giao Vũ Như Tô đứng ra trông nom việc dựng hơn 100 nóc cung điện nguy nga, lại khởi công làm Cửu Trùng Đài mà như sử cũ miêu tả là tuy chưa hoàn thành mà bóng rợp nửa hồ Tây. Năm 1514, Lê Tương Dực mở rộng Hoàng Thành thêm mấy nghìn trượng (mỗi trượng là 3m60) bao bọc cả điện Tường Quang, quán Trấn Vũ và chùa Kim Cổ Thiên Hoa.\n\nTừ năm 1516 đến năm 1527 là năm nhà Mạc cướp ngôi nhà Lê, kinh thành Đông Kinh chìm trong loạn lạc. Hầu hết các cung điện kho tàng đền chùa cũng như phường phố bị thiêu đốt tàn phá nhiều lần. Trong nửa cuối thế kỷ XVI, cục diện Nam Bắc triều với một bên là nhà Mạc và một bên là Lê-Trịnh diễn ra quyết liệt với ưu thế ngày càng thuộc về phe Nam triều. Họ Trịnh lần lượt chiếm được nhiều tỉnh phía bắc như Ninh Bình, Hà Nam, Bắc Ninh... và đánh đến tận Thăng Long. Nhà Mạc phải rời bỏ kinh thành chạy lánh nạn nơi này nơi khác. Đông Kinh ngày một điêu tàn.\n\nĐến năm 1585, không chịu nổi kiếp sống lưu vong trường kỳ như vậy, Mạc Mậu Hợp quyết định trở lại Đông Kinh. Một đợt xây dựng đại quy mô được khởi động.\n\nNăm 1599, Trịnh Tùng đuổi được nhà Mạc lên Cao Bằng tiến về tiếp quản Thăng Long. Hoàng Thành được tu sửa trong một tháng để đón vua Lê ra. Rồi từ ấy trở đi những cung điện mới xây ở đều nằm trong phủ Chúa Trịnh.Thời Lê Trung Hưng, với sự hiện diện của lầu Kính Thiên trong phủ chúa Trịnh, điện Kính Thiên được sử dụng làm nơi thờ trời đất và diễn ra những nghi thức quan trọng như lễ lên ngôi và ban chiếu, lễ thánh thọ, lễ tiết chính đán... các vua Lê thời Lê Trung Hưng chủ yếu làm việc tại điện Cần Chánh.",
        "title": "Giai đoạn Lê - Mạc từ thế kỷ XV đến thế kỷ XVIII"
      },
      {
        "description": "Năm 1788, Lê Chiêu Thống cầu viện nhà Thanh, Tôn Sĩ Nghị đem đại quân 29 vạn người sang chiếm Thăng Long không tốn một hòn đạn mũi tên. Đầu năm 1789, Quang Trung Nguyễn Huệ ra Bắc lần thứ ba đánh tan quân Thanh, Lê Chiêu Thống chạy sang Trung Quốc, triều Hậu Lê kết thúc, Quang Trung định đô ở Phú Xuân. Thăng Long chỉ còn là Bắc thành.\nNăm 1802 sau khi tiêu diệt xong Tây Sơn, Nguyễn Ánh lên ngôi Hoàng Đế. Kinh đô vẫn được đặt ở Phú Xuân. Thăng Long vẫn mang tên gọi là Thăng Long nhưng chữ \"Long\" là rồng bị chuyển thành chữ \"Long\" nghĩa là thịnh vượng ý rằng nhà vua không còn ở đấy. Đồng thời những gì còn sót lại của Hoàng Thành sau những trận đại hủy diệt cuối thế kỷ XVIII cũng lần lượt bị các đời vua nhà Nguyễn chuyển nốt vào Phú Xuân phục vụ cho công cuộc xây dưng kinh thành mới. Chỉ duy có điện Kính Thiên và Hậu Lâu được giữ lại làm hành cung cho các vua Nguyễn mỗi khi Ngự giá Bắc thành.\n[8]\n\nNăm 1805, Gia Long cho phá bỏ tường của Hoàng Thành cũ vì cho rằng đây chỉ còn là Trấn Bắc thành nên không được có quy mô lớn hơn kinh thành Huế, mà Hoàng Thành Thăng Long thì rộng lớn quá. Gia Long cho xây dựng thành mới theo kiểu Vauban của Pháp. Về quy mô thì nhỏ hơn thành cũ nhiều.\n\nNăm 1831, trong cuộc cải cách hành chính lớn Minh Mạng đã cho đổi tên Thăng Long thành tỉnh Hà Nội. Cái tên này tồn tại cho đến năm 1888 khi nhà Nguyễn chính thức nhượng hẳn Hà Nội cho Pháp. Người Pháp đổi Hà Nội thành thành phố. Đến khi chiếm xong toàn Đông Dương họ lại chọn đây là thủ đô của Liên Bang Đông Dương thuộc Pháp. Thành Hà Nội bị phá đi hoàn toàn để lấy đất làm công sở và trại lính cho người Pháp. Ngoại trừ cửa Bắc và cột cờ những gì còn sót lại của thành Hà Nội đến hôm nay chỉ là di chỉ khảo cổ và phục dựng.",
        "title": "Giai đoạn từ kinh thành Thăng Long sang tỉnh Hà Nội"
      },
      {
        "description": "Thành Hà Nội do Gia Long xây dựng cũng làm theo thể thức các tỉnh thành khác và điều chủ yếu là không được to rộng hơn Phú Xuân. Năm 1804, hoàng thành cũ bị phá và năm sau đó một thành chu vi nhỏ hơn (5 km) được xây theo kiểu Vauban của Pháp. Thành hình vuông mỗi bề chừng một cây số xung quanh là hào nước sâu. Bốn bức tường thành tương ứng với bốn con phố hiện nay là: phố Phan Đình Phùng ở phía Bắc, phố Lý Nam Đế ở phía Đông, phố Trần Phú ở phía Nam, đường Hùng Vương ở phía Tây.\n\nTường thành xây bằng gạch hộp chân thành xây băng đá xanh và đá ong. Tường cao 1 trượng 1 thước, dày 4 trượng. Thành mở ra 5 cửa là: cửa Đông (tương ứng với phố cửa Đông bây giờ), cửa Tây (tương ứng với phố Bắc Sơn hiện nay), cửa Bắc (nay vẫn còn), cửa Tây Nam (tương ứng với đoạn giao phố Chu Văn An và Nguyễn Thái Học bây giờ), cửa Đông Nam (tương ứng với đoạn giao phố Điện Biên Phủ và Nguyễn Thái Học bây giờ). Đường vào cửa xây vòm xuyên qua tường thành dài 23 m. Trên mỗi cửa có lầu canh gọi là thú lâu. Xung quanh tường thành là một dải đất rộng 6-7m rồi đến một con hào rộng 15–16 m, sâu 5 m thông với sông Tô Lịch và sông Hồng. Hào lúc nào cũng có nước nhưng thường chỉ cao khoảng 1 m.\n\nPhía ngoài các cổng thành có xây một hàng tường đắp liền trên bờ hào gọi là Dương mã thành, dài 2 trượng 9 thước, cao 7 thước 5 tấc. Các Dương mã thành đều cố một cửa bên gọi là Nhân Môn. Từ ngoài thành đi vào đều phải đi qua Nhân Môn rồi mới đến cổng thành.\nPhía trong thành được bố trí như sau:\n\nỞ trung tâm thành là điện Kính Thiên được xây dựng từ thời Lê trên núi Nùng. Điện dựng trên những cột gỗ lim lớn người ôm không xuể. Thềm điện có hai đôi rồng đá rất đẹp cũng từ thời Lê. Sau điện này bị người Pháp phá hủy và xây trên nền cũ tòa nhà Con Rồng để làm trụ sở pháo binh Pháp. Sau năm 1954 nhà con Rồng lại trở thành trụ sở của Bộ Tổng Tham mưu Quân đội Nhân dân Việt Nam. Đây cũng chính là nơi diễn ra cuộc họp Bộ Chính trị mở rộng ngày 21 tháng 3 năm 1975 hạ quyết tâm giải phóng miền Nam trong hai năm 75-76.\n\nPhía đông thành là nhiệm sở của Tổng trấn Bắc thành Nguyễn Văn Thành đầu triều Nguyễn. Phía tây là kho thóc, kho tiền, và dinh bố chính là viên quan phụ trách những kho ấy.\n\nNăm 1812 dựng Cột cờ Hà Nội ở phía nam thành.\n\nNăm 1835, vì cho rằng thành Hà Nội cao hơn kinh thành Huế, Minh Mạng cho xén bớt 1 thước 8 tấc, thành Hà Nội chỉ còn cao chừng 5 m\n\nNăm 1848, vua Tự Đức cho phá dỡ các cung điện thời nhà Hậu Lê còn lại trong thành, những đồ chạm khắc mỹ thuật bằng gỗ, đá đều đưa về Huế để trang trí các cung điện trong đó, chỉ còn sót lại rồng đá ở điện Kính Thiên...[9]",
        "title": "Giai đoạn tỉnh thành Hà Nội thời Nguyễn"
      }
    ]
  },
  {
    "name": "Vườn quốc gia Phong Nha - Kẻ Bàng",
    "location": "Huyện Bố Trạch và huyện Minh Hóa, tỉnh Quảng Bình\n17°30′0″B 106°10′30″Đ",
    "types": "Di tích lịch sử, danh lam thắng cảnh[6]",
    "detailLink": "https://vi.wikipedia.org/wiki/V%C6%B0%E1%BB%9Dn_qu%E1%BB%91c_gia_Phong_Nha_-_K%E1%BA%BB_B%C3%A0ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Phongnhakebang6.jpg/250px-Phongnhakebang6.jpg",
    "description": "Vườn quốc gia Phong Nha – Kẻ Bàng là một vườn quốc gia của Việt Nam, nằm tại huyện Bố Trạch và Minh Hóa, tỉnh Quảng Bình, cách thành phố Đồng Hới khoảng 50 km về phía Tây Bắc, cách thủ đô Hà Nội khoảng 500 km về phía nam[1][2]. Vườn quốc gia này giáp khu bảo tồn thiên nhiên Hin Namno ở tỉnh Khammouan, Lào về phía tây; cách Biển Đông 42 km về phía đông kể từ đường biên giới của vườn quốc gia này.",
    "events": []
  },
  {
    "name": "Chiến trường Điện Biên Phủ",
    "location": "Thành phố Điện Biên Phủ, huyện Điện Biên và huyện Tuần Giáo, tỉnh Điện Biên\n21°23′13″B 103°0′56″Đ",
    "types": "Di tích lịch sử[8]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-DT%C4%90BP-8",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/H%E1%BA%A7m_ch%E1%BB%89_huy_c%E1%BB%A9_%C4%91i%E1%BB%83m_%C4%90i%E1%BB%87n_Bi%C3%AAn_Ph%E1%BB%A7.jpg/180px-H%E1%BA%A7m_ch%E1%BB%89_huy_c%E1%BB%A9_%C4%91i%E1%BB%83m_%C4%90i%E1%BB%87n_Bi%C3%AAn_Ph%E1%BB%A7.jpg",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Quần thể di tích Cố đô Huế",
    "location": "Thành phố Huế, thị xã Hương Thủy, thị xã Hương Trà, huyện Phú Vang, huyện Phú Lộc, tỉnh Thừa Thiên Huế\n16°28′11″B 107°34′40″Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[9]",
    "detailLink": "https://vi.wikipedia.org/wiki/Qu%E1%BA%A7n_th%E1%BB%83_di_t%C3%ADch_C%E1%BB%91_%C4%91%C3%B4_Hu%E1%BA%BF",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Ho%C3%A0ng_th%C3%A0nh_Hu%E1%BA%BF.jpg/250px-Ho%C3%A0ng_th%C3%A0nh_Hu%E1%BA%BF.jpg",
    "description": "Quần thể di tích Cố đô Huế hay Quần thể kiến trúc cố đô Huế là những di tích lịch sử - văn hóa do triều Nguyễn chủ trương xây dựng trong khoảng thời gian từ đầu thế kỷ 19 đến nửa đầu thế kỷ 20 trên địa bàn kinh đô Huế xưa; nay thuộc phạm vi thành phố Huế, Việt Nam. Phần lớn các di tích này nay thuộc sự quản lý của Trung tâm Bảo tồn Di tích Cố đô Huế và được UNESCO công nhận là Di sản Văn hoá Thế giới vào ngày 11 tháng 12 năm 1993. Hiện tại, cố đô Huế đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 130 di tích quốc gia đặc biệt quan trọng. Quần thể di tích Cố đô Huế có thể phân chia thành các cụm công trình gồm các cụm công trình ngoài Kinh thành Huế và trong kinh thành Huế.",
    "events": []
  },
  {
    "name": "Khu lưu niệm Chủ tịch Hồ Chí Minh tại Phủ Chủ tịch",
    "location": "Quận Ba Đình, thành phố Hà Nội\n21°2′20″B 105°50′3″Đ",
    "types": "Di tích lịch sử[11]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_Ph%E1%BB%A7_Ch%E1%BB%A7_t%E1%BB%8Bch",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Ho_Chi_Minh%27s_Stilt_House%2C_Hanoi_%282%29_%2824622695398%29.jpg/250px-Ho_Chi_Minh%27s_Stilt_House%2C_Hanoi_%282%29_%2824622695398%29.jpg",
    "description": "Khu di tích Chủ tịch Hồ Chí Minh tại Phủ Chủ tịch, gọi tắt là Khu di tích Phủ Chủ tịch tại Hà Nội, là nơi sống và làm việc lâu nhất của Chủ tịch Hồ Chí Minh (từ 19 tháng 12 năm 1954 đến 2 tháng 9 năm 1969), được Bộ Văn hóa Thông tin ra Quyết định xếp hạng là Khu di tích ngày 15 tháng 5 năm 1975. Hiện nay, nơi đây đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 23 di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Dinh Độc Lập",
    "location": "Quận 1, Thành phố Hồ Chí Minh10°46′37″B 106°41′43″Đ",
    "types": "Di tích lịch sử[12]",
    "detailLink": "https://vi.wikipedia.org/wiki/Dinh_%C4%90%E1%BB%99c_L%E1%BA%ADp",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Palacio_de_la_Reunificaci%C3%B3n%2C_Ciudad_Ho_Chi_Minh%2C_Vietnam%2C_2013-08-14%2C_DD_03.JPG/250px-Palacio_de_la_Reunificaci%C3%B3n%2C_Ciudad_Ho_Chi_Minh%2C_Vietnam%2C_2013-08-14%2C_DD_03.JPG",
    "description": "Dinh Độc Lập là một tòa nhà của nhà nước tại Thành phố Hồ Chí Minh, từng là nơi ở và làm việc của Tổng thống Việt Nam Cộng hòa trước Sự kiện 30 tháng 4 năm 1975. Hiện nay, Dinh Độc Lập đã được Chính phủ Việt Nam xếp hạng là di tích quốc gia đặc biệt. Cơ quan quản lý di tích văn hoá Dinh Độc Lập có tên là Hội trường Thống Nhất thuộc Văn phòng Chính phủ.",
    "events": [
      {
        "description": "Dinh Độc Lập hiện nay được Tổng thống Ngô Đình Diệm cho khởi công xây dựng ngày 1 tháng 7 năm 1962, sau khi dinh cũ từ thời Pháp thuộc bị hư hại do vụ đánh bom của hai phi công. Dinh được xây theo bản thiết kế của kiến trúc sư Ngô Viết Thụ, người Việt Nam đầu tiên đạt giải Khôi nguyên La Mã.\n\nTrong thời gian xây dựng, gia đình Tổng thống Ngô Đình Diệm tạm thời chuyển sang sống tại Dinh Gia Long. Công trình đang xây dựng dở dang thì Ngô Đình Diệm bị phe đảo chính ám sát ngày 2 tháng 11 năm 1963. Do vậy, ngày khánh thành dinh, 31 tháng 10 năm 1966, người chủ tọa buổi lễ là Nguyễn Văn Thiệu, Chủ tịch Ủy ban Lãnh đạo Quốc gia. Từ ngày này, Dinh Độc Lập mới xây dựng trở thành nơi ở và làm việc của tổng thống Việt Nam Cộng hòa. Tổng thống Nguyễn Văn Thiệu sống ở dinh này từ tháng 10 năm 1967 đến ngày 21 tháng 4 năm 1975.\nNgày 8 tháng 4 năm 1975, chiếc máy bay F-5E do phi công Nguyễn Thành Trung lái, xuất phát từ Biên Hòa, đã ném bom Dinh nhằm mục đích ám sát Tổng thống Nguyễn Văn Thiệu, gây hư hại không đáng kể. \n\nLúc 10 giờ 45 phút ngày 30 tháng 4 năm 1975, xe tăng T54B mang số hiệu 843 của Quân đội Nhân dân Việt Nam dưới quyền chỉ huy của Trung úy Bùi Quang Thận đã húc nghiêng cổng phụ của Dinh Độc Lập, tiếp đó xe tăng Type 59 mang số hiệu 390 do Vũ Đăng Toàn chỉ huy đã húc tung cổng chính tiến thẳng vào dinh. Lúc 11 giờ 30 phút cùng ngày, Trung úy Quân Giải phóng Bùi Quang Thận, đại đội trưởng, chỉ huy xe 843, đã hạ quốc kỳ Việt Nam Cộng hòa trên nóc dinh xuống, kéo lá cờ Mặt trận Dân tộc Giải phóng miền Nam Việt Nam lên, kết thúc 20 năm cuộc chiến tranh Việt Nam",
        "title": "Thời Việt Nam Cộng hòa"
      },
      {
        "description": "Sau hội nghị hiệp thương chính trị thống nhất hai miền Nam Bắc thành một đất nước Việt Nam thống nhất diễn ra tại dinh Độc Lập vào tháng 11 năm 1975. Cơ quan hiện quản lý di tích văn hoá Dinh Độc Lập có tên là Hội trường Thống Nhất[1] thuộc Cục Hành chính Quản trị II - Văn phòng Chính phủ.\n\nĐây là di tích lịch sử văn hoá nổi tiếng được đông đảo du khách trong nước và nước ngoài đến tham quan. Nơi này được công nhận là Di tích lịch sử văn hóa quốc gia tại Quyết định số 77A/VHQĐ ngày 25/6/1976 của Bộ trưởng Bộ Văn hóa (Bộ Văn hóa, Thể thao và Du lịch ngày nay). Thủ tướng Chính phủ nước Cộng hòa Xã hội Chủ nghĩa Việt Nam đã ký Quyết định số 1272/QĐ-TTg xếp hạng Di tích lịch sử Dinh Độc Lập là một trong 10 di tích quốc gia đặc biệt đầu tiên của Việt Nam vào ngày 12 tháng 8 năm 2009.\n\nNgày nay, Dinh Độc Lập trở thành một trong những địa điểm du lịch không thể thiếu của mỗi người dân khi tới Thành phố Hồ Chí Minh. Không chỉ có ý nghĩa về lịch sử mà Dinh Độc Lập còn thể hiện nét kiến trúc tiêu biểu của Việt Nam thời kì những thập niên 60. Ngoài ra, Dinh Độc Lập thường là nơi diễn ra các sự kiện lớn tổ chức tại thành phố, các buổi tiếp khách của Đảng, Nhà nước tại TPHCM cũng như chính quyền thành phố. Đồng thời là nơi tổ chức quốc tang cho các lãnh đạo Đảng, Nhà nước ở TPHCM và là điểm dừng cuối cùng của giải đua Cúp Truyền Hình HTV hàng năm.",
        "title": "Sau năm 1975"
      }
    ]
  },
  {
    "name": "Đền Hùng",
    "location": "Thành phố Việt Trì, huyện Lâm Thao, huyện Phù Ninh, tỉnh Phú Thọ 21,3672941°B 105,3238621°Đ",
    "types": "Di tích lịch sử[13]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_H%C3%B9ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/%C4%90%C6%B0%E1%BB%9Dng_l%C3%AAn_%C4%90%E1%BB%81n_H%C3%B9ng_-_panoramio.jpg/250px-%C4%90%C6%B0%E1%BB%9Dng_l%C3%AAn_%C4%90%E1%BB%81n_H%C3%B9ng_-_panoramio.jpg",
    "description": "Đền Hùng (Tên chữ: Hùng Vương miếu) là tên gọi khái quát của Khu di tích lịch sử Đền Hùng - quần thể đền chùa thờ phụng các Vua Hùng và tôn thất của nhà vua trên núi Nghĩa Lĩnh (Việt Trì, Phú Thọ), xưa thuộc xã Hy Cương, huyện Sơn Vi, gắn với Giỗ Tổ Hùng Vương - Lễ hội Đền Hùng được tổ chức tại địa điểm đó hàng năm vào ngày 10 tháng 3 âm lịch. Hiện nay, theo các tài liệu khoa học đã công bố đa số đều thống nhất nền móng kiến trúc đền Hùng bắt đầu được xây dựng từ thời vua Đinh Tiên Hoàng trị vì. Đến thời Hậu Lê (thế kỷ 15) được xây dựng hoàn chỉnh theo quy mô như hiện tại.",
    "events": []
  },
  {
    "name": "Đô thị cổ Hội An",
    "location": "Thành phố Hội An, tỉnh Quảng Nam 15,878605°B 108,33483°Đ",
    "types": "Di tích kiến trúc nghệ thuật[14]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ph%E1%BB%91_c%E1%BB%95_H%E1%BB%99i_An",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/PhoCoHoiAn.jpg/250px-PhoCoHoiAn.jpg",
    "description": "Phố cổ Hội An là một đô thị cổ nằm ở hạ lưu sông Thu Bồn, thuộc vùng đồng bằng ven biển tỉnh Quảng Nam, Việt Nam, cách thành phố Đà Nẵng khoảng 30 km về phía Nam. Nhờ những yếu tố địa lý và khí hậu thuận lợi, Hội An từng là một thương cảng quốc tế sầm uất, nơi gặp gỡ của những thuyền buôn Nhật Bản, Trung Quốc và phương Tây trong suốt thế kỷ XVII và XVIII. Trước thời kỳ này, nơi đây cũng từng có những dấu tích của thương cảng Chăm Pa hay được nhắc đến cùng con đường tơ lụa trên biển. Thế kỷ XIX, do giao thông đường thủy ở đây không còn thuận tiện, cảng thị Hội An dần suy thoái, nhường chỗ cho Đà Nẵng khi đó đang được người Pháp xây dựng. Hội An may mắn không bị tàn phá trong hai cuộc chiến tranh và tránh được quá trình đô thị hóa ồ ạt cuối thế kỷ 20. Bắt đầu từ thập niên 1980, những giá trị kiến trúc và văn hóa của phố cổ Hội An dần được giới học giả và cả du khách chú ý, khiến nơi đây trở thành một trong những điểm du lịch hấp dẫn của Việt Nam.",
    "events": [
      {
        "description": "Khu đô thị cổ Hội An nằm gần cửa sông Thu Bồn, con sông lớn nhất của tỉnh Quảng Nam. Mặc dù vậy, ngày nay từ trung tâm thành phố tới đến cửa sông cũng không còn gần lắm. Hạ lưu sông Thu Bồn khi đổ ra biển Đông được chia thành nhiều nhánh. Nhánh tiếp xúc với khu phố cổ mang tên sông Hội An, còn dòng chảy giữa hai cồn Cẩm Nam và Cẩm Kim là dòng chính của sông Thu Bồn.[6] Trên những bản đồ cổ thế kỷ 17, 18, Hội An nằm trên bờ Bắc của sông Thu Bồn, thông với biển Đông bẳng cửa Đại Chiêm và một dòng sông nối với cửa Đại của Đà Nẵng, phía ngoài là một doi cát rộng. Dấu vết dòng sông nối liền Hội An với biển Cửa Hàn có thể xác định là con sông Cổ Cò - Đế Võng ngày nay. Trên thủy trình cổ này đã từng tìm thấy nhiều lô tàu, mỏ neo bị chôn vùi trong lòng đất.[7]\n\nTuy địa danh \"Hội An\" được cho rằng xuất hiện vào khoảng cuối thế kỷ 16, nhưng vùng đất xung quanh đô thị này đã có một lịch sử rất lâu đời. Trong suốt thời kỳ \"tiền Hội An\", nơi đây từng tồn tại hai nền văn hóa lớn, đó là văn hóa Sa Huỳnh và văn hóa Chăm Pa. Di chỉ đầu tiên của văn hóa Sa Huỳnh là phố Sa Huỳnh ở Quảng Ngãi bị cát vùi lấp, được các nhà khảo cổ người Pháp phát hiện. Năm 1937, nữ học giả Madeleine Colani chính thức xác nhận đây là một nền văn hóa. Chỉ riêng trong khu vực thành phố Hội An đã phát hiện được hơn 50 địa điểm là di tích của nền văn hóa này, phần lớn tập trung ở những cồn cát ven sông Thu Bồn cũ.[8] Đặc biệt, sự phát hiện hai loại tiền đồng Trung Quốc thời Hán, những hiện vật sắt kiểu Tây Hán... đã minh chứng ngay từ đầu Công nguyên, nơi đây đã bắt đầu có những giao dịch ngoại thương.[9] Một đặc điểm khác có thể nhận thấy là khu vực Hội An không có những dấu tích của thời kỳ đầu và giữa,[10] nhưng mảnh đất nơi đây đã từng tồn tại và có sự phát triển rực rỡ nền văn hóa Sa Huỳnh muộn.[9]\n\nTiếp sau nền văn hóa Sa Huỳnh, suốt từ thế kỷ 2 đến đến thế kỷ 15, một dải đất miền trung Việt Nam nằm dưới sự thống trị của vương quốc Chăm Pa. Những di tích đặc trưng của nền văn hóa này là các nhóm điện thờ đạo Hindu phân bổ dọc từ miền Trung tới miền Nam, và một trong những trung tâm đó nằm ở lưu vực con sông Thu Bồn. Ở đây, có thể thấy một thủ phủ mang tính chính trị tại Trà Kiệu và một trung trung tâm mang tính tôn giáo nằm tại Sởn Mi.[11] Những dấu tích đền tháp Chăm còn lại, những giếng nước Chăm, những pho tượng Chăm, những di vật của người Đại Việt, Trung Hoa, Trung Đông thế kỷ 2 - 14 làm sáng tỏ giả thuyết nơi đây từng có một Lâm Ấp Phố với một cảng biển là Đại Chiêm phát triển hưng thịnh. Nhiều thư tịch cổ ghi nhận trong một thời gian khá dài, Chiêm cảng - Lâm Ấp Phố đóng một vai trò quan trọng trong việc tạo nên sự phồn vinh của kinh thành Trà Kiệu và khu di tích đền tháp Mỹ Sơn.[9] Trải qua nhiều cuộc chiến tranh, vương quốc Chăm Pa bị Đại Việt đẩy dần về phía Nam. Năm 1471, thủ phủ cuối cùng của Chăm Pa ở Bầu Giá, Bình Định ngày nay, bị nhà Lê chiếm. Vùng đất Hội An trở thành lãnh thổ của Đại Việt từ đó, nhưng phải về sau nơi đây mới phát triển thành một khu vực thương mại. Hội An được hình thành dựa trên sự kế thừa cảng biển của người Chăm và người Việt bắt đầu tới đây từ thế kỷ 15. Đó là bước chuẩn bị trực tiếp cho sự ra đời của đô thị Hội An.[11]",
        "title": "Thời kỳ tiền Hội An"
      },
      {
        "description": "Hội An ra đời vào khoảng nửa cuối thế kỷ 16, thời kỳ Việt Nam nằm dưới sự trị vì của nhà Lê. Vào năm 1527, Mạc Đăng Dung giành ngôi nhà Lê, vùng Đông Kinh thuộc quyền cai quản của nhà Mạc. Năm 1533, Nguyễn Kim nhân danh nhà Lê tập hợp binh sĩ chống lại nhà Mạc. Sau khi Nguyễn Kim chết năm 1545, người con rể Trịnh Kiểm nắm giữ quyền hành, dòng họ Nguyễn Kim bị lấn át. Năm 1558, người con thứ của Nguyễn Kim là Nguyễn Hoàng cùng gia quyến và một số binh lính lui về cố thủ ở vùng Thuận Hóa và từ sau năm 1570, Nguyễn Hoàng tiếp tục nắm quyền trấn thủ Quảng Nam.[12] Cùng với con trai là Nguyễn Phúc Nguyên, Nguyễn Hoàng xây dựng thành lũy, ra sức phát triển kinh tế Đàng Trong, mở rộng giao thương buôn bán với nước ngoài và Hội An trở thành thương cảng quốc tế sầm uất bậc nhất khu vực Đông Nam Á thời kỳ đó.[13]\n\nThế kỷ 17, trong khi vẫn tiếp tục cuộc chiến với chúa Trịnh ở miền Bắc, chúa Nguyễn không ngừng khai phá miền Nam, lấn chiếm lãnh thổ của người Chăm. Trên những vùng đất do chúa Nguyễn cai quản, có những khu phố nước ngoài hình thành dựa trên một số luật lệ nhằm bảo hộ cho các hoạt động thương mại của người ngoại quốc.[14] Vào năm 1567, triều đình nhà Minh của Trung Quốc từ bỏ chủ trương bế quan tỏa cảng, cho thuyền buôn vượt biển giao thương với các quốc gia vùng Đông Nam Á, nhưng vẫn cấm xuất khẩu một số nguyên liệu quan trọng sang Nhật Bản. Điều này đã bắt buộc Mạc phủ Toyotomi rồi Mạc phủ Tokugawa cấp phép cho các thuyền buôn Châu Ấn sang mở rộng quan hệ thông thương với Đông Nam Á và mua lại hàng hóa Trung Quốc từ các quốc gia đó.[15] Những con tàu Châu Ấn bắt đầu xuất dương từ năm 1604 dưới thời Mặc phủ Tokugawa, cho tới năm 1635, khi chính sách đóng cửa được ban bố, đã có ít nhất 356 con tàu Châu Ấn ra đời.[14] Nơi thuyền Châu Ấn đi qua nhiều nhất chính là cảng Hội An. Trong vòng 30 năm, 75 con tàu Châu Ấn đã cập cảng nơi đây, so với 37 con tàu cập bến Đông Kinh, khu vực do chúa Trịnh cai trị.[16] Các thương nhân người Nhật khi đó tới bán những đồ đồng, tiền đồng, sắt, đồ gia dụng... và mua lại đường, tơ lụa, trầm hương... Khoảng năm 1617, phố Nhật Bản ở Hội An được hình thành[14] và phát triển cực thịnh trong đầu thế kỷ 17.[17] Qua bức họa Giao Chỉ quốc mậu dịch độ hải đồ của Chaya Shinroku, có thể thấy khu phố người Nhật với những công trình kết cấu gỗ hai, ba tầng.[14] Thuyền trưởng người Hà Lan Delft Haven ghi lại năm 1651, Hội An khi đó có khoảng 60 căn nhà của người Nhật nơi dọc bờ sông, nhà cửa xây bằng đá để tránh hỏa hoạn, nằm sát vách nhau.[18] Nhưng khoảng thời gian tiếp sau, do chính sách bế quan của Mạc phủ Tokugawa cũng những chính sách đàn áp người Nhật Công giáo của chúa Nguyễn,[19] khu phố Nhật ở Hội An dần bị lu mờ. Mặc dù vẫn còn một số nhỏ người Nhật định cư lại đây nhưng người Hoa dần thay thế vai trò của người Nhật trong việc buôn bán.[14]\n\nKhác với người Nhật, những người Hoa biết đến Hội An từ rất sớm, ngày từ thời vùng đất này còn thuộc về vương quốc Chăm Pa. Đến thời kỳ người Việt thay thế người Chăm, những thương nhân Trung Hoa vẫn tiếp tục tới buôn bán vì các tỉnh miền Nam của Trung Quốc rất cần các mặt hàng muối, vàng, quế... Mặc dù vậy, trong suốt thời kỳ tiền Hội An, người Hoa chỉ tới buôn bán rồi trở về, không ở lại định cư, lập phố xá.[20] Phải sau loạn Minh Thanh xảy ra khoảng giữa thế kỷ 17, đặc biệt sau khi nhà Minh bị thất thủ, rất nhiều người Hoa di cư tới Trung Bộ Việt Nam và xây dựng nên nhiều cộng đồng Minh Hương Xã. Tại Hội An, người Hoa tới lưu trú ngày một nhiều và thế chân người Nhật nắm quyền buôn bán. Cảng thị Hội An khi đó là nơi tập trung nhiều nhất hàng hóa ngoại quốc. Khu phố dọc bờ sông, được gọi khu Đại Đường, kéo dài 3, 4 dặm. Các cửa hàng hai bên phố không khi nào rảnh rỗi. Dân cư ở đây phần lớn là người Phúc Kiến, mọi người ăn vận theo trang phục của nhà Minh. Nhiều người Trung Quốc tới định cư để buôn bán đã kết hôn với những phụ nữ bản địa.[21] Bên cạnh những người Hoa nhập quốc tịch Việt Nam, nhiều người Hoa khác vẫn giữ quốc tịch Trung Quốc mà người Việt thường gọi là Khách trú.[22] Năm 1695, sứ giả người Anh Thomas Bowyear của Công ty Đông Ấn Anh đến đàm phán với chúa Nguyễn về việc xây dựng một khu cư trú tại Hội An. Việc thương thảo tuy không thành, nhưng cũng đã để lại một ghi chép:\n\nThế kỷ 18, khi cuộc khởi nghĩa Tây Sơn diễn ra ở miền Nam, chúa Trịnh đánh chiếm Quảng Nam dinh năm 1775, cảng thị Hội An rơi vào cảnh chiến tranh loạn lạc.[23] Sau khi chiếm được Hội An, quân Trịnh đã triệt phá những nhà cửa thuộc khu vực thương mại, chỉ để lại các công trình tín ngưỡng.[24] Nhiều nhân vật quan trọng của dòng họ Nguyễn cùng những thương gia người Hoa giàu có đã di cư vào miền Nam, mang theo của cải và lập nghiệp tại Sài Gòn - Chợ Lớn, để lại một Hội An điêu tàn, đổ nát.[25] Năm 1778, một người Anh Charles Chapman đi qua đây sau thời Tây Sơn đã ghi lại: \"Khi tới Hội An, thành phố lớn này chẳng còn lại là bao những khu phố được quy hoạch quy củ với những ngôi nhà xây bằng gạch, đường lát đá mà chỉ thấy một cảnh hoang tàn làm cho ta cảm thấy xót xa. Trời ơi, những công trình ấy bây giờ chỉ còn đọng lại trong ký ức mà thôi.\"[26] Khoảng 5 năm sau, cảng thị Hội An mới dần dần hồi sinh, hoạt động thương mại được phục hồi nhưng không được như trước. Người Việt cùng người Hoa cùng xây lại thành phố từ những đống đổ nát cũ, những ngôi nhà mới mọc lên theo kiến trúc của họ và vô tình, dấu vết của khu phố Nhật Bản đã bị xóa đi mãi mãi.[27]\n\nThế kỷ 19, cửa sông Cửa Đại ngày càng bị thu hẹp lại và con sông Cổ Cò cũng bị phù sa bồi lấp, khiến các thuyền lớn không còn ghé được cảng Hội An. Bên cạnh đó, triều đình nhà Nguyễn cũng thực hiện chính sách đóng cửa, hạn chế quan hệ với nước ngoài, đặc biệt các quốc gia phương Tây. Từ đó, Hội An dần suy thoái, mất đi vị thế cảng thị quốc tế quan trọng.[28] Mặc dù vậy, với vai trò một trung tâm thương nghiệp lớn, thành phố vẫn được phát triển, những con đường mới về phía Nam dòng sông được xây dựng và các khu phố được mở rộng thêm.[26] Năm Minh Mạng thứ 5, nhà vua có qua Hội An, nhận thấy nơi đây không còn sầm uất như xưa, nhưng vẫn hưng thịnh hơn các thị trấn khác của người Việt.[25] Năm 1888, khi Đà Nẵng trở thành nhượng địa của Pháp, nhiều người Hoa tới đó để bỏ vốn lập các cơ sở vận tải, thương mại, một số khác tiếp tục duy trì hoạt động kinh doanh ở cả Hội An và Đà Nẵng.[29] Nhưng do giao thông đường thủy ngày càng trở nên khó khăn, cùng với chính sách phát triển Đà Nẵng của người Pháp, hoạt động thương nghiệp ở Hội An dần bị đình trệ. Mặc dù vậy, phần lớn các kiến trúc nhà ở trong khu phố cổ, các hội quán còn lại đến ngày nay đều có hình dáng được tạo nên từ giai đoạn này.[30]\n\nĐầu thế kỷ 20, tuy mất đi vai trò cảng thị quan trọng, hoạt động buôn bán ở Hội An chưa khi nào chấm dứt và nơi đây vẫn là thị xã, thủ phủ của tỉnh Quảng Nam. Khi tỉnh Quảng Nam-Đà Nẵng được thành lập vào năm 1976, thành phố Đà Nẵng trở thành tỉnh lỵ của tỉnh mới, Hội An rơi vào một thời kỳ bị quên lãng.[29] Chính nhờ sự thay đổi vai trò trong lịch sử, cộng với nhiều yếu tố khác nên Hội An đã may mắn tránh được sự biến dạng của quá trình đô thị hóa mạnh mẽ ở Việt Nam trong thế kỷ 20.[31] Từ thập niên 1980, Hội An bắt đầu nhận được sự chú ý của các học giả Việt Nam, Nhật Bản và phương Tây. Tại kỳ họp lần thứ 23 từ 29 tháng 11 đến 4 tháng 12 năm 1999 ở Marrakech, Tổ chức Giáo dục Khoa học và Văn hóa Liên Hợp Quốc đã ghi tên Hội An vào danh sách các di sản thế giới. Đô thị cổ Hội An dần phồn vinh trở lại nhờ những hoạt động du lịch.[13]",
        "title": "Thời kỳ Hội An"
      }
    ]
  },
  {
    "name": "Khu đền tháp Mỹ Sơn",
    "location": "Huyện Duy Xuyên, tỉnh Quảng Nam 15°46′0″B 108°07′0″Đ",
    "types": "Di tích kiến trúc nghệ thuật[15]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1nh_%C4%91%E1%BB%8Ba_M%E1%BB%B9_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Les_Temples_Cham_de_My_Son_%284399060825%29.jpg/250px-Les_Temples_Cham_de_My_Son_%284399060825%29.jpg",
    "description": "Thánh địa Mỹ Sơn thuộc xã Duy Phú, huyện Duy Xuyên, tỉnh Quảng Nam, cách thành phố Đà Nẵng khoảng 69 km và gần thành cổ Trà Kiệu, bao gồm nhiều đền đài Chăm Pa, trong một thung lũng đường kính khoảng 2 km, bao quanh bởi đồi núi. Đây từng là nơi tổ chức cúng tế của vương triều Chăm Pa. Thánh địa Mỹ Sơn được coi là một trong những trung tâm đền đài chính của Ấn Độ giáo ở khu vực Đông Nam Á và là di sản duy nhất của thể loại này tại Việt Nam.",
    "events": []
  },
  {
    "name": "Vịnh Hạ Long",
    "location": "Thành phố Hạ Long, thành phố Cẩm Phả, huyện Vân Đồn, tỉnh Quảng Ninh 20,876777°B 107,137184°Đ",
    "types": "Danh lam thắng cảnh[16]",
    "detailLink": "https://vi.wikipedia.org/wiki/V%E1%BB%8Bnh_H%E1%BA%A1_Long",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Ha_Long_bay_The_Kissing_Rocks.jpg/250px-Ha_Long_bay_The_Kissing_Rocks.jpg",
    "description": "",
    "events": []
  },
  {
    "name": "Cố đô Hoa Lư",
    "location": "Thành phố Hoa Lư, tỉnh Ninh Bình20,2816137°B 105,8968394°Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[17]",
    "detailLink": "https://vi.wikipedia.org/wiki/C%E1%BB%91_%C4%91%C3%B4_Hoa_L%C6%B0",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Temple_comm%C3%A9moratif_au_roi_Dinh_Tien_Hoang_%28Hoa_Lu%29.jpg/250px-Temple_comm%C3%A9moratif_au_roi_Dinh_Tien_Hoang_%28Hoa_Lu%29.jpg",
    "description": "Cố đô Hoa Lư (chữ Hán: 華閭) là kinh đô của Việt Nam trong giai đoạn 968-1010. Đây là kinh đô đầu tiên của nhà nước phong kiến Trung ương tập quyền ở Việt Nam và là quê hương của vị Anh hùng dân tộc Đinh Bộ Lĩnh.[1] Kinh đô Hoa Lư tồn tại 42 năm, gắn với sự nghiệp của ba triều đại liên tiếp là nhà Đinh, nhà Tiền Lê và nhà Lý với các dấu ấn lịch sử: thống nhất đất nước, đánh Tống - dẹp Chiêm và phát tích quá trình định đô Hà Nội. Năm 1010 vua Lý Thái Tổ dời kinh đô từ Hoa Lư (Ninh Bình) về Thăng Long (Hà Nội), Hoa Lư trở thành Cố đô. Các triều vua Lý, Trần, Lê, Nguyễn sau đó dù không đóng đô ở Hoa Lư nữa nhưng vẫn cho tu bổ và xây dựng thêm ở đây nhiều công trình kiến trúc như đền, lăng, đình, chùa, phủ,...[2] Hiện nay, Cố đô Hoa Lư vẫn còn nhiều di tích nằm trong Quần thể di sản thế giới Tràng An thuộc địa bàn tỉnh Ninh Bình.",
    "events": []
  },
  {
    "name": "Khu lưu niệm Chủ tịch Tôn Đức Thắng tại Mỹ Hòa Hưng",
    "location": "Thành phố Long Xuyên, tỉnh An Giang 10,3875364°B 105,4047805°Đ[18]",
    "types": "Di tích lịch sử[18]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_l%C6%B0u_ni%E1%BB%87m_Ch%E1%BB%A7_t%E1%BB%8Bch_T%C3%B4n_%C4%90%E1%BB%A9c_Th%E1%BA%AFng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Nh%C3%A0_th%E1%BB%9Di_ni%C3%AAn_thi%E1%BA%BFu_c%E1%BB%A7a_T%C3%B4n_%C4%90%E1%BB%A9c_Th%E1%BA%AFng.jpg/250px-Nh%C3%A0_th%E1%BB%9Di_ni%C3%AAn_thi%E1%BA%BFu_c%E1%BB%A7a_T%C3%B4n_%C4%90%E1%BB%A9c_Th%E1%BA%AFng.jpg",
    "description": "Khu lưu niệm Chủ tịch Tôn Đức Thắng tọa lạc trên cù lao Ông Hổ, thuộc xã Mỹ Hòa Hưng, thành phố Long Xuyên, tỉnh An Giang. Đây là một trong số 23 di tích Việt Nam đã được xếp hạng di tích quốc gia đặc biệt (ký ngày 10 tháng 5 năm 2012, công bố ngày 17 tháng 7 năm 2012).[1]",
    "events": []
  },
  {
    "name": "Căn cứ Trung ương cục miền Nam",
    "location": "Huyện Tân Biên, tỉnh Tây Ninh[19] 11°35′14″B 105°57′53″Đ",
    "types": "Di tích lịch sử[19]",
    "detailLink": "https://vi.wikipedia.org/wiki/Trung_%C6%B0%C6%A1ng_c%E1%BB%A5c_mi%E1%BB%81n_Nam",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Cờ của Mặt trận Dân tộc Giải phóng miền Nam Việt Nam",
    "events": []
  },
  {
    "name": "Nhà tù Côn Đảo",
    "location": "Huyện Côn Đảo, tỉnh Bà Rịa – Vũng Tàu[20] 8°40′57″B 106°36′26″Đ",
    "types": "Di tích lịch sử[20]",
    "detailLink": "https://vi.wikipedia.org/wiki/Nh%C3%A0_t%C3%B9_C%C3%B4n_%C4%90%E1%BA%A3o",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Nh%C3%A0_t%C3%B9_C%C3%B4n_%C4%90%E1%BA%A3o.JPG/250px-Nh%C3%A0_t%C3%B9_C%C3%B4n_%C4%90%E1%BA%A3o.JPG",
    "description": "Nhà tù Côn Đảo là một khu nhà tù tại Côn Đảo. Hệ thống nhà tù này được người Pháp xây dựng để giam giữ những tù phạm đặc biệt nguy hiểm cho chế độ thực dân Pháp như: tù phạm chính trị, tử tù... Nơi đây thời Pháp thuộc đã giam giữ những nhân vật tham gia các phong trào cách mạng và những người ái quốc chống lại chính phủ thuộc địa, và sau đó lại được Mỹ sử dụng để giam cầm tù binh trong cuộc chiến chống Mỹ. Hiện nay, nơi đây đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 23 di tích quốc gia đặc biệt. Địa điểm nổi tiếng nhất trong khu nhà tù này là \"chuồng cọp\". Đây là nơi ghi lại những hành động ngược đãi tù nhân nghiêm trọng của thực dân Pháp, quân đội Mỹ và chế độ Quốc gia Việt Nam/Việt Nam Cộng hòa.[1]",
    "events": []
  },
  {
    "name": "Những địa điểm Khởi nghĩa Yên Thế",
    "location": "Huyện Yên Thế, huyện Việt Yên, huyện Tân Yên và thành phố Bắc Giang, tỉnh Bắc Giang",
    "types": "Di tích lịch sử[21]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_kh%E1%BB%9Fi_ngh%C4%A9a_Y%C3%AAn_Th%E1%BA%BF",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Khu di tích khởi nghĩa Yên Thế gồm nhiều di tích liên quan đến cuộc khởi nghĩa Yên Thế. Khu di tích này đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 23 di tích quốc gia đặc biệt. Trọng tâm của khu di tích khởi nghĩa Yên Thế thuộc huyện Yên Thế tỉnh Bắc Giang, cách Thành phố Bắc Giang 28 km về phía Tây Bắc theo đường tỉnh lộ 284.",
    "events": []
  },
  {
    "name": "Pác Bó",
    "location": "Huyện Hà Quảng, tỉnh Cao Bằng[22]",
    "types": "Di tích lịch sử[22]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_P%C3%A1c_B%C3%B3",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/C%E1%BB%91c_B%C3%B3.jpg/180px-C%E1%BB%91c_B%C3%B3.jpg",
    "description": "Khu di tích Pác Bó là một khu di tích lịch sử cách mạng quốc gia - đặc biệt của Việt Nam, thuộc bản Pác Bó, xã Trường Hà, huyện Hà Quảng, tỉnh Cao Bằng, cách trung tâm thành phố Cao Bằng 52 km về phía Bắc, là điểm đầu (km 0) của đường Hồ Chí Minh [1][2].",
    "events": []
  },
  {
    "name": "Chiến khu Tân Trào",
    "location": "Huyện Sơn Dương và huyện Yên Sơn, tỉnh Tuyên Quang[23]",
    "types": "Di tích lịch sử[23]",
    "detailLink": "https://vi.wikipedia.org/wiki/Chi%E1%BA%BFn_khu_T%C3%A2n_Tr%C3%A0o",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/C%C3%A2y_%C4%90a_l%E1%BB%8Bch_s%E1%BB%AD_T%C3%A2n_Tr%C3%A0o.JPG/180px-C%C3%A2y_%C4%90a_l%E1%BB%8Bch_s%E1%BB%AD_T%C3%A2n_Tr%C3%A0o.JPG",
    "description": "Chiến khu Tân Trào là khu di tích lịch sử của cách mạng Việt Nam thời kỳ Cách mạng tháng Tám. Hiện nay, nơi đây đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 130 di tích quốc gia đặc biệt. Tân Trào là thủ đô lâm thời của khu giải phóng, nơi Đảng Cộng sản Việt Nam tiến hành hội nghị toàn quốc ngày 13 tháng 8 năm 1945 để quyết định tổng khởi nghĩa. Đại hội quốc dân đã họp tại đây ngày 16 tháng 8 năm 1945, thông qua 10 chính sách lớn của Việt Minh, bầu ra một chính phủ lâm thời do Hồ Chí Minh làm chủ tịch và quân giải phóng Việt Nam làm lễ ra quân.",
    "events": []
  },
  {
    "name": "Thành nhà Hồ",
    "location": "Huyện Vĩnh Lộc, tỉnh Thanh Hóa 20°4′40″B 105°36′17″Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật, khảo cổ[24]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A0nh_nh%C3%A0_H%E1%BB%93",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/C%E1%BB%95ng_Nam.jpg/250px-C%E1%BB%95ng_Nam.jpg",
    "description": "Thành nhà Hồ (hay còn gọi là thành Tây Đô, thành An Tôn, thành Tây Kinh hay thành Tây Giai) là kinh đô nước Đại Ngu (quốc hiệu của Việt Nam dưới thời nhà Hồ), nằm trên địa phận tỉnh Thanh Hóa. Đây là tòa thành kiên cố với kiến trúc độc đáo bằng đá có quy mô lớn hiếm hoi ở Việt Nam, có giá trị và độc đáo nhất, duy nhất còn lại ở tại Đông Nam Á và là một trong rất ít những thành lũy bằng đá còn lại trên thế giới[1]. Thành được xây dựng trong thời gian ngắn, chỉ khoảng 3 tháng (từ tháng Giêng đến tháng 3 năm 1397) và cho đến nay, dù đã tồn tại hơn 6 thế kỷ nhưng một số đoạn của tòa thành này còn lại tương đối nguyên vẹn.",
    "events": []
  },
  {
    "name": "Tràng An - Tam Cốc - Bích Động",
    "location": "Thành phố Hoa Lư, huyện Gia Viễn, huyện Nho Quan, tỉnh Ninh Bình[25] 20,2557°B 105,9156°Đ",
    "types": "Danh lam thắng cảnh[25]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_du_l%E1%BB%8Bch_sinh_th%C3%A1i_Tr%C3%A0ng_An",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/%C4%90%C6%B0%E1%BB%9Dng_v%C3%A0o_Tam_C%E1%BB%91c_-_Ninh_B%C3%ACnh.JPG/180px-%C4%90%C6%B0%E1%BB%9Dng_v%C3%A0o_Tam_C%E1%BB%91c_-_Ninh_B%C3%ACnh.JPG",
    "description": "Khu du lịch sinh thái Tràng An là một khu du lịch sinh thái nằm trong Quần thể di sản thế giới Tràng An thuộc tỉnh Ninh Bình. Nơi đây đã được Chính phủ Việt Nam xếp hạng di tích quốc gia đặc biệt quan trọng và UNESCO công nhận là di sản thế giới kép từ năm 2014. Tràng An với hệ thống dãy núi đá vôi có tuổi địa chất khoảng 250 triệu năm, qua thời gian dài phong hóa bởi sự biến đổi của Trái Đất, khí hậu, biển tiến, biển thoái đã mang trong mình hàng trăm thung lũng, hang động, hồ đầm. Danh thắng này là nơi bảo tồn và chứa đựng nhiều hệ sinh thái rừng ngập nước, rừng trên núi đá vôi, các di chỉ khảo cổ học và di tích lịch sử văn hóa.[1] Hệ thống núi đá, sông suối, rừng và hang động ở Tràng An rất hiểm trở nên được Vua Đinh Tiên Hoàng chọn làm thành Nam bảo vệ kinh đô Hoa Lư ở thế kỷ X và sau đó Nhà Trần sử dụng làm hành cung Vũ Lâm trong kháng chiến Nguyên Mông. Hiện nay nơi đây còn nhiều di tích lịch sử thời Đinh và thời Trần.",
    "events": []
  },
  {
    "name": "Văn Miếu - Quốc Tử Giám",
    "location": "Quận Ba Đình và quận Đống Đa, thành phố Hà Nội 21°1′43″B 105°50′8″Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[26]",
    "detailLink": "https://vi.wikipedia.org/wiki/V%C4%83n_Mi%E1%BA%BFu_-_Qu%E1%BB%91c_T%E1%BB%AD_Gi%C3%A1m",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Van_Mieu_Hanoi_3504185612_088052eb96_t.jpg/250px-Van_Mieu_Hanoi_3504185612_088052eb96_t.jpg",
    "description": "Văn Miếu – Quốc Tử Giám là quần thể di tích đa dạng, phong phú hàng đầu của thành phố Hà Nội, nằm ở phía Nam kinh thành Thăng Long. Quần thể kiến trúc Văn Miếu – Quốc Tử Giám bao gồm: hồ Văn, khu Văn Miếu – Quốc Tử Giám và vườn Giám, mà kiến trúc chủ thể là Văn miếu (chữ Hán: 文廟) - nơi thờ Khổng Tử, và Quốc tử giám (chữ Hán: 國子監) - trường đại học đầu tiên của Việt Nam. Khu Văn Miếu – Quốc Tử Giám có tường gạch vồ bao quanh, phía trong chia thành 5 lớp không gian với các kiến trúc khác nhau. Mỗi lớp không gian đó được giới hạn bởi các tường gạch có 3 cửa để thông với nhau (gồm cửa chính giữa và hai cửa phụ hai bên). Từ ngoài vào trong có các cổng lần lượt là: cổng Văn Miếu, Đại Trung, Khuê Văn các, Đại Thành và cổng Thái Học.[1] Với hơn 700 năm hoạt động đã đào tạo hàng nghìn nhân tài cho đất nước. Ngày nay, Văn Miếu – Quốc Tử Giám là nơi tham quan của du khách trong và ngoài nước đồng thời cũng là nơi khen tặng cho học sinh xuất sắc và còn là nơi tổ chức hội thơ hàng năm vào ngày rằm tháng giêng. Đặc biệt, đây còn là nơi các sĩ tử ngày nay đến \"cầu may\" trước mỗi kỳ thi quan trọng.",
    "events": []
  },
  {
    "name": "Khu lưu niệm Chủ tịch Hồ Chí Minh tại Kim Liên",
    "location": "Huyện Nam Đàn, tỉnh Nghệ An[27]",
    "types": "Di tích lịch sử[27]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_l%E1%BB%8Bch_s%E1%BB%AD_Kim_Li%C3%AAn",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Kim_Lien_Monuments_Park.JPG/250px-Kim_Lien_Monuments_Park.JPG",
    "description": "Khu di tích lịch sử Kim Liên là khu di tích tưởng niệm chủ tịch Hồ Chí Minh tại xã Kim Liên, huyện Nam Đàn, tỉnh Nghệ An thuộc vùng duyên hải miền Trung Việt Nam, cách thành phố Vinh khoảng 15 km theo quốc lộ 46 . Hiện nay, nơi đây đã được thủ tướng chính phủ Việt Nam đưa vào danh sách xếp hạng 23 di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "An toàn khu (ATK) Định Hóa",
    "location": "Huyện Định Hóa, tỉnh Thái Nguyên[28] 21°53′50″B 105°38′1″Đ",
    "types": "Di tích lịch sử[28]",
    "detailLink": "https://vi.wikipedia.org/wiki/ATK",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/ATK_Dinh_Hoa.jpg/250px-ATK_Dinh_Hoa.jpg",
    "description": "ATK, viết tắt của an toàn khu, là khu vực mà Quân đội nhân dân Việt Nam giành được quyền kiểm soát gần như tuyệt đối trong thời gian chiến tranh chống Pháp, Nhật, Mỹ. ATK có 2 cấp: xã An toàn khu và vùng An toàn khu.",
    "events": []
  },
  {
    "name": "Côn Sơn - Kiếp Bạc",
    "location": "Thành phố Chí Linh, tỉnh Hải Dương",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[29]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_C%C3%B4n_S%C6%A1n_%E2%80%93_Ki%E1%BA%BFp_B%E1%BA%A1c",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Den_kiep_bac.jpg/250px-Den_kiep_bac.jpg",
    "description": "Khu di tích Côn Sơn – Kiếp Bạc là một di tích quốc gia đặc biệt quan trọng của Việt Nam. Quần thể di tích này thuộc địa bàn thành phố Chí Linh, tỉnh Hải Dương. Nơi đây gồm quần thể các di tích lịch sử liên quan đến những chiến công lẫy lừng trong ba lần quân dân nhà Trần đánh thắng quân xâm lược Mông Nguyên thế kỷ XIII và trong cuộc kháng chiến 10 năm của nghĩa quân Lam Sơn chống quân Minh ở thế kỷ XV. Đây là nơi gắn liền với thân thế, sự nghiệp của các vị anh hùng dân tộc như: Nguyễn Trãi, Trần Hưng Đạo cùng nhiều danh nhân văn hoá của dân tộc: Trần Nguyên Đán, Pháp Loa, Huyền Quang… Điểm nhấn của khu di tích này là chùa Côn Sơn và đền Kiếp Bạc.",
    "events": []
  },
  {
    "name": "Cổ Loa",
    "location": "Huyện Đông Anh, thành phố Hà Nội[30] 21,113408°B 105,873206°Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật, khảo cổ[30]",
    "detailLink": "https://vi.wikipedia.org/wiki/C%E1%BB%95_Loa",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Citadelle_de_C%E1%BB%95_Loa.jpg/250px-Citadelle_de_C%E1%BB%95_Loa.jpg",
    "description": "Thành Cổ Loa là kinh đô của nhà nước Âu Lạc dưới thời An Dương Vương vào khoảng thế kỷ thứ 3 trước Công nguyên và của nhà nước phong kiến dưới thời Ngô Quyền thế kỷ 10 tại vùng đất xã Cổ Loa, huyện Đông Anh, Hà Nội.",
    "events": []
  },
  {
    "name": "Đền Trần và Chùa Phổ Minh",
    "location": "Thành phố Nam Định, tỉnh Nam Định[31] 20,4554335°B 106,1659867°Đ, 20,4554335°B 106,1659867°Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[31]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Tr%E1%BA%A7n_(Nam_%C4%90%E1%BB%8Bnh)",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/DenTran-NamDinh.JPG/180px-DenTran-NamDinh.JPG",
    "description": "Đền Trần (陳廟 - Trần Miếu) là một quần thể đền thờ tại đường Trần Thừa, phường Lộc Vượng, thành phố Nam Định (sát quốc lộ 10), là nơi thờ các vua Trần cùng các quan lại có công phù tá nhà Trần. Đền Trần được xây dựng từ năm 1695, trên nền Thái miếu cũ của nhà Trần đã bị quân Minh phá hủy vào thế kỷ XV.",
    "events": []
  },
  {
    "name": "Bạch Đằng",
    "location": "Thị xã Quảng Yên, thành phố Uông Bí, tỉnh Quảng Ninh[32] 20,8442°B 106,6317°Đ",
    "types": "Di tích lịch sử[32]",
    "detailLink": "https://vi.wikipedia.org/wiki/B%E1%BA%A1ch_%C4%90%E1%BA%B1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/C%E1%BB%8Dc_B%E1%BA%A1ch_%C4%90%E1%BA%B1ng.jpg/180px-C%E1%BB%8Dc_B%E1%BA%A1ch_%C4%90%E1%BA%B1ng.jpg",
    "description": "Sông Bạch Đằng là ranh giới giữa thành phố Hải Phòng và tỉnh Quảng Ninh ngày nay, gọi theo phiên âm chữ Nôm là Bạch Đằng Giang (白藤江). Từ Bạch (白) có nghĩa là trắng, từ Đằng (藤) có nghĩa là \"bụi cây quấn quýt\", tên Nôm là Dầng hay Rừng. Và ba từ \"Bạch Đằng Giang\", nghĩa là sông có \"rừng sóng bạc đầu\", mà gọi theo dân gian là sông Thần. Ngoài ra sông này còn có tên gọi khác thời Hậu Lê là Vân Cừ (澐渠), nghĩa là \"con sông nhỏ có sóng lớn\" hay \"nước chảy xoáy cuồn cuộn\", về sau là sông Thành Triền và ngày nay là sông Đá Bạc...",
    "events": []
  },
  {
    "name": "Yên Tử",
    "location": "Thành phố Uông Bí, thành phố Đông Triều, tỉnh Quảng Ninh[33]",
    "types": "Di tích lịch sử, danh lam thắng cảnh[33]",
    "detailLink": "https://vi.wikipedia.org/wiki/Qu%E1%BA%A7n_th%E1%BB%83_di_t%C3%ADch_danh_th%E1%BA%AFng_Y%C3%AAn_T%E1%BB%AD",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Ch%C3%B9a_Hoa_Y%C3%AAn.jpg/250px-Ch%C3%B9a_Hoa_Y%C3%AAn.jpg",
    "description": "Quần thể di tích và danh thắng Yên Tử – Vĩnh Nghiêm – Côn Sơn, Kiếp Bạc bao gồm 32 địa điểm thuộc 5 khu di tích trên địa bàn 3 tỉnh: Bắc Giang, Hải Dương và Quảng Ninh ở Đông Bắc Việt Nam.[1]",
    "events": []
  },
  {
    "name": "Lam Kinh",
    "location": "Huyện Thọ Xuân và huyện Ngọc Lặc, tỉnh Thanh Hóa[34]",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[34]",
    "detailLink": "https://vi.wikipedia.org/wiki/Lam_Kinh",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Khuditichlamkinh.jpg/180px-Khuditichlamkinh.jpg",
    "description": "Khu di tích lịch sử Lam Kinh cách thành phố Thanh Hóa 50 km về phía Tây Bắc, nằm trên địa bàn thị trấn Lam Sơn, huyện Thọ Xuân, tỉnh Thanh Hóa. Đây là một di tích lịch sử quốc gia cấp từ năm 1962. Năm 2012, khu di tích này được công nhận là di tích quốc gia đặc biệt.[1]",
    "events": []
  },
  {
    "name": "Khu lưu niệm Nguyễn Du",
    "location": "Huyện Nghi Xuân, tỉnh Hà Tĩnh[35]",
    "types": "Di tích lịch sử[35]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-Nguyendu-35",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Chùa Keo",
    "location": "Huyện Vũ Thư, tỉnh Thái Bình[36] 20°21′38″B 106°17′50″Đ",
    "types": "Di tích kiến trúc nghệ thuật[36]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Keo",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Chuakeothaibinh.jpg/250px-Chuakeothaibinh.jpg",
    "description": "Chùa Keo là tên gọi của một số ngôi chùa cổ ở Việt Nam. Một số ngôi chùa Keo cổ được biết đến nhiều nhất là:",
    "events": []
  },
  {
    "name": "Óc Eo – Ba Thê",
    "location": "Huyện Thoại Sơn, tỉnh An Giang[37] 10°15′17″B 105°9′6″Đ",
    "types": "Di tích kiến trúc nghệ thuật, khảo cổ[37]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C3%93c_Eo",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Di_t%C3%ADch_kh%E1%BA%A3o_c%E1%BB%95_Nam_Linh_S%C6%A1n_T%E1%BB%B1.jpg/250px-Di_t%C3%ADch_kh%E1%BA%A3o_c%E1%BB%95_Nam_Linh_S%C6%A1n_T%E1%BB%B1.jpg",
    "description": "Óc Eo là một di chỉ khảo cổ tại khu vực núi Ba Thê thuộc tỉnh An Giang, Việt Nam.[1] Di chỉ này do nhà khảo cổ học người Pháp Louis Malleret ở trường Viễn Đông Bác Cổ chủ trì khai quật lần đầu tiên vào năm 1944.[2][3][4]",
    "events": []
  },
  {
    "name": "Gò Tháp",
    "location": "Huyện Tháp Mười, tỉnh Đồng Tháp[38] 10,583°B 105,8°Đ",
    "types": "Di tích kiến trúc nghệ thuật, khảo cổ[38]",
    "detailLink": "https://vi.wikipedia.org/wiki/G%C3%B2_Th%C3%A1p",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/%C4%90%E1%BB%81n_th%E1%BB%9D_V%C3%B5_Duy_D%C6%B0%C6%A1ng_v%C3%A0_%C4%90%E1%BB%91c_Binh_Ki%E1%BB%81u.jpg/180px-%C4%90%E1%BB%81n_th%E1%BB%9D_V%C3%B5_Duy_D%C6%B0%C6%A1ng_v%C3%A0_%C4%90%E1%BB%91c_Binh_Ki%E1%BB%81u.jpg",
    "description": "Khu di tích Gò Tháp là một di tích quốc gia đặc biệt, nằm trên địa bàn hai xã Mỹ Hòa và Tân Kiều, huyện Tháp Mười, tỉnh Đồng Tháp, cách Mỹ An (huyện lỵ) khoảng 11 km về hướng Bắc, cách Thành phố Cao Lãnh về hướng đông bắc 43 km (theo đường bộ và đường thủy).",
    "events": []
  },
  {
    "name": "Hồ Ba Bể",
    "location": "Huyện Ba Bể, tỉnh Bắc Kạn[39]\n22°25′B 105°37′Đ",
    "types": "Danh lam thắng cảnh[39]",
    "detailLink": "https://vi.wikipedia.org/wiki/H%E1%BB%93_Ba_B%E1%BB%83",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Ba_Be_Lake_3.jpg/250px-Ba_Be_Lake_3.jpg",
    "description": "Hồ Ba Bể là một hồ nước ngọt ở Bắc Kạn, Việt Nam. Đây là hồ nước ngọt tự nhiên lớn nhất Việt Nam và là một trong một trăm hồ nước ngọt lớn nhất thế giới[cần dẫn nguồn]. Hồ nằm trong Vườn quốc gia Ba Bể, nơi đây được công nhận là khu du lịch quốc gia Việt Nam.[1]",
    "events": []
  },
  {
    "name": "Vườn quốc gia Cát Tiên",
    "location": "Tỉnh Đồng Nai, tỉnh Bình Phước, tỉnh Lâm Đồng[40] 11°30′B 107°20′Đ",
    "types": "Danh lam thắng cảnh[40]",
    "detailLink": "https://vi.wikipedia.org/wiki/V%C6%B0%E1%BB%9Dn_qu%E1%BB%91c_gia_C%C3%A1t_Ti%C3%AAn",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Cat_Tien_National_Park%2C_Vietnam.jpg/250px-Cat_Tien_National_Park%2C_Vietnam.jpg",
    "description": "Vườn quốc gia Cát Tiên là một khu bảo tồn thiên nhiên nằm trên địa bàn 3 huyện: Vĩnh Cửu , Bình Phước cách Thành phố Hồ Chí Minh 150 km về phía bắc. Đặc trưng của vườn quốc gia này là rừng đất thấp ẩm ướt nhiệt đới. Được thành lập theo quyết định số 01/CT ngày 13 tháng 1 năm 1992 của Thủ tướng chính phủ Việt Nam trên cơ sở kết nối khu rừng cấm Nam Cát Tiên (được thành lập theo quyết định số 360/TTg, ngày 7 tháng 7 năm 1978 của Thủ tướng chính phủ) và khu bảo tồn thiên nhiên Tây Cát Tiên (được thành lập theo quyết định số 194/CT, ngày 9 tháng 8 năm 1986 của Chủ tịch Hội đồng Bộ trưởng). Vườn quốc gia Cát Tiên nằm ở khu vực có toạ độ từ 11°20′50\" tới 11°50′20\" vĩ bắc, và từ 107°09′05\" tới 107°35′20\" kinh đông, trên địa bàn của ba tỉnh Lâm Đồng, Đồng Nai và Bình Phước với tổng diện tích là 71.920 ha. Hiện nay, VQG Cát Tiên là một trong những khu dự trữ sinh quyển thế giới ở Việt Nam.",
    "events": []
  },
  {
    "name": "Đường Trường Sơn - Đường Hồ Chí Minh",
    "location": "Tỉnh Nghệ An, tỉnh Hà Tĩnh, tỉnh Quảng Bình, tỉnh Quảng Trị, tỉnh Thừa Thiên Huế, tỉnh Quảng Nam, tỉnh Kon Tum, tỉnh Gia Lai, tỉnh Đắk Lắk, tỉnh Đắk Nông, tỉnh Bình Phước[41]",
    "types": "Di tích lịch sử[41]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C6%B0%E1%BB%9Dng_Tr%C6%B0%E1%BB%9Dng_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/vi/thumb/1/1e/HCMT3.jpg/180px-HCMT3.jpg",
    "description": "Đường Trường Sơn hay đường mòn Hồ Chí Minh (tiếng Anh: Ho Chi Minh trail) là một tuyến Hậu cần chiến lược bao gồm mạng lưới giao thông quân sự, chạy từ lãnh thổ miền Bắc Việt Nam vào tới lãnh thổ miền Nam Việt Nam, phía đông Trường Sơn đi qua miền Trung Việt Nam và phía tây Trường Sơn, có đoạn đi qua hạ Lào, Campuchia. Đây là tuyến hậu cần chiến lược trọng yếu cung cấp binh lực và vật chất hậu cần, vũ khí trang bị để chi viện cho Quân Giải phóng miền Nam trên chiến trường miền Nam Việt Nam, liên tục trong suốt 16 năm (1959–1975) của thời kỳ Chiến tranh Việt Nam.",
    "events": [
      {
        "description": "Trong giai đoạn kháng chiến Chống Pháp, tiền thân của tuyến đường mòn Hồ Chí Minh sau này gồm bốn tuyến đường chính là:\n\nTuyến 1: Đường thượng (Tây Trường Sơn): Từ Chu Lễ (Hà Tĩnh) đi bộ vào ga Tân Ấp (Quảng Bình) rồi xuyên tây Quảng Bình vào Khe Sanh qua Quốc lộ 9A đến Ba Lòng là chiến khu của Quảng Trị.\n\nTuyến 2: Đường Đông Trường Sơn: cũng từ Chu Lễ nhưng có một đoạn đi xe goòng (toa xe lửa nhỏ, đặt trên ray vừa kéo vừa đẩy) vào tới Minh Cầm (nay là Minh Hóa, Quảng Bình) rồi đến vùng đông Quảng Trị, ngược lên Ba Lòng.\n\nTuyến 3: Từ chiến khu Ba Lòng vào khu 5, đi xuyên lên A Lưới, vào bến Hiên (nay là Đông Giang, Quảng Nam) rồi đi tiếp vào Bình Định.\n\nTuyến 4: Từ khu V vào Nam Bộ: Từ dốc Chanh (Phú Yên) đi đến hòn Dữ (Khánh Hòa) xuyên qua núi Ba Cụm, đến trạm Mã Đà và sau đó đến trạm Đội Lào (Tà Lu, huyện Đông Giang, tỉnh Quảng Nam)[3]",
        "title": "Tiền thân"
      },
      {
        "description": "Một số phần của Đường Trường Sơn vốn đã tồn tại từ hàng thế kỷ dưới hình thức các con đường mòn sơ khai dành cho việc giao thông buôn bán trong vùng. Khu vực mà hệ thống đi qua đã là một trong những vùng đất có địa hình hiểm trở nhất Đông Nam Á: núi cao, ít dân, rừng rậm nhiệt đới. Trong những năm đầu của Chiến tranh Đông Dương, Việt Minh đã sử dụng hệ thống đường mòn này làm đường nối liền Bắc Nam, một trong các tuyến đường đưa cán bộ di chuyển giữa hai miền để tránh sự truy quét của quân Pháp. Tháng 5 năm 1958, các lực lượng thuộc Quân đội nhân dân Việt Nam (QĐNDVN) và Pathet Lào đã chiếm giữ các nút giao thông tại Sê Pôn (Tchepone), trên đường 9 thuộc địa phận Lào.[4]\n\nSau khi chế độ Việt Nam Cộng hòa ra đời dưới sự hậu thuẫn của Mỹ, đã phủ nhận tổng tuyển cử toàn quốc theo Hiệp định Genève về Việt Nam năm 1954, đưa đến việc chia cắt Việt Nam. Để tiếp tục chi viện cho quân Giải phóng miền Nam, chính phủ Việt Nam Dân chủ Cộng hòa đã quyết định xây dựng những tuyến đường chiến lược chi viện cho miền Nam. Trên cơ sở đó đã có 2 tuyến đường được xem xét là tuyến đường bộ dọc theo dãy Trường Sơn và tuyến đường biển trên biển Đông.\n\nNăm 1959, khi xung đột quân sự lên cao giữa Mặt trận Dân tộc Giải phóng miền Nam Việt Nam và chính phủ Ngô Đình Diệm, chính phủ Hà Nội gửi Đoàn 559 (mới được thành lập vào tháng 5 năm 1959) vào Nam để xây dựng hệ thống đường Trường Sơn với lực lượng gồm một tiểu đoàn giao liên D301 với 440 người. Đoàn trưởng là Thượng tá (sau này là Thiếu tướng) Võ Bẩm (nguyên Cục phó Cục Nông binh thuộc Tổng cục Hậu cần). Đoàn có nhiệm vụ vừa vận chuyển vừa mở đường hành quân. Với phương châm \"đi không dấu, nấu không khói, nói không tiếng\" để đảm bảo bí mật tối đa, toàn bộ vũ khí và hàng mang theo đều là các loại cũ từ thời Pháp, thậm chí đoàn còn dùng ván gỗ để khi đi không để lại dấu vết trên đất rừng.\n\nTrong những năm đầu của cuộc xung đột (1960-1964), đường Trường Sơn chủ yếu được dùng để chuyển quân, do hệ thống hạ tầng đường sá trên tuyến còn hạn chế, chưa phát huy được phương tiện cơ giới, nên khi đó việc vận chuyển tiếp viện hậu cần, súng đạn vào Nam chủ yếu là thông qua tuyến đường chi viện trên biển bằng những \"con tàu không số\" đã thực sự có hiệu quả cao hơn[5][6].\n\nTuyến đường mòn phía Đông Trường sơn có địa hình hiểm trở dốc cao phức tạp, nên từ năm 1961, đoàn 559 tiến hành khảo sát và mở  tuyến giao thông của mình sang sườn Tây của dãy Trường Sơn.[7] Một năm sau, đoàn 559 được bổ sung quân số thêm 6.000 người, biên chế thành hai trung đoàn 70 và 71.[8] Con số này không bao gồm các lực lượng chiến đấu với nhiệm vụ bảo vệ tuyến đường và lực lượng dân công Việt, Lào. Sau các cố gắng của hải quân Mỹ nhằm ngăn chặn hoạt động của miền Bắc trên vùng biển ven bờ bởi Chiến dịch Market Time, hoạt động đường Hồ Chí Minh trên biển bị chững lại một thời gian, thì lúc này đường Trường Sơn đã được hoàn chỉnh hơn, đủ năng lực thực hiện cả hai nhiệm vụ: vừa chuyển quân vừa chuyển Vật chất hậu cần từ miền Bắc vào Nam, đồng thời còn tổ chức được hệ thống kho tàng dọc theo biên giới mà sau được gọi là các \"Khu căn cứ\" (Base Area), nơi này đến lượt nó lại trở thành các thánh địa cho các lực lượng Quân giải phóng miền Nam dưỡng quân và tái trang bị sau khi thực hiện các hoạt động quân sự bên trong lãnh thổ do đối phương kiểm soát.\n\nCó 5 khu căn cứ lớn trong vùng cán xoong của Lào (xem bản đồ). Căn cứ 604 là trung tâm hậu cần chính; từ đó, quân và quân nhu được điều phối vào Vùng 1 chiến thuật của Việt Nam Cộng hòa và các căn cứ khác xa hơn ở phía Nam. Căn cứ 611 hỗ trợ vận tải từ căn cứ 604 tới căn cứ 609; cung cấp xăng dầu và đạn dược cho căn cứ 607 và tới tận thung lũng A Sầu ở Thừa Thiên. Căn cứ 612 được dành để hỗ trợ Mặt trận B3 tại Tây Nguyên. Căn cứ 614 nằm giữa Chavane (Lào) và Khâm Đức (Nam Việt Nam) vận chuyển quân và hàng hóa vào Vùng 2 chiến thuật và Mặt trận B3. Căn cứ 609 giữ vai trò quan trọng, do mạng lưới đường ở đây có thể dùng để vận chuyển vật chất hậu cần trong mùa mưa.[9] Ban đầu, hàng hóa được vận chuyển bằng xe đạp thồ, xe bò. Đến tháng 12 năm 1961, Đoàn vận tải số 3 của Tổng cục Hậu cần đã trở thành đơn vị vận tải sử dụng xe cơ giới đầu tiên của QĐNDVN phục vụ trên đường Trường Sơn. Từ đây, vận tải cơ giới tăng lên nhanh chóng.[10]\n\nCó hai loại đơn vị thuộc Đoàn 559 là: các binh trạm và các đơn vị giao liên. Một binh trạm tương đương với một trung tâm hậu cần cấp trung đoàn, có trách nhiệm bảo vệ một đoạn đường. Trong khi các đơn vị độc lập chịu trách nhiệm đảm bảo an ninh, công binh và các chức năng đánh tín hiệu thông tin, binh trạm cung cấp các nhu yếu phẩm, dịch vụ hậu cần. Giữa các binh trạm là các trạm giao liên thường đóng cách nhau một ngày đường đi bộ, có trách nhiệm cung cấp lương thực, chỗ trú, y tế, và dẫn đường tới binh trạm tiếp theo.\n\nĐến tháng 4 năm 1965, chỉ huy Đoàn 559 là Tướng Phan Trọng Tuệ, quân số đã tăng lên tới 24.000 người, được biên chế trong 6 tiểu đoàn vận tải bằng xe ô tô tải, 2 tiểu đoàn vận tải xe đạp thồ, một tiểu đoàn vận tải đường thủy, 8 tiểu đoàn công binh, và 45 trạm giao liên. Khẩu hiệu của Đoàn 559 khi đó là \"Đánh địch mà tiến, mở đường mà đi'[11]\n\nTừ năm 1961 - 1964, đoàn 559 đã xây dựng 751 km đường vận tải ô tô, 600 km đường gùi thồ, 300 km đường sông; vận chuyển 10.136 tấn hàng (trong đó giao cho chiến trường 2.912 tấn, chủ yếu là vũ khí đạn dược). Từ tháng 9/1962 - 2/1965, Đoàn 759 chuyển vào chiến trường 4.919 tấn vũ khí đạn dược. Trong đó, giao cho Hậu cần Miền (ở bến Lộc An, Bà Rịa) 170 tấn, kịp thời bổ sung cho trận Bình Giã. Từ 1962 - 1965, Đoàn K10 tiếp nhận hàng hóa từ Thạnh Phú, Bến Tre đưa lên, vận chuyển bảo đảm cho chiến dịch Bình Giã 1.000 tấn; cấp cho T4 chuyển vào nội thành Sài Gòn 200 tấn; dự trữ tại Rừng Sác 100 tấn. Từ 1961-1965, B2 được Miền Bắc chi viện 4.092 tấn vật chất, chủ yếu vũ khí đạn và trang bị kỹ thuật (chiếm 13,3% tổng số vật chất có tại B2) và 449 triệu đồng (tiền miền nam), 33 triệu Riel (tiền Campuchia)[12]\n\nCho đến mùa khô 1964-1965, hệ thống đường Tây Trường Sơn được phát triển thành một mạng lưới của các con đường đất (một số đoạn được rải đá hoặc lót ván gỗ) rộng khoảng 5,5 m, đường cho người đi bộ và xe đạp thồ, bãi đỗ xe tải. Còn có kho chứa, bãi chứa hàng, doanh trại, bệnh viện, và các cơ sở vật chất khác. Tất cả được che giấu khỏi quan sát từ trên không bằng một hệ thống ngụy trang tự nhiên và nhân tạo được mở rộng và củng cố, góp phần tăng năng lực thông xe đáng kể cho toàn tuyến.\n\nThời tiết ở vùng Đông Nam Lào đóng vai trò quan trọng cả trong nỗ lực hậu cần và cả trong cố gắng của quân đội Mỹ và Việt Nam Cộng hòa nhằm phá đường. Mùa mưa kéo dài từ tháng 5 đến tháng 9, trong thời gian này, trời luôn nhiều mây, mưa nhiều, nhiệt độ cao. Mùa khô kéo dài từ tháng 10 đến tháng 3, khí hậu tương đối khô hơn và nhiệt độ thấp hơn. Do mạng lưới đường chủ yếu là đường đất, khối lượng vận chuyển chủ yếu (và các hoạt động quân sự mà nó hỗ trợ) được thực hiện vào mùa khô. Về sau, hệ thống đường được bổ sung bởi vận tải đường sông, kiểu vận tải này cho phép chuyển các khối lượng lớn quân nhu ngay cả trong mùa mưa.",
        "title": "Hình thành (1959–1965)"
      },
      {
        "description": "Đầu năm 1965, Thiếu tướng Phan Trọng Tuệ được cử làm Tư lệnh kiêm Chính ủy Đoàn 559. Cuối năm 1965, Đại tá Hoàng Văn Thái (nguyên Phó chủ nhiệm Tổng cục Hậu cần) được cử làm Tư lệnh và Đại tá Trần Ngọc Giao (Cục trưởng Cục Vận tải, Tổng cục Hậu cần) được cử kiêm nhiệm Phó Tư lệnh. Đại tá Vũ Xuân Chiêm (nguyên Phó chủ nhiệm Tổng cục Hậu cần) được cử làm Chính ủy Đoàn 559. Đến cuối năm 1966, Đại tá Đồng Sĩ Nguyên (nguyên Phó Chủ nhiệm Tổng cục Hậu cần) được cử làm Tư lệnh Đoàn 559 cho đến khi Đoàn 559 kết thúc nhiệm vụ lịch sử của mình (1976).\n\nTheo ước lượng của tình báo Mỹ, số quân vào Nam theo đường Trường Sơn là trong năm 1961 là 5.843, năm 1962 là 12.675 (con số thực là 5.300); năm 1963 là 7.693 (thực là 4.700); và năm 1964 là 12.424 (thực là 9.000).[13] Năm 1964, khả năng cung ứng của đường Trường Sơn đã đạt đến từ 20 đến 30 tấn mỗi ngày.[8] Năm 1965, nhờ có các tuyến đường mới mở (trong đó có các tuyến đi qua Campuchia), lượng vật chất hậu cần được chuyển vào Nam trong năm này gần bằng tổng của 5 năm trước.\n\nĐến năm 1965, việc đánh phá ngăn chặn tuyến đường Trường Sơn đã trở thành một trong những ưu tiên hàng đầu của Mỹ, nhưng các chiến dịch chống phá gặp khó khăn do thiếu lực lượng và bởi tính \"trung lập\" của Lào. Các vấn đề phức tạp của chính trị Lào cùng với sự can thiệp của Mỹ và Việt Nam Dân chủ Cộng hòa đã dẫn tới một chính sách chung là hai bên cùng lờ nhau,[14] và tiếp tục vi phạm tính trung lập của Lào: Việt Nam Dân chủ Cộng hòa củng cố và mở rộng hệ thống hậu cần trên đất Lào và hỗ trợ lực lượng đồng minh Pathet Lào; còn Mỹ thì không ngừng ném bom đường Trường Sơn đồng thời bí mật xây dựng một lực lượng vũ trang chống lại hoạt động của Việt Nam Dân chủ Cộng hoà.[15] Tuy nhiên quân đội Mỹ được lệnh không ra khỏi biên giới Việt Nam Cộng hòa vì Tổng thống Mỹ không muốn mở rộng chiến tranh.[16]\n\nNgày 14 tháng 12 năm 1964, Không lực Mỹ thực hiện Chiến dịch Barrel Roll lần đầu ném bom một cách có hệ thống phần đường trên đất Lào.[17] Ngày 20 tháng 3 năm 1965, sau khi Chiến dịch Sấm Rền đánh phá miền Bắc và Bắc Trung Bộ mở màn, Tổng thống Mỹ Lyndon B. Johnson đã chấp thuận một cuộc leo thang quân sự nhằm phá đường Trường Sơn.[18] Chiến dịch Barrel Roll tiếp diễn ở vùng Đông Bắc Lào, trong khi vùng cán xoong phía nam bị ném bom bởi Chiến dịch Steel Tiger. Đến giữa năm, số phi vụ đã tăng từ 20 lên 1.000 lượt mỗi tháng. Trong tháng 1 năm 1965, chỉ huy Mỹ tại Sài Gòn yêu cầu kiểm soát các chiến dịch ném bom tại các vùng Lào giáp ranh với 5 tỉnh phía Bắc Việt Nam Cộng hòa. Đến đây, vùng này thuộc về địa bàn của Chiến dịch Tiger Hound.[19]\n\nMùa mưa hàng năm làm ảnh hưởng tới các hoạt động vận tải của đường Trường Sơn và cũng gây khó khăn cho các chiến dịch ném bom. Ngoài ra, sương mù buổi sớm và khói do tập tục đốt rẫy của dân cư thiểu số cũng cản trở việc ném bom. Trong năm 1968, Không quân Mỹ thực hiện hai thí nghiệm với hy vọng làm trầm trọng hơn nữa kiểu thời tiết xấu của mùa mưa. Dự án Popeye là một cố gắng nhằm kéo dài vô hạn mùa mưa trên đường Trường Sơn bằng cách tạo mây. Dự án bắt đầu thử nghiệm vào tháng 9 trên vùng lưu vực sông Se Kong - con sông chảy qua địa bàn của các chiến dịch Steel Tiger và Tiger Hound. Mây được tạo trong không trung bằng các đám khói Bạc iodide và sau đó được kích hoạt bằng một mồi nổ bắn ra từ súng bắn pháo sáng. Dự án thử nghiệm thành công và chương trình đã được thực hiện cho đến tháng 7 năm 1972.[20]\n\nDự án Commando Lava được bắt đầu thử nghiệm vào tháng 5. Các nhà khoa học ở công ty Dow Chemical đã chế tạo một dung dịch hóa học mà khi trộn với nước mưa sẽ phá hủy tính ổn định của các thành phần của đất và tạo ra bùn. Những thành viên quân sự và dân sự của chương trình này đã rất hứng thú, họ cho rằng họ đang \"tạo bùn chứ không gây chiến.\"[21] Tuy nhiên, thử nghiệm không cho kết quả tốt, chất này chỉ có tác dụng ở một số vùng, tùy theo thành phần của đất.\n\nTrên mặt đất, ban đầu, CIA và Quân đội Hoàng gia Lào có trách nhiệm ngăn chặn, làm chậm, hoặc ít nhất là theo dõi hoạt động của Quân đội nhân dân Việt Nam. Về sau, nhiệm vụ này do các đội thám báo Lào do CIA xây dựng thực hiện. Đến tháng 10 năm 1965, Tướng William Westmoreland, chỉ huy quân đội Mỹ ở Nam Việt Nam, nhận được thẩm quyền tung lực lượng biệt kích Mỹ vượt qua biên giới. Ngày 18 tháng 11, lực lượng bí mật SOG (Military Assistance Command, Vietnam Studies and Observations Group) thực hiện đặc vụ \"vượt hàng rào\" đầu tiên vào đất Lào.[22] Đây là khởi đầu của một nỗ lực thám báo không ngừng mở rộng của SOG cho đến khi tổ chức này được giải thể vào năm 1972. Ngày 10 tháng 12, một vũ khí khác của Mỹ đã được đưa vào sử dụng, đó là trận ném bom đầu tiên của pháo đài bay B-52 xuống đường Trường Sơn.[23]\n\nTuy nhiên, các cố gắng trên không chặn hoặc giảm được nhịp độ vận chuyển vào Nam. Mặc dù vậy, các nhà sử học Mỹ vẫn đánh giá các chiến dịch đánh phá này không vô ích, do 10 ngàn quân của Việt Nam Dân chủ Cộng hòa đã bị giữ lại để bảo vệ và duy trì đường Trường Sơn thay vì vào Nam chiến đấu.[24][25]\n\nNăm 1966, Mỹ ước tính tổng số quân vào Nam qua đường Trường Sơn là từ 58.000 đến 90.000 người, trong đó có ít nhất 5 trung đoàn hoàn chỉnh.[26] Mùa khô năm 1966-1967 đánh dấu bước chuyển lớn về chiến thuật vận tải của đoàn 559 từ \"phòng tránh tích cực\" sang \"tiến công\" hợp đồng binh chủng. Các sở chỉ huy được chuyển ra gần đường, các lực lượng phòng không, công binh đóng sát đường để hỗ trợ kịp thời và hiệu quả hơn cho lực lượng vận tải chủ công. Nhiều tuyến đường phụ, đường vòng được mở thêm để đảm bảo thông đường cho xe chạy. Đến cuối năm 1967, mạng lưới đường đã lên 2.959 km đường ô tô, trong đó có 275 km đường chính, 576 km đường vòng, và 450 đường vào cùng các kho chứa.[27]\n\nBộ đội Trường Sơn còn sử dụng sông Se Kong và sông Se Bangfai để chở lương thực, nhiên liệu, và đạn dược bằng cách cho hàng vào các thùng thép và thả trôi sông, các thùng này được thu lại ở đầu kia bởi các hệ thống lưới và rào gỗ. Người Mỹ đã không biết rằng trong năm 1967, để chuẩn bị cho cuộc tổng tấn công Mậu Thân 1968, hơn 81.000 tấn hàng đã được vận chuyển và cất giữ [28], 200.000 quân, trong đó có 7 trung đoàn bộ binh và 20 tiểu đoàn độc lập đã vào Nam.[29]\n\nVật chất hậu cần được vận chuyển theo đoàn được hộ tống từ miền Bắc theo từng chặng, xe tải chỉ chạy đi về giữa hai trạm, dỡ hàng và lấy hàng mới tại mỗi trạm. Nếu một xe tải bị hỏng hoặc bị bom phá, nó sẽ được thay bằng một xe của trạm gần nhất phía Bắc, và cứ như vậy cho đến khi một xe tải mới được đưa vào tại trạm cuối ở miền Bắc. Cuối cùng, khi hàng tới trạm giao liên cuối cùng ở phía Nam, hàng được bốc dỡ, cất vào kho, đưa lên các phương tiện vận tải thủy, hoặc do người vác vào miền Nam Việt Nam.\n\nĐể tránh bom, các đơn vị vận tải thường chỉ chạy khi trời tối, cao điểm là lúc gần sáng. Khi máy bay Mỹ tới, giao thông sẽ dừng lại cho đến khi trời gần sáng, khi các máy bay ném bom và bắn phá ban đêm trở về căn cứ. Rồi xe lại chạy, cao điểm tiếp theo là khoảng 6 giờ sáng khi các lái xe cố gắng đưa xe về điểm tập kết trước khi mặt trời mọc và các đợt máy bay buổi sáng bắt đầu.[30]\n\nTừ năm 1965-1968, Đoàn 559 đã vận chuyển chi viện cho chiến trường 121.139 tấn vật chất, trong đó chi viện cho miền Nam 27.548 tấn, chiến trường Nam Lào 12.935 tấn và bảo đảm cho các lực lượng hành quân trên các tuyến 15.862 tấn; đưa 594.858 lượt người hành quân vào chiến trường, trong đó có 45 đơn vị kỹ thuật với 566 xe cơ giới, 380 khẩu pháo, vận chuyển 35.421 lượt thương bệnh binh[31]",
        "title": "Ngăn chặn và mở rộng (1965-1968)"
      },
      {
        "description": "Năm 1970, Bộ tư lệnh 559 được nâng lên cấp quân đoàn. Chỉ huy thời kỳ này là Đại tá Đồng Sĩ Nguyên - Tư lệnh và Đại tá Vũ Xuân Chiêm – Chính ủy. Năm 1971, Đại tá Đặng Tính được cử làm Chính ủy (Chính ủy Đặng Tính gặp tai nạn và mất trên đường đi công tác năm 1973). Binh đoàn được tổ chức lại thành 5 bộ tư lệnh khu vực ngang cấp sư đoàn là: 470, 471, 472, 473, và 571. Lực lượng binh đoàn bao gồm 4 trung đoàn vận tải, 2 trung đoàn đường ống dẫn dầu, 3 trung đoàn pháo phòng không, 8 trung đoàn công binh, và Sư đoàn 968 Bộ binh. Đến cuối năm, đoàn 559 đã có 27 binh trạm, vận chuyển 40.000 tấn hàng với tỉ lệ mất mát của năm đó là 3.4%.[32].\n\nTừ năm 1960 đến 1970, gần 80% lượng hàng được chuyển bằng đường biển từ Bắc vào Nam qua Đường mòn Hồ Chí Minh trên biển chuyển hàng trực tiếp tới các cảng biển Trung bộ, Nam bộ Việt Nam (đến năm 1965) và quá cảnh qua cảng Sihanoukville ở Campuchia, rồi từ đó đưa vào miền Nam Việt Nam.\n\nTừ sau vụ đảo chính năm 1970 của tướng Lon Nol tại Campuchia, và việc đóng cảng Sihanoukville đối với tàu chi viện của miền Bắc - Đường Trường Sơn phải làm thêm nhiệm vụ của đường Hồ Chí Minh trên biển.\n\nDo dự báo trước khả năng mất đường hậu cần phía Nam nên từ năm 1969, Quân đội nhân dân Việt Nam đã bắt đầu nỗ lực mở rộng hành lang tuyến hậu cần lớn nhất trong cả cuộc chiến.[33] Năm 1970, ta chiếm các thị xã Lào Attopeu và Saravane ở chân cao nguyên Boloven, kéo dài hệ thống vận tải trên sông Se Kong vào Campuchia. Quân đội nhân dân Việt Nam còn thành lập Đoàn Vận tải 470 để quản lý dòng người và hàng đi tới các chiến trường mới trong lãnh thổ Campuchia.[34] \"Con đường Giải Phóng\" mới này rẽ sang Tây từ đường Trường Sơn tại Mường May ở Nam Lào, đi song song với Se Kong để vào Campuchia.\n\nCuối cùng, tuyến đường mới này kéo dài qua Siem Prang tới sông Mekong đoạn ở gần Stung Treng, Campuchia.[35] Trong năm 1971 Quân đội nhân dân Việt Nam chiếm Paksong và tiến tới Pakse tại trung tâm cao nguyên Boloven. Năm sau, Quân đội nhân dân Việt Nam chiếm được Khong Sedone. Họ còn tiếp tục một chiến dịch được bắt đầu từ năm 1968 để dọn sườn phía đông của đường Trường Sơn. Trong năm đó, các cứ điểm của các Lực lượng Đặc biệt của Mỹ tại Khe Sanh và Khâm Đức (cả hai đều do SOG sử dụng làm các căn cứ tiền phương cho các hoạt động biệt kích chống phá đường Trường Sơn) đều bị bỏ hoặc đánh bại.[36] Năm 1970, số phận tương tự đã xảy đến cho một căn cứ khác tại Dak Seang. Hành lang tuyến vận chuyển từng rộng chỉ 20 dặm nay đã trải rộng 90 dặm từ Đông sang Tây. Năm 1971, \"đường kín\" dưới tán rừng bắt đầu được xây đựng. Đến năm 1973, xe tải có thể chạy suốt dọc đường mà không ra khỏi mái ngụy trang, ngoại trừ khi đi qua suối cạn hay vượt suối qua các ngầm (loại đường được xây hoặc kè bằng đá ngay dưới mặt nước).[37]\n\nTừ năm 1969-1972, tuyến Đường 559 đã vận chuyển chi viện cho các chiến trường 277.611 tấn hàng (miền Nam 162.710 tấn, chiến trường Lào 114.901 tấn), bảo đảm cho 692.690 lượt người hành quân vào miền Nam và 256.871 người hành quân ra miền Bắc; thời gian hành quân vào B2 rút ngắn được 10-15 ngày, góp phần quan trọng để bảo đảm cho các chiến dịch lớn[31]\n\nĐến năm 1968, hệ thống đường giao thông, tuyến hậu cần từ miền Bắc đã mở rộng và hiện đại hóa. Ngoài ra, khoảng 43.000 người Việt và Lào đã tham gia điều khiển, nâng cấp, hoặc mở rộng hệ thống đường.[38] Lượng bom ném xuống Trường Sơn đạt đỉnh năm 1969, với khoảng 433.000 tấn ném xuống Lào.[39] Đây là thời điểm kết thúc của chiến dịch Rolling Thunder và mở đầu của chiến dịch Commando Hunt (tháng 11 năm 1968).\n\nViệc nỗ lực ném bom liên tục này được chỉ dẫn bởi chiến dịch Igloo White hoạt động tại Nakhon Phanom, Thái Lan. Chiến dịch này gồm ba phần: các thiết bị cảm ứng địa chấn và âm thanh thu thập thông tin tình báo trên đường Trường Sơn (hàng rào điện tử MacNamara), các máy tính tại Trung tâm Giám sát Thâm nhập (Infiltration Surveillance Center – ICS) đặt tại Thái Lan thu thập thông tin và ước tính các đường vận tải và tốc độ xe; các kíp máy bay được ISC chỉ dẫn để đánh phá các mục tiêu.[40] Nỗ lực này còn được hỗ trợ bởi các nhóm biệt kích SOG. Ngoài các nhiệm vụ do thám, đặt máy nghe trộm, và đánh giá thiệt hại do bom, các nhóm này còn tự tay lắp đặt các thiết bị cảm ứng cho chiến dịch Igloo White.\n\nĐến giai đoạn cuối của chiến dịch Commando Hunt (tháng 10 năm 1970 – tháng 4 năm 1972) số phi vụ máy bay bắn phá mỗi ngày là 182 máy bay tiêm kích, 13 máy bay chiến đấu (fixed wing gunship) và 21 B-52.[41]\n\nKhông quân Mỹ tuyên bố chỉ riêng trong 7 chiến dịch Commando Hunt từ tháng 11/1968 đến tháng 3/1972, 46.000 xe tải đã bị phá hủy hay đánh hỏng trên đường Trường Sơn, và tỉ lệ đến đích của xe tải chỉ là 16%. Tuy nhiên, đến những năm 1990, các sử gia Mỹ đã bác bỏ số liệu này khi biết rằng trong giai đoạn đó, phía Việt Nam chỉ nhập về trung bình khoảng 6.000 xe tải/ năm. Sử gia Earl Tilford kể lại đã từng có báo cáo về \"300 xe tải bị phá hủy hay đánh hỏng chỉ trong 1 đêm\", khiến tướng Mỹ rất hài lòng, nhưng đêm sau thì đường lại tấp nập như cũ. Theo ông: \"Không quân Mỹ đã thành công trong việc đánh lừa chính mình rằng chiến dịch Commando Hunt có tác dụng.\" Chuyên gia không quân John Corell thì cho rằng các phi công Mỹ đã báo cáo phóng đại thành tích ít nhất là 4 lần.\n\nQuân đội nhân dân Việt Nam đáp trả máy bay Mỹ bằng lực lượng pháo phòng không ngày càng mạnh. Năm 1968, lực lượng này chỉ gồm các pháo phòng không cỡ 37-mm và 57-mm điều khiển thủ công. Năm sau đã xuất hiện súng pháo 85-mm và 100-mm do radar điều khiển. Đến năm 1972, Mỹ ước tính đường Trường Sơn đã được bảo vệ bởi hơn 1.500 khẩu pháo phòng không.[42]\n\nNgày 20/7/1971, Sư đoàn Phòng không 377 được Bộ Quốc phòng điều động trực thuộc Bộ tư lệnh Trường Sơn. Bộ cũng bổ sung cho Bộ tư lệnh Trường Sơn thêm 728 khẩu pháo phòng không các loại, 20.000 bộ đội và 15.000 thanh niên xung phong. Chưa bao giờ lực lượng phòng không của Trường Sơn lại hùng hậu như thời kỳ này: Sư đoàn 377 (có 6 trung đoàn) và 12 Trung đoàn cao xạ và tên lửa độc lập. Đó là chưa kể 28 tiểu đoàn pháo cao xạ của 25 Binh trạm Trường Sơn.\n\nTrong các loại vũ khí bắn phá Trường Sơn, máy bay chiến đấu AC-130 Spectre với kính ngắm hồng ngoại và súng 40 mm được phía Việt Nam Dân chủ Cộng hòa đánh giá là hiệu quả nhất, kiểm soát và hạn chế phần nào hoạt động vận tải về đêm,[32] phá hủy 2.432 xe tải trong tổng số 4.000 xe bị bom phá trong mùa khô 1970-71.[43]\n\nĐể đối phó với máy bay AC-130, tháng 2 năm 1972, một tuyến \"đường kín\" dài 800 km hoàn thành và bắt đầu đưa vào sử dụng. Trên tuyến này, xe chạy dưới tán rừng già, chạy hoàn toàn vào ban ngày để tránh bị máy bay phát hiện. Xe chạy theo đội hình trung đoàn liền trên toàn tuyến chứ không chạy theo chặng nên thời gian giảm được từ 10 đến 15 ngày. Ban đêm, các đội xe vẫn tiếp tục chở hàng trên \"đường hở\", kết hợp với việc nghi binh bởi các xe hỏng chạy thật để bẫy AC-130 cho lực lượng phòng không tấn công.\n\nNgày 29 tháng 3 năm 1972, máy bay AC-130 đã bị bắn rơi trong một phi vụ ban đêm bởi tên lửa đất đối không SAM-2 ở gần Sê Pôn.[44], 14 phi công Mỹ thiệt mạng. Hai ngày sau, một chiếc AC-130 lại bị quật ngã bởi pháo phòng không 57mm và rơi xuống rừng Trường Sơn, 15 thành viên phi hành đoàn nhảy dù và được giải cứu sau đó. Không quân Mỹ bị mất liên tiếp hai chiếc máy bay đắt đỏ và 14 phi công chỉ trong 2 ngày. Ngày 18/6/1972, bộ đội Việt Nam sử dụng tên lửa vác vai Strela 2 bắn rơi một chiếc AC-130. Sau các vụ này, AC-130 phải lui về hoạt động ở phía Nam đường 9. Tuyến \"đường kín\" này đã đem lại hai kết quả quan trọng:\n\nSau 2 năm, chiến dịch Igloo White nói riêng và \"Chương trình ngăn chặn mới\" nói chung đã không thể thu được kết quả như mong muốn. Đến năm 1970, các thông tin của cơ quan tình báo chiến trường Mỹ đã khiến người ta phải sửng sốt. Theo đó, từ năm 1969 cho đến năm 1970, mức thâm nhập qua Trường Sơn lên tới 348 đoàn, trong đó có 46 tiểu đoàn trang bị mạnh, 24.530 tấn vũ khí, có 335 chuyến bay các loại bí mật thả vũ khí xuống các hành lang ở Lào. John McConnell, Tham mưu trưởng Không quân Mỹ thừa nhận:[45]\n\nSau khi Hàng rào McNamara bị chọc thủng, đến lượt kế hoạch Igloo White bị phá sản. Từ sau năm 1970, kỹ thuật quân sự Mỹ bế tắc, không tìm ra lời giải mới nào khả quan trong việc cắt đứt đường Hồ Chí Minh.[46] Tuy nhiên, kế hoạch này vẫn tiếp tục được kéo dài cho đến năm 1973, khi Hiệp định Paris được ký kết.\n\nĐầu tháng 2 năm 1971, 30.000 quân Việt Nam Cộng hòa, 4.000 quân Hoàng gia Lào, được sự yểm trợ của 10.000 lính Mỹ và không quân Mỹ, đã vượt biên giới Lào, tiến theo Đường 9 về phía trung tâm hậu cần của Quân đội nhân dân Việt Nam tại Sê Pôn (Tchepone). Chiến dịch Lam Sơn 719, cuộc tấn công được dự tính đã lâu vào hệ thống đường Trường Sơn và cuộc thử nghiệm của chính sách Việt Nam hóa chiến tranh của Mỹ, đã bắt đầu. Quân đội Mỹ (ngoại trừ các đơn vị không quân, pháo binh, trực thăng) theo mệnh lệnh sẽ không tham gia trực tiếp cuộc xâm lược.[47] Đầu tiên, chiến dịch tiến triển tốt, chỉ gặp phải ít kháng cự. Tuy nhiên, Quân đội nhân dân Việt Nam đã chuẩn bị cho trận chiến này từ lâu, họ nhanh chóng điều đến một lực lượng cuối cùng lên đến 60.000 quân, đợi khi thời cơ đến thì phản công cô lập và tiêu diệt từng cánh quân của QLVNCH.[48]\n\nChiến trận nổ ra tại Nam Lào không giống với bất cứ trận chiến nào trước đó trong Chiến tranh Việt Nam, lần đầu tiên Quân đội nhân dân Việt Nam có sự hiệp đồng binh chủng: bộ binh tấn công với sự hỗ trợ của xe tăng và pháo hạng nặng đè bẹp các vị trí của Quân lực Việt Nam Cộng hòa tại các cánh và đội hình chính. Hỏa lực phòng không phối hợp đã làm cho sự hỗ trợ và vận tải bằng không quân trở nên khó khăn và thiệt hại lớn, 168 trực thăng bị bắn rơi và 618 chiếc khác bị bắn hỏng.[49] Tuy đổ được quân vào một vài điểm cao phía Đông Sê Pôn và đưa được quân trinh sát vào trong thị trấn, nhưng đó là một chiến tích không mấy giá trị, vì Quân lực Việt Nam Cộng hòa sau đó đã phải nhanh chóng rút lui. Quân đội nhân dân Việt Nam khép chặt gọng kìm và chặn đánh trên suốt quá trình rút lui. Tuy được hỗ trợ bởi hỏa lực mạnh của Mỹ, nhưng Quân lực Việt Nam Cộng hòa vẫn chịu thiệt hại nặng nề. Đến ngày 25 tháng 3, chiến sự kết thúc, các đơn vị cuối cùng của Việt Nam Cộng hòa rút chạy trở về với đối phương đuổi sát phía sau.\n\nTrong suốt thời gian diễn ra Chiến dịch, Đoàn 559 đã thực hiện cơ động lực lượng, gồm bộ binh: 27.935 người; 2 tiểu đoàn xe tăng, 1 trung đoàn công binh, 2 trung đoàn pháo binh, cùng 8.271 tấn vật chất (đạn: 3.329 tấn; lương thực, thực phẩm: 4.196 tấn; xăng dầu: 600 tấn; hàng quân y: 56,6 tấn; hàng khác: 81,4 tấn). Lực lượng vận tải đã cung cấp khối lượng lớn vũ khí, trang bị, gồm: Súng bộ binh 23.312 khẩu; súng cối, pháo, ĐKZ: 770 khẩu; pháo cao xạ và súng máy phòng không: 670 khẩu; xe ô tô (không kể của các binh trạm chiến lược): 603 chiếc; xe xích: 98 chiếc; xe tăng: 88 chiếc. Lực lượng bảo đảm kỹ thuật gồm, trạm sửa chữa xe đơn vị: 11 trạm; trạm sửa chữa vũ khí đơn vị: 26 trạm. Đây là lần đầu tiên hậu cần chiến lược sử dụng phương tiện cơ giới để cơ động lực lượng dự bị chiến lược quy mô lớn vào vị trí tập kết chiến dịch. Tính đến ngày 31/3, số thương binh được chuyển bằng phương tiện cơ giới về hậu phương chiếm 37% tổng số thương binh[50]\n\nPhối hợp chặt chẽ với Đoàn 559, Hậu cần Binh đoàn 70 đảm nhiệm vận chuyển trên hướng chủ yếu của Chiến dịch (hướng Bắc). Binh đoàn 70 gồm 1 đại đội xe ô tô (32 xe) đảm nhiệm vận chuyển đột xuất, vận chuyển nhỏ trên các cung đường không thuộc tuyến chiến lược, cũng đã vận chuyển được 425 tấn hàng các loại. Ngoài ra, còn có 2 sư đoàn vận tải bộ làm nhiệm vụ vận tải từ kho chiến dịch và sư đoàn đến các đại đội, 1.500 dân công làm nhiệm vụ chuyển thương và phục vụ trên các tuyến điều trị. Mặt trận B5 ở hướng Đông, gồm 1 trung đội xe ô tô (18 xe), 5 đại đội vận tải bộ và 2.000 dân công, trong chiến dịch cũng chuyển được hơn 1.000 tấn. Trong tháng 2 và 3/1971, hậu cần chiến dịch đã cung cấp khối lượng lớn vật chất bằng cả 6 tháng cho Chiến dịch Đường 9 - Khe Sanh (năm 1968)[50]\n\nChiến dịch này được coi là một thất bại đẫm máu của liên quân Mỹ-Việt Nam Cộng hòa, cả với vai trò thử nghiệm của Việt Nam hóa chiến tranh (bên tấn công chịu thương vong hơn một nửa quân số) và với vai trò phá hệ thống hậu cần của Quân đội nhân dân Việt Nam (trong gần hai tháng diễn ra chiến dịch và tham gia chiến dịch, chẳng những xe vận tải không bị tắc, mà khối lượng hàng chuyển giao các chiến trường tăng gấp hai lần, thời gian đưa hàng đến đích cũng nhanh hơn, chỉ bằng nửa thời gian trước đó[51]).",
        "title": "Thời kỳ 1968–1972"
      },
      {
        "description": "Cuối năm 1968, tình báo Mỹ đã có một phát hiện gây sốc, đó là phát hiện về hệ thống đường ống dẫn xăng dầu chạy ở phía tây nam từ Vinh.[52]\n\nThực sự đó là một tuyến đường ống dẫn xăng dầu đang được triển khai với điểm đầu là từ biên giới Việt - Trung chạy về hướng nam, sẽ vào đến miền Đông Nam Bộ. Nó được xây dựng bắt nguồn từ ý chí và quyết tâm cao độ của tướng Đinh Đức Thiện,[53] Chủ nhiệm Tổng cục Hậu cần và trí thông minh, lòng dũng cảm và sự hy sinh lớn lao của cán bộ chiến sĩ ngành xăng dầu Quân đội nhân dân Việt Nam và đặc biệt là của bộ đội xăng dầu Trường Sơn.\n\nTuyến đường ống xăng dầu chiến lược Bắc - Nam nhằm chi viện cho chiến trường miền Nam: được xuất phát bắt đầu từ hai trạm thuộc biên giới Việt - Trung là Lạng Sơn và Quảng Ninh, hai tuyến đường ống cùng dẫn về trạm Nhân Vực, thuộc huyện Thường Tín, Hà Nội. Từ đây, được hợp lại thành một đường ống chạy thẳng vào miền Trung qua Hà Nam, Ninh Bình, Thanh Hóa, Nghệ An, Hà Tĩnh.\n\nĐến đây tuyến ống được chia làm hai ngả (do bộ đội Trường Sơn đảm nhiệm xây dựng, bảo vệ và vận hành): một ngả theo đường Đông Trường Sơn đi qua Quảng Trị, Thừa Thiên, Quảng Nam, Quảng Ngãi, qua Tây Nguyên, vượt Kon Tum, xuống Đắc Nông. Ngả thứ hai lại vượt đèo Mụ Giạ, sang Lào vươn tới hạ Lào, rồi vượt qua biên giới Lào và Campuchia để vào tới Đắc Nông. Trên toàn bộ hệ thống (tuyến ống hai nhánh qua Đông và Tây Trường Sơn) có với chiều dài 1.450 km với tổng cộng 316 trạm bơm đẩy, 101 kho với sức chứa trên 300 nghìn m3. Bộ đội xăng dầu đã tập trung một lực lượng gồm: 9 trung đoàn đường ống, 2 trung đoàn công trình, 1 trung đoàn thông tin, 2 nhà máy cơ khí, 3 tiểu đoàn xe vận tải.\n\nĐến đầu năm 1969, hệ thống này đã vượt qua biên giới với Lào, và đến năm 1970 đã vươn tới gần thung lũng A Sầu ở tỉnh Thừa Thiên... Được hỗ trợ bởi nhiều trạm bơm nhỏ, đường ống bằng thép đã có thể chuyển dầu diesel, xăng và dầu hỏa qua cùng một ống. Nhờ các nỗ lực của Trung đoàn đường ống 592 Quân đội nhân dân Việt Nam, đến năm 1970, chiều dài đường ống vào Lào đã tăng lên nhanh chóng[54]. Ngày 20/1/1975, đường ống xăng dầu đã được Bộ đội Trường Sơn xây dựng vào tới Bu Prăng (nay thuộc huyện Tuy Đức, tỉnh Đắc Nông).\n\nĐến tháng 3/1975, trước yêu cầu của chiến trường, bộ đội Trường Sơn đã quyết tâm hoàn chỉnh hệ thống đường ống xăng dầu, liên hoàn Đông và Tây Trường Sơn, khẩn trương kéo dài thêm được 596 km đường ống tới tận vùng giải phóng, mà điểm cuối của tuyến ống là Bù Gia Mập, bàn giao cho Cục hậu cần Quân giải phóng tại Lộc Ninh, tỉnh Bình Phước (miền Đông Nam bộ) thuộc địa bàn chiến trường B2.\n\nTrong suốt 7 năm (1968 - 1975), tuyến ống này được xây dựng vận hành, đã nhập vào tuyến hơn 317.000 tấn xăng dầu, đã cấp được 5,5 triệu m3 xăng dầu, cung ứng một nguồn vật chất hậu cần hết sức thiết yếu cho các chiến trường.",
        "title": "Tuyến xăng dầu vượt Trường Sơn (1968–1975)"
      },
      {
        "description": "",
        "title": "Đường mòn Hồ Chí Minh trên biển"
      },
      {
        "description": "Cuối tháng 2-1960, Đại tướng Võ Nguyên Giáp dùng trực thăng bay vào làm việc với các tỉnh Quảng Bình, Quảng Trị, đặc khu Vĩnh Linh, Sư đoàn 325, Lữ đoàn 341. Sau chuyến khảo sát, Đại tướng gợi ý khả năng sử dụng máy bay để tạo các tuyến vận tải phục vụ chiến trường. Dựa trên gợi ý này, Không quân Nhân dân Việt Nam đã thành lập riêng một đoàn vận tải đặc biệt mang tên Đoàn 919, hoạt động từ năm 1960.\n\nĐiểm xuất phát của những máy bay Đoàn 919 là sân bay Cát Bi (Hải Phòng), sân bay Vinh, sân bay Đồng Hới và từ đó chuyển hàng vào khu Làng Ho, Vitthulu. Một thời gian sau, khi đã mở con đường Trường Sơn Tây, máy bay của Đoàn 919 bay thẳng sang Hạ Lào. Ban đầu do chưa có sân bay thích hợp nên phải dùng phương pháp thả dù hàng hóa xuống một số địa điểm quy định như Mường Phìn, Mường Phalan... Về sau, do đã có sân bay Tà Khống thuộc tỉnh Xê Pôn, Nam Lào nên các máy bay có thể hạ cánh để đưa hàng và quân tập kết ở đây. Từ sân bay này, bộ đội hành quân vào Nam, hàng hóa thì được vận tải tiếp vào các tuyến phía trong. Trong ba năm từ 1960 – 1962, các máy bay của Đoàn 919 phối hợp với phi công Liên Xô đã thực hiện 3.821 chuyến bay, vận chuyển 9.419 lượt bộ đội và 743 tấn hàng hóa, thả 3.227 dù hàng và kiện hàng.\n\nTuyến vận tải máy bay sang Lào chỉ tồn tại đến năm 1963 thì dừng do Chính phủ Liên hiệp ba phái ở Lào bị tan vỡ. Từ năm 1965, không quân Mỹ đánh phá miền Bắc nên không thể sử dụng máy bay chở hàng vào Quảng Bình hoặc vượt lên tây Trường Sơn được nữa. Đến đầu năm 1973, sau khi ký Hiệp định Paris, vận chuyển hàng không quân sự mới lại được sử dụng lại. Tính từ 1960 cho đến tháng 4-1975, Đoàn 919 đã vận chuyển vào miền Nam và đưa xuống Nam Lào 60.000 lượt bộ đội, 31.000 tấn vũ khí đạn dược, khí tài, lương thực, thuốc men và hàng hóa quân sự.",
        "title": "Đường mòn Hồ Chí Minh trên không"
      },
      {
        "description": "Sau Hiệp định Paris năm 1973, Mỹ ngừng ném bom miền Bắc Việt Nam và Lào. Tuyến chi viện chiến lược Trường Sơn được phát triển nhanh chóng, toàn diện, với quy mô lớn trên mọi mặt.\n\nNăm 1973, hệ thống đường Trường Sơn bao gồm một con đường (rải sỏi và đá vôi) rộng hai làn xe, chạy từ các cửa khẩu ở Bắc Trung Bộ tới dãy Chu Pông ở miền Nam. Năm sau, đã được gia cố hoàn chỉnh từ Tây Nguyên đến tận tỉnh Bình Phước ở phía tây bắc Sài Gòn. Đường ống dẫn dầu duy nhất đã từng kết thúc tại thung lũng A Sầu nay bao gồm 4 đường (đường lớn nhất có đường kính 200 mm) kéo về phía Nam tới Lộc Ninh[55]\n\nTháng 7 năm 1973 Bộ Tư lệnh Trường Sơn được tăng cường tổ chức biên chế, các bộ phận cấp trung đoàn được chuyển lên cấp sư đoàn, và các binh trạm được nâng lên cấp trung đoàn. Bộ tư lệnh Trường Sơn có tám đơn vị cấp sư đoàn gồm hai sư đoàn ô tô vận tải: 571, 471; bốn sư đoàn công binh: 470, 472, 473, 565; Sư đoàn phòng không 377, Sư đoàn bộ binh 968 và một số trung đoàn trực thuộc như: 2 trung đoàn đường ống xăng dầu, 2 trung đoàn cầu, 2 trung đoàn thông tin, 1 trung đoàn vận tải đường sông, 1 trung đoàn giao liên cơ giới, 1 trung đoàn kho, 1 trung đoàn huấn luyện, an dưỡng... Lực lượng thanh niên xung phong trên tuyến gồm 4 đoàn – tương đương trung đoàn, với gần 10 nghìn nam nữ thanh niên. Dưới sự chỉ huy thời kỳ này là Tư lệnh Đồng Sĩ Nguyên và Đại tá Hoàng Thế Thiện là Chính ủy, đầu năm 1975, Đại tá Lê Xy được cử thay Chính ủy.\n\nQuân bổ sung cho các chiến trường đều được hành quân bằng cơ giới, chấm dứt hành quân bộ. Trong mùa khô 1973-1974, mỗi tháng chuyển được trên 30.000 đến 50.000 quân qua tuyến. Trước đây, bộ đội hành quân bộ từ miền Bắc vào chiến trường B2 mất hơn ba tháng, nay chỉ mất hơn chục ngày. Đây là một bước tiến nhảy vọt về chất trong tổ chức hành quân. Đối với hàng, đội hình vận chuyển chủ yếu là trung đoàn, chạy hoàn toàn ban ngày, đi thẳng từ nơi nhận hàng tới nơi giao hàng.\n\nĐến mùa hè năm 1974, Đường tuyến phía Tây Trường Sơn được nâng cấp, mở thêm tuyến đường phía Đông Trường Sơn, hình thành một hệ thống liên hoàn, vững chắc, là cơ sở hạ tầng bảo đảm chi viện liên tục vật chất hậu cần kỹ thuật, cơ động lực lượng, bảo đảm cho đòn tiến công chiến lược khi thời cơ đến. Tuyến hành lang đông – tây Trường Sơn đã hình thành một tuyến hậu cần chiến lược, trải dài trên diện tích 130 nghìn cây số vuông, nối liền hậu phương lớn miền Bắc với các chiến trường Tây nguyên, Trung và Nam bộ, mà điểm cuối cùng tập kết mọi vật chất hậu cần kỹ thuật là tại Bù Gia Mập, Lộc Ninh, tỉnh Bình Phước, bàn giao cho Hậu cần Quân giải phóng.\n\nTrong cuộc Tổng tiến công và nổi dậy mùa Xuân 1975, tuyến đường đã bảo đảm cơ động nhanh chóng 3 quân đoàn, 5 sư đoàn và 2 trung đoàn binh chủng vào chiến dịch, phục vụ hành quân đi các chiến trường 411 nghìn người (cả dân sự).\n\nHệ thống đường Trường Sơn (bao gồm cả tuyến xăng dầu vươt Trường Sơn) là tuyến hậu cần chiến lược vững chắc, một trong những nhân tố quyết định thắng lợi nhiệm vụ chi viện của hậu phương chiến lược miền Bắc cho các chiến trường miền Nam, góp phần quan trọng cho trận chiến quyết định, giải phóng Sài Gòn, thống nhất đất nước.",
        "title": "Đường tới chiến thắng (1973–1975)"
      },
      {
        "description": "Đường Trường Sơn của những năm chiến tranh mang một trọng trách mới: phục vụ nhu cầu phát triển kinh tế - xã hội, an ninh quốc phòng... của thời bình.\n\nDọc bên đường, các thị trấn sầm uất, những khu dân cư đông đúc đã hiện hữu như để minh chứng cho sức sống mãnh liệt trên con đường lịch sử này. Điều đặc biệt là ở những làng nhỏ ven đường sẽ bắt gặp cuộc sống của những cựu Thanh niên xung phong. Họ ở khắp nơi về đây tham gia xây dựng con đường của thời bình để phát triển kinh tế, và khi con đường đã thông, họ lại chọn đây làm nơi lập nghiệp thay vì quay về bản xứ.\n\nTheo Ban quản lý dự án đường Hồ Chí Minh, năm 1996 Chính phủ Việt Nam đã giao Bộ Giao thông Vận tải (Việt Nam) nghiên cứu quy hoạch đường để hình thành trục dọc đường bộ xuyên Việt thứ hai nằm ở phía Tây của đất nước với tên gọi ban đầu là công trình Xa lộ Bắc Nam. Tháng 8 năm 1998, Bộ Chính trị Ban Chấp hành Trung ương Đảng Cộng sản Việt Nam chính thức đổi tên công trình Xa lộ Bắc Nam thành Đường Hồ Chí Minh.\n\nNgày 3 tháng 2 năm 2000, Chính phủ Việt Nam cho phép xây dựng đường Hồ Chí Minh (giai đoạn 1) từ Hòa Lạc (Hà Nội) đến Ngọc Hồi (Kon Tum) và nhánh Tây từ Khe Gát (Quảng Bình) đến Thạnh Mỹ (Quảng Nam). Ngày 5 tháng 4 năm 2000, dự án khởi công.[56]",
        "title": "Sau chiến tranh (1975 - nay)"
      },
      {
        "description": "Tính đến ngày giải phóng miền Nam thống nhất đất nước, đường Trường Sơn đã tồn tại gần 6000 ngày đêm. Các lực lượng công binh, thanh niên xung phong, dân công hỏa tuyến Trường Sơn gồm khoảng 120.000 người đã làm nên mạng đường liên hoàn, vững chắc với 5 hệ thống đường trục dọc, 21 đường trục ngang, nối Đông với Tây Trường Sơn, vươn tới các chiến trường, với tổng chiều dài gần 2 vạn km đường ô tô, 1.400 km đường ống dẫn xǎng dầu, 3.140 km \"đường kín\" cho xe chạy ban ngày và hàng ngàn cầu, cống, ngầm.\n\nTrong các chiến dịch đánh phá từ năm 1965 đến năm 1972, Mỹ đã huy động khoảng 733.000 chuyến máy bay (có 26.539 lần dùng B-52 rải thảm), đánh phá khoảng 152.000 trận; ném xuống các tuyến đường Trường Sơn gần 4 triệu tấn bom đạn và gần 1 triệu galông chất độc hoá học (1 galông = 4,4 lít hàng khô và 3,78 lít hàng lỏng). Hơn 20.000 bộ đội, thanh niên xung phong, công nhân giao thông đã hy sinh; hơn 30.000 người bị thương, khoảng 14.500 xe - máy các loại, hơn 700 khẩu pháo các loại bị phá hủy hoặc hư hại nặng; hơn 90.000 tấn hàng hóa bị đánh cháy... Về phía Mỹ, hàng trăm máy bay các loại bị bắn rơi, hàng ngàn lính biệt kích, thám báo được tung vào đây bị thương vong hoặc bị bắt. Quân đội Mỹ đã tiêu tốn nhiều tỷ USD vào các kế hoạch nhằm cắt đứt tuyến đường song đều bị thất bại.\n\nTướng Merrill McPeak, Tham mưu trưởng Không quân Mỹ, từng là phi công chiến đấu ở Việt Nam. Ông kể lại: bằng phương tiện quan sát hiện đại gắn trên máy bay, ông ta có thể săn những chiếc xe vận tải Việt Nam như săn thỏ. Tuy đã bắn nhiều rocket, thả nhiều bom đến như vậy, nhưng không lực Mỹ vẫn không tài nào ngăn nổi sự vận chuyển trên đường Trường Sơn. Cho đến nay, Merrill McPeek nói rằng ông vẫn ức tới nghẹn cổ, và kết luận: Ông đã ủng hộ nhầm phe, nếu có thể được thì ngày ấy ông nên chiến đấu cùng đội ngũ với các chiến sỹ can trường, quả cảm ở bên phía Việt Nam[57]\n\nTrong 16 năm, tuyến hậu cần chiến lược đường Trường Sơn đã vận chuyển hơn 1 triệu tấn vật chất, vũ khí vào các chiến trường; đưa hơn 2 triệu lượt người hành quân; cơ động 10 lượt sư đoàn, hộ tống hơn 90 đơn vị kỹ thuật vào các chiến trường; cứu chữa gần 1 triệu lượt thương bệnh binh; đưa hơn 500.000 người từ tiền tuyến trở về hậu phương, trong đó có hơn 300.000 thương bệnh binh[58]",
        "title": "Tổng kết 20 năm chiến đấu"
      }
    ]
  },
  {
    "name": "Đền Hai Bà Trưng",
    "location": "Huyện Mê Linh, thành phố Hà Nội[42]",
    "types": "Di tích lịch sử[42]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Hai_B%C3%A0_Tr%C6%B0ng_(M%C3%AA_Linh)",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/%C4%90%E1%BB%81n_Hai_B%C3%A0_Tr%C6%B0ng.jpg/180px-%C4%90%E1%BB%81n_Hai_B%C3%A0_Tr%C6%B0ng.jpg",
    "description": "Đền Hai Bà Trưng còn gọi là đền Hạ Lôi ở thôn Hạ Lôi xã Mê Linh, huyện Mê Linh, thành phố Hà Nội[3][4]. Đền thờ hai vị liệt nữ - anh hùng dân tộc là Trưng Trắc và Trưng Nhị.",
    "events": []
  },
  {
    "name": "Đền Hát Môn",
    "location": "Huyện Phúc Thọ, thành phố Hà Nội[43]",
    "types": "Di tích lịch sử[43]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_H%C3%A1t_M%C3%B4n",
    "imageUrl": "",
    "description": "Đền Hát Môn, còn gọi là đền Hai Bà Trưng, tọa lạc ở xã Hát Môn, huyện Phúc Thọ, thành phố Hà Nội. Di tích Đền Hát Môn (huyện Phúc Thọ, thành phố Hà Nội) đã được Thủ tướng Chính phủ quyết định xếp hạng di tích quốc gia đặc biệt (tại Quyết định số 2383/QĐ-TTg ngày 09/12/2013).[2]",
    "events": []
  },
  {
    "name": "Khu di tích nhà Trần tại Đông Triều",
    "location": "Thành phố Đông Triều, tỉnh Quảng Ninh[44]",
    "types": "Di tích lịch sử[44]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_nh%C3%A0_Tr%E1%BA%A7n_t%E1%BA%A1i_%C4%90%C3%B4ng_Tri%E1%BB%81u",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/DenAnSinh.jpg/180px-DenAnSinh.jpg",
    "description": "Khu di tích nhà Trần tại Đông Triều, tỉnh Quảng Ninh được Thủ tướng Chính phủ xếp hạng di tích lịch sử Quốc gia đặc biệt (Quyết định số 2383/QĐ-TTg ngày 09/12/2013). Hiện nay, Khu di tích này được Thủ tướng Chính phủ phê duyệt Quy hoạch tổng thể bảo tồn và phát huy giá trị trong Quyết định số 307/QĐ-TTg, ngày 07/02/2013 với phạm vi nghiên cứu 11.095 ha, quy mô quy hoạch tổng thể là 2.206 ha, bao gồm 14 di tích nhà Trần và khu vực bảo vệ, dịch vụ du lịch bao quanh. Đây cũng là một trong những Khu di tích Quốc gia đặc biệt của Việt Nam.",
    "events": []
  },
  {
    "name": "Rừng Trần Hưng Đạo",
    "location": "Huyện Nguyên Bình, tỉnh Cao Bằng[45]",
    "types": "Di tích lịch sử[45]",
    "detailLink": "https://vi.wikipedia.org/wiki/R%E1%BB%ABng_Tr%E1%BA%A7n_H%C6%B0ng_%C4%90%E1%BA%A1o",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Rừng Trần Hưng Đạo là khu rừng nằm dưới chân núi Slam Cao thuộc hai xã Tam Kim, Hoa Thám, huyện Nguyên Bình tỉnh Cao Bằng, nằm ở phía Tây Nam và cách thành phố Cao Bằng khoảng 50 km. Khu rừng hiện được công nhận là Di tích quốc gia đặc biệt này là nơi từng diễn ra sự kiện thành lập Đội Việt Nam Tuyên truyền Giải phóng quân, tiền thân của Quân đội Nhân dân Việt Nam vào ngày 22 tháng 12 năm 1944.",
    "events": []
  },
  {
    "name": "Đôi bờ Hiền Lương - Bến Hải",
    "location": "Huyện Gio Linh và huyện Vĩnh Linh, tỉnh Quảng Trị[46]",
    "types": "Di tích lịch sử[46]",
    "detailLink": "https://vi.wikipedia.org/wiki/C%E1%BA%A7u_Hi%E1%BB%81n_L%C6%B0%C6%A1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/C%E1%BB%99t_c%E1%BB%9D_gi%E1%BB%9Bi_tuy%E1%BA%BFn1.JPG/250px-C%E1%BB%99t_c%E1%BB%9D_gi%E1%BB%9Bi_tuy%E1%BA%BFn1.JPG",
    "description": "Cầu Hiền Lương bắc qua sông Bến Hải, tại thôn Hiền Lương, xã Hiền Thành, huyện Vĩnh Linh, tỉnh Quảng Trị, Việt Nam. Cũng tại nơi đây, đã từng diễn ra những cuộc \"chọi loa\", \"chọi cờ\" quyết liệt trong Chiến tranh Việt Nam[1][2]. Thời kỳ đó, cầu Hiền Lương là cây cầu bắc qua sông Bến Hải nơi mà chính là vùng biên giới chia cắt Việt Nam thành hai miền dọc theo vĩ tuyến 17: Miền Bắc do nước Việt Nam Dân chủ Cộng hòa quản lý, miền Nam do phía Quốc gia Việt Nam và sau đó là nước Việt Nam Cộng hoà rồi nước Cộng hòa Miền Nam Việt Nam quản lý, trong suốt gần 22 năm, từ năm 1954 đến năm 1976.",
    "events": []
  },
  {
    "name": "Thành cổ Quảng Trị và những địa điểm lưu niệm sự kiện 81 ngày đêm năm 1972",
    "location": "Thị xã Quảng Trị, huyện Triệu Phong và huyện Hải Lăng, tỉnh Quảng Trị[47]",
    "types": "Di tích lịch sử[47]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A0nh_c%E1%BB%95_Qu%E1%BA%A3ng_Tr%E1%BB%8B",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Th%C3%A0nh_c%E1%BB%95_Qu%E1%BA%A3ng_Tr%E1%BB%8B_4.jpg/250px-Th%C3%A0nh_c%E1%BB%95_Qu%E1%BA%A3ng_Tr%E1%BB%8B_4.jpg",
    "description": "Thành cổ Quảng Trị hoặc Cổ thành Quảng Trị là một Di tích quốc gia đặc biệt của Việt Nam được xếp hạng đợt 4, tọa lạc ở trung tâm thị xã Quảng Trị, tỉnh Quảng Trị.",
    "events": []
  },
  {
    "name": "Chiến thắng Chương Thiện",
    "location": "Thành phố Vị Thanh và huyện Long Mỹ, tỉnh Hậu Giang[48]",
    "types": "Di tích lịch sử[48]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-CTCT-48",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Đền Phù Đổng",
    "location": "Huyện Gia Lâm, thành phố Hà Nội[49]\n21°01′11″B 105°56′14″Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[49]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Ph%C3%B9_%C4%90%E1%BB%95ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/PhuDong_gate.jpg/180px-PhuDong_gate.jpg",
    "description": "Đền Phù Đổng hay còn gọi là đền Gióng thờ Thánh Gióng - Phù Đổng Thiên Vương, nằm ở xã Phù Đổng, Gia Lâm, ngoại thành Hà Nội.",
    "events": []
  },
  {
    "name": "Hồ Hoàn Kiếm và Đền Ngọc Sơn",
    "location": "Quận Hoàn Kiếm, thành phố Hà Nội[50]\n21,0307°B 105,852°Đ",
    "types": "Di tích lịch sử, danh lam thắng cảnh[50]",
    "detailLink": "https://vi.wikipedia.org/wiki/H%E1%BB%93_Ho%C3%A0n_Ki%E1%BA%BFm",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/C%E1%BA%A7u_Th%C3%AA_H%C3%BAc_%28H%C3%A0_N%E1%BB%99i%29.jpg/180px-C%E1%BA%A7u_Th%C3%AA_H%C3%BAc_%28H%C3%A0_N%E1%BB%99i%29.jpg",
    "description": "Hồ Hoàn Kiếm còn được gọi là Hồ Gươm là một hồ nước ngọt tự nhiên nằm ở quận Hoàn Kiếm, trung tâm thành phố Hà Nội. Hồ có diện tích khoảng 12 ha[2]. Trước kia, hồ còn có các tên gọi là hồ Lục Thủy (vì nước có màu xanh quanh năm), hồ Thủy Quân (dùng để duyệt thủy binh), hồ Tả Vọng và Hữu Vọng (trong thời Lê mạt). Tên gọi Hoàn Kiếm xuất hiện vào đầu thế kỷ 15 gắn với truyền thuyết vua Lê Lợi trả lại gươm thần cho Rùa thần. Theo truyền thuyết, trong một lần vua Lê Thái Tổ dạo chơi trên thuyền, bỗng một con rùa vàng nổi lên mặt nước đòi nhà vua trả thanh gươm mà Long Vương cho mượn để đánh đuổi quân Minh xâm lược. Nhà vua liền trả gươm cho rùa thần và rùa lặn xuống nước biến mất. Từ đó hồ được lấy tên là hồ Hoàn Kiếm. Tên hồ còn được lấy để đặt cho một quận trung tâm của Hà Nội (quận Hoàn Kiếm) và là hồ nước duy nhất của quận này cho đến ngày nay.",
    "events": [
      {
        "description": "Sách Lam Sơn thực lục của Nguyễn Trãi có chép là:\n\nKhi ấy Lê Thái Tổ cùng người ở trại Mục sơn là Lê Thận cùng làm bạn keo sơn. Thận thường làm nghề quăng chài. Ở xứ vực Ma viện, đêm thấy đáy nước sáng như bó đuốc soi. Quăng chài suốt đêm, cá chẳng được gì cả. Chỉ được một mảnh sắt dài hơn một thước, đem về để vào chỗ tối. Một hôm Thận cúng giỗ (ngày chết của cha mẹ), nhà vua tới chơi nhà. Thấy chỗ tối có ánh sáng, nhận ra mảnh sắt, nhà vua bèn hỏi:\n\nThận nói:\n\nNhà vua nhân xin lấy. Thận liền cho ngay. Nhà vua đem về đánh sạch rỉ, mài cho sáng, thấy nó có chữ \"Thuận Thiên\", cùng chữ \"Lợi\".Lại một hôm, nhà vua ra ngoài cửa, thấy một cái chuôi gươm đã mài dũa thành hình, nhà vua lạy trời khấn rằng:\n\nBèn lấy mảnh sắt lắp vào trong chuôi, thành ra một chiếc gươm hoàn chỉnh.\nTới hôm sau, hoàng hậu ra trông vườn cải, bỗng thấy bốn vết chân của người lớn, rất rộng, rất to. Hoàng hậu cả kinh, vào gọi nhà vua ra vườn, được quả ấn báu, lại có chữ Thuận Thiên (sau lấy chữ này làm niên hiệu) cùng chữ Lợi. Nhà vua thầm biết ấy là của trời cho, lòng lấy làm mừng, giấu giếm không nói ra.  [4]\n\nTruyền thuyết này được đưa vào nội dung sách giáo khoa của Việt Nam và được viết tiếp đoạn sau, nói về việc Lê Lợi dùng thanh gươm báu đó làm gươm chiến đấu, xông pha chém địch nhiều trận, đánh tới đâu thắng tới đó, cuối cùng đuổi quân Minh bỏ chạy về nước, Lê Lợi được tôn lên làm vua.\n\nĐầu năm 1428, Lê Thái Tổ cùng quần thần bơi thuyền ra hồ Tả Vọng. Nhận lệnh Long Quân, rùa nổi lên mặt nước.Theo lệnh vua, thuyền đi chậm lại. Đứng ở mạn thuyền, vua thấy lưỡi gươm bên người tự nhiên động đậy.\n\nRùa tiến về thuyền vua và nói: \n\nVua nâng gươm hướng về phía Rùa Vàng. Nhanh như cắt, rùa há miệng đớp lấy thanh gươm và lặn xuống nước.\n\nTừ đó, hồ Tả Vọng bắt đầu mang tên là Hồ Gươm hay hồ Hoàn Kiếm [5]",
        "title": "Truyền thuyết Lê Lợi trả gươm Rùa thần"
      },
      {
        "description": "",
        "title": "Di tích lịch sử"
      }
    ]
  },
  {
    "name": "Đình Tây Đằng",
    "location": "Huyện Ba Vì, thành phố Hà Nội[51]",
    "types": "Di tích kiến trúc nghệ thuật[51]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_T%C3%A2y_%C4%90%E1%BA%B1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/%C4%90%C3%ACnh_T%C3%A2y_%C4%90%E1%BA%B1ng_1.jpg/250px-%C4%90%C3%ACnh_T%C3%A2y_%C4%90%E1%BA%B1ng_1.jpg",
    "description": "Đình Tây Đằng là một đình làng ở thị trấn Tây Đằng, huyện Ba Vì, thành phố Hà Nội, Việt Nam. Đình gồm ngôi đình, tả và hữu mạc, sân đình, cổng đình, hồ bán nguyệt. Đây cũng là một di tích quốc gia đặc biệt của Việt Nam được xếp hạng đợt 4.",
    "events": []
  },
  {
    "name": "Chùa Bút Tháp",
    "location": "Thị xã Thuận Thành, tỉnh Bắc Ninh[52] 21,06083°B 106,0222°Đ",
    "types": "Di tích kiến trúc nghệ thuật[52]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_B%C3%BAt_Th%C3%A1p",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Ch%C3%B9a_B%C3%BAt_Th%C3%A1p.jpg/250px-Ch%C3%B9a_B%C3%BAt_Th%C3%A1p.jpg",
    "description": "Chùa Bút Tháp (Ninh Phúc tự 寧福寺) nằm ở bên đê hữu ngạn sông Đuống, thôn Bút Tháp, xã Đình Tổ, thị xã Thuận Thành, tỉnh Bắc Ninh. Ngoài ra, nhân dân trong vùng còn gọi là chùa Nhạn Tháp, chùa Thấp. Tên cũ của chùa trước đây gồm có: Thiếu Lâm Tự, Hoàng Cung Tự.",
    "events": []
  },
  {
    "name": "Chùa Dâu",
    "location": "Thị xã Thuận Thành, tỉnh Bắc Ninh[53] 21,0348283°B 106,0409633°Đ",
    "types": "Di tích kiến trúc nghệ thuật[53]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_D%C3%A2u",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Dau_pagoda.jpg/180px-Dau_pagoda.jpg",
    "description": "Chùa Dâu, còn có tên là Diên Ứng (延應寺), Pháp Vân (法雲寺), hay Cổ Châu, là một ngôi chùa nằm ở phường Thanh Khương, thị xã Thuận Thành, tỉnh Bắc Ninh, cách Hà Nội khoảng 30 km. Đây là trung tâm Phật giáo cổ xưa nhất của Việt Nam. Chùa còn được người dân gọi với những tên gọi khác nhau như chùa Cả, Cổ Châu tự, Diên Ứng tự, Thiền Định tự. Đây là ngôi chùa được coi là có lịch sử hình thành sớm nhất Việt Nam mặc dù các dấu tích vật chất không còn, nó đã được xây dựng lại.[1]. Chùa là một danh lam bậc nhất của xứ kinh Bắc xưa nay. Đây cũng là một di tích quốc gia đặc biệt của Việt Nam được xếp hạng đợt 4. Chùa Dâu được xem là ngôi chùa cổ nhất Việt Nam.",
    "events": []
  },
  {
    "name": "Quần đảo Cát Bà",
    "location": "Huyện Cát Hải, thành phố Hải Phòng[54] 20°50′0″B 107°00′0″Đ",
    "types": "Danh lam thắng cảnh[54]",
    "detailLink": "https://vi.wikipedia.org/wiki/Qu%E1%BA%A7n_%C4%91%E1%BA%A3o_C%C3%A1t_B%C3%A0",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/QD_Catba2.jpg/250px-QD_Catba2.jpg",
    "description": "Quần đảo Cát Bà cách trung tâm thành phố Hải Phòng 60km theo đường biển, có diện tích khu vực đề cử Di sản thế giới là 31.150ha với 388 hòn đảo. Về mặt hành chính, quần đảo Cát Bà thuộc huyện Cát Hải, thành phố Hải Phòng. Nơi đây đã được UNESCO công nhận là khu dự trữ sinh quyển thế giới (năm 2004), được Chính phủ xếp hạng Danh lam thắng cảnh - Di tích quốc gia đặc biệt (năm 2013) và trở thành Di sản thiên nhiên thế giới Vịnh Hạ Long - Quần đảo Cát Bà (năm 2023).",
    "events": []
  },
  {
    "name": "Khu lăng mộ và đền thờ các vị vua triều Lý",
    "location": "Thành phố Từ Sơn, tỉnh Bắc Ninh[55] 21°06′26″B 105°57′37″Đ",
    "types": "Di tích lịch sử[55]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_L%C3%BD_B%C3%A1t_%C4%90%E1%BA%BF",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Ngulongmon2.JPG/250px-Ngulongmon2.JPG",
    "description": "Đền Đô, tên chữ là Cổ Pháp điện, còn được gọi là Đền Lý Bát Đế, là một quần thể kiến trúc tín ngưỡng thờ tám vị vua đầu tiên của nhà Lý. Đền Đô đã được Nhà nước Việt Nam công nhận là di tích lịch sử - văn hóa theo Quyết định số 154 của Bộ Văn hóa - Thông tin (nay là Bộ Văn hóa, Thể thao và Du lịch) ngày 25 tháng 1 năm 1991. Năm 2014, nơi đây cùng với khu lăng mộ các Vua nhà Lý đã được xếp hạng di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Khu lăng mộ và đền thờ các vị vua triều Trần",
    "location": "Huyện Hưng Hà, tỉnh Thái Bình[56]",
    "types": "Di tích lịch sử[56]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Tr%E1%BA%A7n_(Th%C3%A1i_B%C3%ACnh)",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/%C4%90%E1%BB%81n_Tr%E1%BA%A7n_Th%C3%A1i_B%C3%ACnh.jpg/250px-%C4%90%E1%BB%81n_Tr%E1%BA%A7n_Th%C3%A1i_B%C3%ACnh.jpg",
    "description": "Đền Trần Thái Bình là một quần thể di tích gồm các đền thờ, lăng mộ thờ các vị vua quan nhà Trần. Đền thờ các vua Trần trên đất phát tích Thái Bình (còn gọi là Thái Đường Lăng) thuộc làng Tam Đường, xã Tiến Đức, huyện Hưng Hà. Hệ thống các di tích lịch sử ở đây gồm Khu lăng mộ và đền thờ các vị vua triều Trần đều đã được chính phủ Việt Nam xếp hạng di tích quốc gia đặc biệt quan trọng.[2]",
    "events": []
  },
  {
    "name": "Khu đền thờ Tây Sơn Tam Kiệt",
    "location": "Huyện Tây Sơn, tỉnh Bình Định[57]",
    "types": "Di tích lịch sử[57]",
    "detailLink": "https://vi.wikipedia.org/wiki/T%C3%A2y_S%C6%A1n_Tam_Ki%E1%BB%87t",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Quang_Trung_museum.JPG/180px-Quang_Trung_museum.JPG",
    "description": "Nhà Tây Sơn (chữ Nôm: 家西山, chữ Hán: 西山朝 / Tây Sơn triều) là một triều đại quân chủ trong lịch sử Việt Nam tồn tại từ năm 1778 đến năm 1802, được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung hưng (1533–1789). Theo cách gọi của phần lớn sử gia, nhất là các sử gia hiện đại[1] tại Việt Nam thì \"nhà Tây Sơn\" được dùng để gọi triều đại của anh em Nguyễn Nhạc, Nguyễn Lữ và Nguyễn Huệ để phân biệt với nhà Nguyễn của Nguyễn Ánh (vì cùng họ Nguyễn). Ngoài ra, \"Tây Sơn\" cũng chỉ các lãnh tụ và quân đội khởi nghĩa xuất thân từ ấp Tây Sơn; cũng được dùng làm tên cuộc chiến của Tây Sơn.",
    "events": []
  },
  {
    "name": "Địa điểm Chiến thắng Rạch Gầm - Xoài Mút",
    "location": "Huyện Châu Thành, tỉnh Tiền Giang[58]",
    "types": "Di tích lịch sử[58]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_chi%E1%BA%BFn_th%E1%BA%AFng_R%E1%BA%A1ch_G%E1%BA%A7m_-_Xo%C3%A0i_M%C3%BAt",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/T%C6%B0%E1%BB%A3ng_%C4%91%C3%A0i_R%E1%BA%A1ch_G%E1%BA%A7m-Xo%C3%A0i_M%C3%BAt.JPG/180px-T%C6%B0%E1%BB%A3ng_%C4%91%C3%A0i_R%E1%BA%A1ch_G%E1%BA%A7m-Xo%C3%A0i_M%C3%BAt.JPG",
    "description": "Khu di tích chiến thắng Rạch Gầm – Xoài Mút tọa lạc tại ấp Đông, xã Kim Sơn, huyện Châu Thành, tỉnh Tiền Giang, Việt Nam; cách thành phố Mỹ Tho hơn 12 km về phía tây.[1]",
    "events": []
  },
  {
    "name": "Nhà tù Sơn La",
    "location": "Thành phố Sơn La, tỉnh Sơn La[59]",
    "types": "Di tích lịch sử[59]",
    "detailLink": "https://vi.wikipedia.org/wiki/Nh%C3%A0_t%C3%B9_S%C6%A1n_La",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Nhatusonla.jpg/250px-Nhatusonla.jpg",
    "description": "Nằm tại trung tâm thành phố Sơn La, cách Lào 45 km về phía Nam, nhà tù Sơn La đã được người Pháp xây dựng trong thời kỳ Pháp thuộc nhằm mục tiêu giam cầm những người làm cách mạng của Việt Nam. Trải qua 3 lần xây dựng và mở rộng, nhà tù Sơn La có tổng diện tích là: 2.170m2. Ngày nay, nơi đây trở thành một trong những điểm tham quan lịch sử rất có ý nghĩa với người dân Việt Nam cũng như du khách quốc tế.",
    "events": []
  },
  {
    "name": "Nhà tù Phú Quốc",
    "location": "Thành phố Phú Quốc, tỉnh Kiên Giang[60]",
    "types": "Di tích lịch sử[60]",
    "detailLink": "https://vi.wikipedia.org/wiki/Nh%C3%A0_t%C3%B9_Ph%C3%BA_Qu%E1%BB%91c",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Phu_Quoc_Prison_DSC_0631.jpg/180px-Phu_Quoc_Prison_DSC_0631.jpg",
    "description": "Trại giam Tù binh Chiến tranh Phú Quốc, hay Trại giam Tù binh Cộng sản Phú Quốc là một trại giam nằm tại phường An Thới ở phía nam đảo Phú Quốc. Trong Chiến tranh Đông Dương, trại giam này có tên là Nhà lao Cây Dừa. Đây là trại giam tù binh trung tâm toàn Việt Nam Cộng hòa, từng giam giữ hơn 32.000 tù binh (40.000 tù nhân nếu tính cả tù chính trị nhiều thời kỳ).",
    "events": [
      {
        "description": "Năm 1949 khi quân Trung Hoa Quốc dân đảng thua trận trước Quân Giải phóng Nhân dân Trung Quốc, Hoàng Kiệt (黃杰 Huang Chieh) tướng lĩnh tỉnh Hồ Nam dẫn hơn 30000 quân chạy sang Việt Nam, lúc bấy giờ được Pháp đưa ra đóng quân tại phía Nam đảo Phú Quốc. Sau đó, năm 1953, họ về Đài Loan theo Tưởng Giới Thạch. Họ bỏ lại nhà cửa đồn điền, thực dân Pháp thấy vậy tận dụng nhà cửa có sẵn lập ra nhà tù rộng khoảng 40 hecta gọi là \"Trại Cây Dừa\" nhốt tù binh gần 14000 người.[1]\n\nTrại gồm 4 khu nhà giam A, B, C, D. Các tù binh cộng sản bị Pháp bắt từ các chiến trường Trung, Nam, Bắc Việt Nam bị tập trung đưa ra trại giam này ở Phú Quốc. Số tù binh này gồm khoảng 14000 người, đa số từ nhà tù Đoạn Xá (Hải Phòng). Cũng như tại các nhà tù khác trong Chiến tranh Đông Dương, tù nhân cộng sản tại Trại Cây Dừa sinh hoạt đấu tranh chống khủng bố, đàn áp, và tổ chức vượt ngục. Sau hơn 1 năm ở trại, có 99 tù nhân bị chết, 200 người vượt ngục.\n\nTháng 7 năm 1954, sau Hiệp định Genève, Pháp trao trả cho phía Việt Nam Dân chủ Cộng hòa hầu hết tù binh ở trại này.",
        "title": "Trong Kháng chiến chống Pháp"
      },
      {
        "description": "Cuối năm 1955, Việt Nam Cộng hòa xây dựng một trại giam ở địa điểm Căng Cây Dừa cũ, với diện tích rộng 4 ha, đặt tên là Trại huấn chính Cây Dừa, còn gọi là Nhà lao Cây Dừa. Trại tù có nhà giam tù nam, nhà giam tù nữ, nhà giam phụ lão. Ngày 2 tháng 1 năm 1956, 598 người tù từ trại Trung tâm huấn chính Biên Hòa được đưa đến đề lao Gia Định, rồi đưa xuống tàu vận tải Hắc Giang của hải quân chở từ Sài Gòn về đến Phú Quốc. Về sau còn có thêm một số tù chính trị thuộc diện \"Việt Cộng\" hoặc \"thân Cộng\" cũng được đưa đến Trại huấn chính Cây Dừa.\n\nTrong 7 tháng, từ tháng 2 đến tháng 9 năm 1956, có khoảng 100 tù nhân vượt ngục, trong đó có một số người bị bắn chết khi vượt rào. Các ông Phạm Văn Khỏe (em ruột của Phạm Hùng), và Mai Thanh (Tỉnh ủy viên, Bí thư Thị ủy Rạch Giá) cũng vượt ngục trong thời gian này. Thấy tình hình bất ổn, năm 1957, Việt Nam Cộng hoà đưa số tù chính trị ở \"Trại huấn chính Cây Dừa\" về đất liền, và đày một số ra nhà tù Côn Đảo.\n\nKhi chiến tranh Việt Nam leo thang, số tù binh và tù chính trị tăng cao, chính quyền Việt Nam Cộng hòa xây dựng thêm nhiều trại giam tù binh ở Biên Hòa, Pleiku, Đà Nẵng, Cần Thơ, Quy Nhơn... Tại Phú Quốc, năm 1966, một trại giam rộng hơn 400 ha được xây dựng ở thung lũng An Thới, cách \"Căng Cây Dừa\" cũ 2 km. Trại giam gồm 12 khu, mỗi khu có 4 phân khu A, B, C, D, với trên 400 nhà giam, được gọi là Trại giam tù binh cộng sản Việt Nam / Phú Quốc, thường được gọi là Trại giam tù binh Phú Quốc. Mỗi phân khu, ngoài 9 phòng để tù binh ở, có 2 phòng để thẩm vấn, phạt vạ hoặc biệt giam tù binh... Tất cả 11 phòng đều có cấu trúc vì kèo sắt, nóc tôn, vách tôn, mỗi phòng bề ngang 5 mét, dài 20 mét, hai đầu chừa hai lối ra vào, bề ngang khoảng 8 tấc và mỗi bên vách tôn có 4 cửa sổ, dưới vách tôn có khoảng trống chừng 3 tấc, có rào dây kẽm gai. Để canh gác khu trại giam, chung quanh mỗi khu giam có một pháo đài canh gác có đặt súng đại liên; tại cổng chính của khu giam có 2 vọng gác; một vọng tổng kiểm soát đốc canh, 2 giờ thay phiên gác một lần, liên tục 24/24 giờ; hai xe tuần tra liên tục quanh khu giam; ban đêm còn có các toán vào vòng rào giới hạn để kiểm soát lưu động tại các phân khu và 10 vọng gác di động. Đứng đầu ban chỉ huy trại giam là một trung tá hoặc đại úy (có lúc là một chuẩn tướng) Quân lực Việt Nam Cộng hòa, đằng sau là một cố vấn người Mỹ. Lực lượng canh giữ trực tiếp trại giam gồm có 4 tiểu đoàn quân cảnh, một liên đội địa phương quân, một đại đội công binh, một đơn vị hải thuyền và một đội quân khuyển.\n\nNhà tù Phú Quốc trở thành trại giam tù binh trung tâm toàn Việt Nam Cộng hòa, giam giữ hơn 32000 tù binh (40000 tù nhân nếu tính cả tù chính trị nhiều thời kỳ). Có khoảng 12000 tù nhân là bộ đội chủ lực, bộ đội địa phương, trong đó có khoảng 9000 người từ miền Bắc. Có trên 20000 tù nhân là dân quân du kích xã, ấp và cán bộ chính trị. Có hơn 2000 sĩ quan, hạ sĩ quan; trên 100 tù nhân là cán bộ cộng sản có trình độ chính trị trung cấp, sơ cấp (trong đó có 10 tỉnh ủy viên, trên 40 huyện ủy viên) và trên 200 chi ủy viên.\nVào tháng 5-1969 tù binh đã tổ chức vượt ngục thành công tại khu B2.",
        "title": "Trong Chiến tranh Việt Nam"
      }
    ]
  },
  {
    "name": "Địa đạo Vĩnh Mốc và hệ thống làng hầm Vĩnh Linh",
    "location": "Huyện Vĩnh Linh, tỉnh Quảng Trị[61]",
    "types": "Di tích lịch sử[61]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%8Ba_%C4%91%E1%BA%A1o_V%E1%BB%8Bnh_M%E1%BB%91c",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Visitors_in_Vinh_Moc_tunnel.JPG/250px-Visitors_in_Vinh_Moc_tunnel.JPG",
    "description": "Địa đạo Vịnh Mốc (thôn Vịnh Mốc, xã Kim Thạch, huyện Vĩnh Linh, tỉnh Quảng Trị) là một công trình quân - dân sự trong Chiến tranh Việt Nam của phía Việt Nam Dân chủ Cộng hòa nhằm chống lại các cuộc tấn công của phía Việt Nam Cộng hòa và Hợp chúng quốc Hoa Kỳ. Hệ thống địa đạo tồn tại ở phía Bắc sông Bến Hải, cầu Hiền Lương trong suốt những năm 1965-1972.",
    "events": []
  },
  {
    "name": "Khu di tích Bà Triệu",
    "location": "Huyện Hậu Lộc, tỉnh Thanh Hóa[62]",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[62]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_B%C3%A0_Tri%E1%BB%87u",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Den-tho-ba-trieu.jpg/250px-Den-tho-ba-trieu.jpg",
    "description": "Đền Bà Triệu là nơi thờ tự vị nữ anh hùng dân tộc Việt tên là Triệu Thị Trinh, người đã có công đánh đuổi quân xâm lược Đông Ngô (Trung Quốc) vào giữa thế kỷ thứ 3. Đền nằm trên núi Gai, ngay sát Quốc lộ 1, đoạn đi qua thôn Phú Điền, xã Triệu Lộc, huyện Hậu Lộc, tỉnh Thanh Hóa, cách thành phố Thanh Hóa 18 km về phía Bắc và cách Hà Nội 137 km về phía Nam.",
    "events": []
  },
  {
    "name": "Chùa Thầy và khu núi đá Sài Sơn, Hoàng Xá, Phượng Cách",
    "location": "Huyện Quốc Oai, thành phố Hà Nội[63]",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[63]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Th%E1%BA%A7y",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Ch%C3%B9a_Th%E1%BA%A7y_%289411972929%29.jpg/250px-Ch%C3%B9a_Th%E1%BA%A7y_%289411972929%29.jpg",
    "description": "Chùa Thầy (chữ nôm:㕑偨) là một nhóm những ngôi chùa ở chân núi Sài Sơn, huyện Quốc Oai, tỉnh Hà Tây cũ, nay là xã Sài Sơn, huyện Quốc Oai, Hà Nội, cách trung tâm Hà Nội khoảng 20 km về phía Tây nam, đi theo đường cao tốc Láng - Hòa Lạc. Sài Sơn có tên Nôm là núi Thầy, nên chùa được gọi là chùa Thầy. Chùa được xây dựng từ thời nhà Lý. Đây từng là nơi tu hành của Thiền sư Từ Đạo Hạnh, lúc này núi Thầy còn gọi là núi Phật Tích.",
    "events": []
  },
  {
    "name": "Chùa Tây Phương",
    "location": "Huyện Thạch Thất, thành phố Hà Nội[64]",
    "types": "Di tích kiến trúc nghệ thuật[64]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_T%C3%A2y_Ph%C6%B0%C6%A1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Ch%C3%B9a_T%C3%A2y_Ph%C6%B0%C6%A1ng.JPG/180px-Ch%C3%B9a_T%C3%A2y_Ph%C6%B0%C6%A1ng.JPG",
    "description": "Chùa Tây Phương (tên chữ là Sùng Phúc tự 崇福寺) là một ngôi chùa được xây trên đỉnh đồi Câu Lâu , xã Thạch Xá, huyện Thạch Thất, thành phố Hà Nội.",
    "events": []
  },
  {
    "name": "Chùa Phật Tích",
    "location": "Huyện Tiên Du, tỉnh Bắc Ninh",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[65]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Ph%E1%BA%ADt_T%C3%ADch",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/ChuyetChuyet_mummy.jpg/250px-ChuyetChuyet_mummy.jpg",
    "description": "Chùa Phật Tích (Phật Tích tự 佛跡寺) còn gọi là chùa Vạn Phúc (Vạn Phúc tự 萬福寺) là một ngôi chùa nằm ở sườn phía Nam núi Phật Tích (còn gọi núi Lạn Kha, non Tiên), xã Phật Tích, huyện Tiên Du, tỉnh Bắc Ninh. Trong chùa có tượng đức Phật bằng đá thời nhà Lý lớn nhất Việt Nam. Chùa Phật Tích được xếp hạng Di tích Lịch sử- Văn hóa tại Quyết định số 313/VH-VP, ngày 28 tháng 4 năm 1962 của Bộ Văn hóa và được Thủ tướng chính phủ ký và xếp hạng 62 Di tích quốc gia đặc biệt của Việt Nam",
    "events": []
  },
  {
    "name": "Đền Sóc",
    "location": "Huyện Sóc Sơn, thành phố Hà Nội[66]",
    "types": "Di tích kiến trúc nghệ thuật[66]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_S%C3%B3c",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/%C4%90%E1%BB%81n_Gi%C3%B3ng%2C_S%C3%B3c_S%C6%A1n%2C_H%C3%A0_N%E1%BB%99i_-_panoramio_%281%29.jpg/180px-%C4%90%E1%BB%81n_Gi%C3%B3ng%2C_S%C3%B3c_S%C6%A1n%2C_H%C3%A0_N%E1%BB%99i_-_panoramio_%281%29.jpg",
    "description": "Khu di tích lịch sử đền Sóc nằm dưới chân Núi Sóc là nơi gắn với truyền thuyết anh hùng Thánh Gióng bay về trời sau khi đánh thắng giặc Ân.",
    "events": []
  },
  {
    "name": "Khu di tích Phố Hiến",
    "location": "Thành phố Hưng Yên, tỉnh Hưng Yên[67]",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[67]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ph%E1%BB%91_Hi%E1%BA%BFn",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/V%C4%83n_mi%E1%BA%BFu_X%C3%ADch_%C4%90%E1%BA%B1ng_02.JPG/250px-V%C4%83n_mi%E1%BA%BFu_X%C3%ADch_%C4%90%E1%BA%B1ng_02.JPG",
    "description": "Phố Hiến (chữ Nôm: 庯憲) là một địa danh lịch sử ở thành phố Hưng Yên. Vào các thế kỷ 17-18, nơi đây là một thương cảng cổ nổi tiếng của Việt Nam. Lúc ấy, phố Hiến là một đô thị trải dài theo bờ tả ngạn sông Hồng. Ngoài kinh đô Thăng Long - Kẻ Chợ là thủ đô phồn vinh nhất nước, Phố Hiến đã là một đô thị nổi bật đứng ở vị trí thứ hai. Dân gian có câu: \"Thứ nhất Kinh Kỳ, thứ nhì Phố Hiến\". Văn bia chùa Thiên ứng, dựng năm Vĩnh Tộ thứ 7 (1625, đời vua Lê Thần Tông) đã ghi: \"Phố Hiến nổi tiếng trong bốn phương là một tiểu Tràng An\" - tức một Kinh đô thu nhỏ [1].",
    "events": [
      {
        "description": "Ngay từ thế kỷ 10, vùng Đằng Châu ở phía bắc thành phố Hưng Yên ngày nay vốn là một lãnh địa của sứ quân Phạm Bạch Hổ, ông đã gây dựng nơi đây thành thủ phủ một vùng đất rộng lớn và là một trung tâm quân sự thời 12 sứ quân. Đến thời Tiền Lê, vùng đất này tiếp tục là thực ấp của Lý Công Uẩn. Thế kỷ 13, dưới thời nhà Trần, khi nhà Nguyên diệt Tống, một số kiều dân Trung Quốc tị nạn đã kéo sang Việt Nam, lập nên làng Hoa Dương. Cùng lúc đó, một số người Việt từ nhiều địa phương khác nhau cũng dần dần đến sinh sống tại địa điểm tụ cư này để buôn bán và làm ăn.\n\nTheo sách Khâm định Việt sử Thông giám cương mục, thì tên Phố Hiến có xuất xứ từ chữ Hiến của Hiến Doanh hay Hiến Nam, vốn là cơ quan hành chính của trấn Sơn Nam xưa. Sách ấy chép:\"...vì là sở lỵ của ty Hiến sát sứ Sơn Nam đời cố Lê nên có tên gọi vậy\". Các tác giả của sách Đại Nam nhất thống chí cũng đã thừa nhận ý kiến này. Và có nhiều khả năng là tên gọi Phố Hiến lần đầu tiên xuất hiện vào cuối thế kỷ 15 trong công cuộc cải cách hành chính của vua Lê Thánh Tông. Tuy nhiên, phải đến thế kỷ 17, Phố Hiến mới trở thành một trung tâm chính trị - kinh tế có nhiều mối giao lưu quốc tế. Lúc này, ở Phố Hiến có lị sở của trấn thủ xứ Sơn Nam, ty Hiến sát xứ Sơn Nam, các trạm tuần ty kiểm soát thuyền bè trong ngoài nước, một đoạn sông tấp nập các thuyền bè đi lại và đỗ bến, những chợ phố đông đúc, các thợ thủ công và thương nhân người Việt, người Hoa, Nhật Bản và phương Tây.[2][3]\n\nPhố Hiến xưa nằm sát bên bờ tả ngạn sông Hồng, nhưng do phù sa bồi đắp nên ngày nay đã ở cách dòng sông khoảng chừng 2 km. Theo đường sông, Phố Hiến cách Hà Nội 55 km. Trước đây từ Thăng Long xuôi thuyền xuống Phố Hiến mất khoảng 2 ngày, ngược dòng lên Kinh đô mất 3 ngày. Vị trí của Phố Hiến có vai trò đặc biệt quan trọng đối với các tuyến giao thông đường thủy thuộc hệ thống sông Hồng-sông Thái Bình nằm trong vùng đồng bằng Bắc Bộ. Các nhà địa chất chia châu thổ Bắc Bộ thành 3 vùng tương ứng với ba thời kỳ thành tạo lớn: Thượng châu thổ với đỉnh của các triền sông là Việt Trì; Trung châu thổ với đỉnh là Cổ Loa; và Hạ châu thổ với đỉnh là Phố Hiến, từ đó các nhánh sông trải ra vùng đồng bằng như những chiếc nan quạt. Bằng đường thủy, từ Phố Hiến có thể liên lạc tới hầu hết các địa phương thuộc các trấn Sơn Nam, Hải Dương, An Quảng. Phố Hiến là nơi trung chuyển, cửa ngõ án ngữ hoặc thông thương của mọi tuyến giao thương đường sông từ vùng biển Bắc Bộ đi sâu vào đất liền tới Kinh thành Thăng Long, qua các tuyến sông Đáy, sông Hồng, sông Thái Bình.[4]\n\nCùng với các tuyến giao thương đường sông, các tuyến giao thương ven biển đã nối liền Phố Hiến với các thị trường xa hơn. Từ thời nhà Trần, các thương nhân người Hoa ở Xích Đằng đã có những mối liên hệ với các cảng Hội Triều (Thanh Hoá), Càn Hải và Hội Thống (Nghệ An). Thế kỷ 17-18, các quan hệ thương mại giữa Phố Hiến và vùng Sơn Nam với các phố cảng Đàng Trong thông qua các khách buôn nước ngoài càng được tăng cường, như các bến đò Phục Lễ, Phù Thạch, Thanh Hà (Thuận Hoá), Hội An. Qua hai hệ thống sông Đàng Ngoài và sông Đáy, Phố Hiến còn bắt nhịp với các tuyến giao thương quốc tế ở biển Đông, như Nhật Bản, Trung Quốc, các nước Đông Nam Á, cũng như với các nước phương Tây như Bồ Đào Nha, Hà Lan, Anh, Pháp...",
        "title": "Lịch sử - địa lý"
      },
      {
        "description": "Ngoài vị trí trung tâm trấn Sơn Nam, Phố Hiến chủ yếu mang diện mạo của một đô thị kinh tế. Kết cấu của nó bao gồm một bến cảng sông; một tập hợp chợ; khu phường phố; và hai thương điếm phương Tây (Hà Lan và Anh).\n\nMạch máu giao thương của Phố Hiến là sông Xích Đằng - đoạn sông Nhị Hà chảy sát Phố Hiến. Đây là nơi trung chuyển và là điểm tụ hội của những đoạn đường sông từ biển Đông vào tới kinh thành Thăng Long như tuyến Đàng Ngoài, nhiều tuyến sông khác. Bến cảng Phố Hiến là nơi các tàu thuyền ngoại quốc lưu đỗ để làm thủ tục kiểm soát và xin giấy phép đi tiếp tới Kinh đô. Cùng với bến cảng sông là một các khu chợ khá sầm uất như chợ Vạn ở bến Xích Đằng, chợ Hiến bên cạnh lị sở Sơn Nam, chợ Bảo Châu... Những chợ này đã vượt khỏi khuôn khổ những chợ địa phương để chở thành các chợ liên vùng. Thuyền bè từ Thăng Long - Kẻ Chợ và các trấn gần xa trong nước cũng như nước ngoài đã đến đây buôn bán, trao đổi hàng hoá.\n\nKhu phường phố là khu định cư của người Việt và các kiều dân ngoại quốc (chủ yếu là người Hoa) sản xuất và buôn bán với tính chất cố định ở Phố Hiến. Dựa theo các văn bia ở chùa Hiến (1709) và chùa Chuông (1711), Phố Hiến thời đó có khoảng 20 phường [5] Qua các bi ký, có thể đọc được 13 phố và 32 tên cửa hiệu buôn bán như các Tân Thị, Tân Khai, Tiên Miếu, Hậu Trường…\n\nTrong thế kỷ 17, có hai thương điếm phương Tây đã được dựng lên ở Phố Hiến: thương điếm Hà Lan (1637-1700) và thương điếm Anh (1672-1683). Đây là văn phòng đại diện kiêm nhà kho của các Công ty Đông Ấn của Hà Lan và Anh. Đây là một quần thể kiến trúc được xây bằng gạch, nằm ở phía dưới Phố Hiến, quãng gần thôn Nễ Châu và Vạn Mới. Từ thế kỷ 18, quần thể kiến trúc này đã bị huỷ hoại trở thành đồng ruộng. Đến cuối thế kỷ 19 được tác giả người Pháp G. Dumoutier miêu tả lại [6]\n\nPhố Hiến mang những nhu cầu tâm linh văn hoá của nhiều cộng đồng người khác nhau, thể hiện qua những công trình kiến trúc. Nổi bật là các phong cách kiến trúc Việt Nam và phong cách kiến trúc Trung Hoa (với sắc thái vùng Phúc Kiến, phía Nam Trung Quốc), thấp thoáng có phong cách kiến trúc châu Âu (nhà thờ Gô-tích Phố Hiến). Nhiều khi, các phong cách kiến trúc đó pha trộn lẫn nhau. Nhà thờ Kitô giáo ở Phố Hiến là một nhà thờ cổ, xây dựng từ thế kỷ 17 theo kiểu Gô-tích. Cũng như ở các đô thị Việt Nam khác, bên cạnh những kiến trúc bằng gạch ngói, đại bộ phận nhà ở của dân đều bằng gỗ tre nứa, lại ở sát nhau. Nhiều vụ hoả hoạn đã xảy ra.[7]\n\nTrong lịch sử, Phố Hiến là một đô thị đa quốc tịch, trong đó nhiều nhất là người Việt và người Hoa. Những kiều dân ngoại quốc khác ở đây là Nhật, Xiêm La, Bồ Đào Nha, Hà Lan, Anh, Pháp… Phần lớn người Việt cự ngụ ở Phố Hiến là từ các địa phương khác đổ về sinh sống làm ăn, đó là một cộng đồng cư dân tứ xứ.[8]\n\nBên cạnh cộng đồng người Việt, đông đảo người Hoa đã đến cư trú tại Phố Hiến. Địa điểm tụ cư đầu tiên của người Hoa ở Phố Hiến là Hoa Dương, sau gộp thêm các xã Hoa Điền (Lương Điền), Hoa Cái (Phương Cái) hợp thành Tam Hoa. Các cửa hiệu của Hoa Kiều được tập trung ở Phố Khách, phố Bắc Hoà, Nam Hoà; nhiều nhà xây gạch ngói. Họ xây dựng nhiều đình, đền, chùa, miếu, quảng hội thờ các vị nhân thần người Trung Quốc như Quan Vân Trường, Dương Qúy Phi, Lâm Tức Mặc.[9] Khi việc buôn bán giữa phương Tây và Phố Hiến sa sút thì các Hoa thương vẫn trụ lại, gần như nắm giữ độc quyền các hoạt động ngoại thương. Lúc này cũng có hiện tượng một số Hoa thương ở Phố Hiến di cư ngược trở lại Thăng Long - Hà Nội, như trường hợp các gia đình họ Phan ở phố Hàng Ngang. Hiện nay, vẫn có tới 14 họ thuộc các Hoa Kiều sinh sống ở Phố Hiến - Hưng Yên như các họ Ôn, Tiết, Hoàng, Lý, Trần, Bạch, Quách, Mã, Thái, Hà, Hứa, Từ, Lâm, Khu.\n\nNgười Nhật cũng đã đến Phố Hiến từ rất sớm vào khoảng đầu thế kỷ XVII. Họ thường mang bạc, đồng đến mua đổi lấy các loại tơ hoặc vải lụa. Một số khác là các giáo sĩ và giáo dân Nhật Bản, có tên đạo theo chữ La Tinh, đã đi theo và phục vụ các giáo sĩ phương Tây tới Đàng Ngoài giảng đạo. Vì đã sinh sống lâu năm ở Việt Nam, những người Nhật này thường làm một số nghề như hoa tiêu dẫn tàu vào cửa sông, phiên dịch, môi giới… Tại Phố Hiến trước đây có một khu đất được gọi là Nghĩa trang Nhật Bản.\n\nở Phố Hiến ngoài người Trung Quốc và Nhật Bản còn có các thương nhân châu á khác đến buôn bán như Xiêm La, Mã Lai, Lữ Tống (Philíppin)... Phương Tây, ngoài người Hà Lan và người Anh đã từng lập thương điếm ở Phố Hiến, còn một số người Bồ Đào Nha và Pháp. Người Bồ Đào Nha là người phương Tây Phố Hiến sớm nhất. Đó là những thương nhân độc lập, không lập công ty, không đặt thương điếm. Không ít những người Pháp cũng sống ở Phố Hiến vào những năm 80 của thế kỷ XVII. Thương điếm của Công ty Ấn Độ Pháp thành lập ở Phố Hiến năm 1680.",
        "title": "Đô thị - dân cư"
      },
      {
        "description": "Phố Hiến từ nơi tụ cư, một thị trấn phát triển thành một đô thị lớn vào thế kỷ XVII đã luôn mang tính nổi trội đậm sắc thái kinh tế. Lúc đầu là các hoạt động buôn bán qua mạng lưới chợ. Sau đó, thương nghiệp ngày càng phát triển và trở thành hoạt động kinh tế mũi nhọn chủ yếu, đặc biệt là ngoại thương do lợi thế là một bến sông, đầu mối của các tuyến giao thông vùng. Điểm tụ cư ban đầu của số người Hoa tị nạn (làng Hoa Dương) cũng là một hạt nhân kinh tế sẽ phát triển mạnh mẽ trong những thời kỳ sau. Bước chuyển về chất trong đời sống kinh tế của Phố Hiến là khi có sự tác động của một nhân tố chính trị vào nền tảng kinh tế đó và hệ quả là sự chuyển dịch trọng tâm từ những yếu tố nội sinh sang những yếu tố ngoại sinh.\n\nCác lái buôn Hà Lan là những người phương Tây đặt thương điếm sớm nhất ở Phố Hiến. Những thập kỷ đầu, công việc buôn bán của thương điếm Hà Lan ở Phố Hiến diễn ra khá suôn sẻ và được nhà nước Lê - Trịnh chiếu cố ưu tiên so với những người ngoại quốc khác. Sau khi cuộc chiến Trịnh - Nguyễn chấm dứt, chúa Trịnh dần tỏ thái độ lạnh nhạt với Hà Lan, lại thêm sự cạnh tranh của các lái buôn phương Tây khác, đặc biệt là người Anh. Người Anh đến Phố Hiến muộn hơn người Hà Lan. Trong những năm đầu, thương điếm Anh ở Phố Hiến làm ăn tương đối phát đạt, cạnh tranh với các đối thủ của mình như các thương nhân Hà Lan, Trung Quốc, một phần nhờ tài tháo vát, ứng xử khôn khéo của W. Gyfford.\n\nThời kỳ phồn thịnh nhất của Phố Hiến là vào khoảng giữa thế kỷ XVII (1630-1680). Sau đó là quá trình suy thoái, diễn ra trong gần 2 thế kỷ để cuối cùng trở thành tỉnh lị Hưng Yên. Biểu hiện rõ nhất của sự suy thoái của Phố Hiến là sự sa sút trong các hoạt động buôn bán với nước ngoài. Mặt khác, lúc này tình hình chính trị khu vực và hệ thống kinh tế thương mại biển Đông cũng đã có những chuyển biến. Trung Quốc bãi bỏ lệnh hải cấm, mở ra một thị trường đông đúc hấp dẫn. Nhật Bản cũng chuyển sang chiến lược xuất khẩu bạc, vàng, tơ lụa. Các tuyến buôn bán đường biển trực tiếp trở nên thông thoáng hơn, không cần qua khâu trung gian, như trường hợp Đàng Ngoài. Trong hoàn cảnh đó, ngoại thương Việt Nam và ở Phố Hiến nói riêng đã giảm thiểu đáng kể. Các thương điếm phương Tây ở Phố Hiến và Kẻ Chợ lần lượt đóng cửa, các tàu buôn phương Tây hầu như rất ít còn lại vùng Đàng Ngoài. Phố Hiến vắng hẳn các khách buôn nước ngoài, trừ người Trung Quốc là còn ở lại buôn bán.\n\nThế kỷ XIX, khi kinh đô chuyển vào Huế, một làn sóng của thương nhân Trung Hoa ồ ạt nhập cư vào Hà Nội, một số gia đình Hoa Kiều trước kia từ Kẻ Chợ di cư đến Phố Hiến nay quay ngược trở về Hà Nội, phần nào cũng làm cho Phố Hiến trở nên vắng đi. Cũng trong quá trình suy thoái về kinh tế, Phố Hiến đã mất dần đi vai trò quan trọng về chính trị. Bến cảng Phố Hiến do sự bồi lở của sông Hồng ngày càng trở nên bất tiện, làm Phố Hiến ngày càng cách xa dòng sông. Vì vậy, năm 1726, chính quyền Lê - Trịnh đã chuyển dời trấn lị Sơn Nam sang bên hữu ngạn sông Hồng thuộc huyện Duy Tiên. Năm 1741, trấn Sơn Nam được tách thành Sơn Nam thượng và hạ, trọng tâm chính trị đã chuyển xuống mạn dưới, ở Vị Hoàng (Nam Định).\n\nCũng trong thế kỷ XVIII, nhiều biến động xã hội - chính trị đã diễn ra tại địa bàn Phố Hiến. Năm 1730, đê Mạn Trù vỡ, dân của nhiều vùng ở Sơn Nam trở nên nghèo đói, phải tha phương cầu thực. Tiếp đến là những cuộc khởi nghĩa của Hoàng Công Chất và Nguyễn Hữu Cầu đã tàn phá vùng này, càng làm cho tiềm lực kinh tế của Phố Hiến kiệt quệ. Rồi sau đó là cuộc chiến giữa Tây Sơn và chúa Trịnh. Sang đến thế kỷ XIX, dưới triều Nguyễn, vai trò một đô thị kinh tế, một thương cảng quốc tế của Phố Hiến ngày nào giờ đây không còn nữa. Năm 1804, dưới thời Gia Long, trấn lị Sơn Nam thượng từ Phố Hiến đã được di chuyển về Châu Cầu (Phủ Lý). Năm 1831, với cuộc cải cách của vua Minh mạng, tỉnh Hưng Yên được thành lập, thành tỉnh được xây dựng trên địa bàn Phố Hiến cũ, mang nhiều chức năng quân sự, nhưng đã mất đi hoàn toàn vai trò kinh tế của một trạm hải quan, lúc này đã được chuyển qua bến Ninh Hải (Hải Phòng).",
        "title": "Phát triển và suy thoái"
      }
    ]
  },
  {
    "name": "Cát Tiên",
    "location": "Huyện Cát Tiên, tỉnh Lâm Đồng[68]",
    "types": "Di tích khảo cố[68]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1nh_%C4%91%E1%BB%8Ba_C%C3%A1t_Ti%C3%AAn",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Thánh địa Cát Tiên là tên gọi quần thể di chỉ khảo cổ được phát hiện từ năm 1985, nằm trong một bồn địa rộng hàng trăm hecta và trải trên chiều dài khoảng 15 km dọc theo hệ thống sông Đạ Đường và Đồng Nai, bao gồm rất nhiều gò đồi và bãi bồi ven sông được bao bọc bởi dãy núi cuối cùng của Trường Sơn Nam. Toàn bộ khu di tích này thuộc địa phận kéo dài từ xã Quảng Ngãi đến xã Đức Phổ, trong đó mật độ di chỉ khảo cổ tập trung dày đặc ở khu vực xã Quảng Ngãi thuộc huyện Đạ Huoai của tỉnh Lâm Đồng, khu vực Nam Tây Nguyên.",
    "events": []
  },
  {
    "name": "Đền thờ Nguyễn Bỉnh Khiêm",
    "location": "Huyện Vĩnh Bảo, thành phố Hải Phòng",
    "types": "Di tích lịch sử[69]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_t%C3%ADch_Tr%E1%BA%A1ng_Tr%C3%ACnh_Nguy%E1%BB%85n_B%E1%BB%89nh_Khi%C3%AAm",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Nh%C3%A0_d%E1%BA%A1y_h%E1%BB%8Dc.jpg/180px-Nh%C3%A0_d%E1%BA%A1y_h%E1%BB%8Dc.jpg",
    "description": "Khu di tích Trạng Trình Nguyễn Bỉnh Khiêm là các công trình kiến trúc – văn hóa gắn với cuộc đời và sự nghiệp của Trình quốc công Nguyễn Bỉnh Khiêm[1][2] ngay tại quê nội của ông là xã Lý Học, huyện Vĩnh Bảo, thành phố Hải Phòng. Khu di tích này là nơi có những địa dấu nổi tiếng đã đi vào sự nghiệp thơ văn của Nguyễn Bỉnh Khiêm như Trung Tân quán và Bạch Vân am (từ đó mà ông có danh xưng Bạch Vân am cư sĩ). Ngày 7 tháng 1 năm 2016 (tức ngày 28 tháng 11 năm Ất Mùi), tại Khu di tích Trình quốc công Nguyễn Bỉnh Khiêm thuộc xã Lý Học, huyện Vĩnh Bảo, UBND Thành phố Hải Phòng đã trọng thể kỷ niệm 430 năm ngày mất của ông và đón nhận bằng xếp hạng Di tích quốc gia đặc biệt do Chính phủ trao tặng. Đây là di tích quốc gia đặc biệt thứ hai của Hải Phòng sau danh lam thắng cảnh quần đảo Cát Bà được xếp hạng vào năm 2013.[3]",
    "events": []
  },
  {
    "name": "Đền Trần Thương",
    "location": "Huyện Lý Nhân, tỉnh Hà Nam",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[70]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Tr%E1%BA%A7n_Th%C6%B0%C6%A1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/%C4%90%E1%BB%81n_Tr%E1%BA%A7n_Th%C6%B0%C6%A1ng.jpg/180px-%C4%90%E1%BB%81n_Tr%E1%BA%A7n_Th%C6%B0%C6%A1ng.jpg",
    "description": "Đền Trần Thương (hay Đền Trần, Đền thờ Đức Thánh Trần) là một ngôi đền thờ Trần Hưng Đạo được dựng lên ngay trên phần đất khi xưa ông dùng làm kho lương phục vụ cuộc kháng chiến chống quân Nguyên - Mông lần 2 (1285). Trong đền có giếng Ngọc, là nơi táng xương cốt của Trần Hưng Đạo khi ông qua đời. Đền Trần Thương nằm bên bờ sông Hồng, tọa lạc tại thôn Trần Thương, xã Trần Hưng Đạo, huyện Lý Nhân, tỉnh Hà Nam, Việt Nam.",
    "events": []
  },
  {
    "name": "Tháp Bình Sơn",
    "location": "Huyện Sông Lô, tỉnh Vĩnh Phúc",
    "types": "Di tích kiến trúc nghệ thuật[71]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_B%C3%ACnh_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Binh_Son_tower_2.jpg/250px-Binh_Son_tower_2.jpg",
    "description": "Tháp Bình Sơn, còn gọi là Tháp chùa Vĩnh Khánh hay Tháp Then, là một ngôi tháp cổ, tương truyền nguyên thủy có 13 tầng tuy hiện nay chỉ còn lại 11 tầng. Tháp được xây dựng từ thời Trần, nằm ở trong khuôn viên chùa Vĩnh Khánh (chùa Then) thuộc thôn Bình Sơn, thị trấn Tam Sơn huyện Sông Lô, tỉnh Vĩnh Phúc.",
    "events": []
  },
  {
    "name": "Tây Thiên - Tam Đảo",
    "location": "Huyện Tam Đảo, tỉnh Vĩnh Phúc",
    "types": "Di tích lịch sử, danh lam thắng cảnh[72]",
    "detailLink": "https://vi.wikipedia.org/wiki/Tam_%C4%90%E1%BA%A3o",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/TrucLam.JPG/250px-TrucLam.JPG",
    "description": "Tam Đảo là một dãy núi đá ở vùng Đồng bằng Bắc Bộ Việt Nam, nằm trên địa bàn thành phố Hà Nội và ba tỉnh Vĩnh Phúc, Thái Nguyên, Tuyên Quang. Đỉnh cao nhất của dãy núi Tam Đảo nằm ở ranh giới của huyện Tam Đảo (Vĩnh Phúc) và huyện Đại Từ (Thái Nguyên), có độ cao tuyệt đối là 1.597 m.",
    "events": []
  },
  {
    "name": "Căn cứ Bộ chỉ huy Quân giải phóng miền Nam Việt Nam",
    "location": "Huyện Lộc Ninh, tỉnh Bình Phước",
    "types": "Di tích lịch sử[73]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:2-73",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Chùa Vĩnh Nghiêm",
    "location": "Thành phố Bắc Giang, tỉnh Bắc Giang 21°12′53″B 106°19′25″Đ",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[74]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_V%C4%A9nh_Nghi%C3%AAm_(B%E1%BA%AFc_Giang)",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Ch%C3%B9a_V%C4%A9nh_Nghi%C3%AAm_-_Y%C3%AAn_D%C5%A9ng_-_B%E1%BA%AFc_Giang_-_panoramio_%2824%29.jpg/250px-Ch%C3%B9a_V%C4%A9nh_Nghi%C3%AAm_-_Y%C3%AAn_D%C5%A9ng_-_B%E1%BA%AFc_Giang_-_panoramio_%2824%29.jpg",
    "description": "Chùa Vĩnh Nghiêm, còn được gọi là chùa Đức La, là một ngôi chùa cổ tại làng Đức La, xã Trí Yên, thành phố Bắc Giang, tỉnh Bắc Giang, Việt Nam. Chùa được công nhận là một trung tâm Phật giáo, nơi đào tạo tăng đồ cho cả nước, nơi phát tích Tam Tổ phái Thiền Trúc Lâm của Phật giáo Việt Nam. Năm 2015, chùa được công nhận là Di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Địa đạo Củ Chi",
    "location": "Huyện Củ Chi, Thành phố Hồ Chí Minh",
    "types": "Di tích lịch sử[75]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%8Ba_%C4%91%E1%BA%A1o_C%E1%BB%A7_Chi",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/VietnamCuChiTunnels.jpg/250px-VietnamCuChiTunnels.jpg",
    "description": "Địa đạo Củ Chi là một hệ thống phòng thủ trong lòng đất ở huyện Củ Chi, cách trung tâm Thành phố Hồ Chí Minh 69 km về hướng Tây-Bắc. Hệ thống này được quân kháng chiến Việt Minh và Mặt trận Dân tộc Giải phóng miền Nam Việt Nam đào trong thời kỳ Chiến tranh Đông Dương và Chiến tranh Việt Nam. Hệ thống địa đạo bao gồm bệnh xá, nhiều phòng ở, nhà bếp, kho chứa, phòng làm việc, hệ thống đường ngầm dưới lòng đất, dài khoảng 250 km và có các hệ thống thông hơi tại vị trí các bụi cây. Địa đạo Củ Chi được xây dựng ở điểm cuối Đường mòn Hồ Chí Minh, trên vùng đất được mệnh danh là \"đất thép\" để ca ngợi ý chí phòng thủ kiên cường của quân dân nơi đây. Trong Chiến dịch Tết Mậu Thân 1968, quân Giải phóng miền Nam đã xuất phát từ hệ thống địa đạo này để tấn công vào trung tâm Sài Gòn.",
    "events": []
  },
  {
    "name": "Tháp Chăm Dương Long",
    "location": "Huyện Tây Sơn, tỉnh Bình Định",
    "types": "Di tích kiến trúc nghệ thuật[76]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_D%C6%B0%C6%A1ng_Long",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Th%C3%A1p_D%C6%B0%C6%A1ng_Long.JPG/180px-Th%C3%A1p_D%C6%B0%C6%A1ng_Long.JPG",
    "description": "Tháp Dương Long là cụm di tích gồm ba tháp Chăm thẳng hàng trên một gò cao thuộc huyện Tây Sơn, tỉnh Bình Định.",
    "events": []
  },
  {
    "name": "Hang Con Moong và các di tích phụ cận",
    "location": "Huyện Thạch Thành, tỉnh Thanh Hóa",
    "types": "Di tích khảo cổ[77]",
    "detailLink": "https://vi.wikipedia.org/wiki/Hang_Con_Moong",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Hang Con Moong (theo tiếng địa phương có nghĩa là \"hang con thú\"[1]) là một hang đá trong Vườn quốc gia Cúc Phương. Tuy Vườn quốc gia Cúc Phương phần lớn thuộc tỉnh Ninh Bình nhưng hang Con Moong lại thuộc xã Thành Yên, huyện Thạch Thành, tỉnh Thanh Hóa. Ngày 23/11/2016, hang Con Moong và các di tích phụ cận đã được công nhận là Di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Mộ cự thạch Hàng Gòn",
    "location": "Thành phố Long Khánh, tỉnh Đồng Nai",
    "types": "Di tích khảo cổ[78]",
    "detailLink": "https://vi.wikipedia.org/wiki/M%E1%BB%99_c%E1%BB%B1_th%E1%BA%A1ch_H%C3%A0ng_G%C3%B2n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Mộ cự thạch Hàng Gòn (còn được gọi là Di chỉ Hàng Gòn 7, Mộ Đông Dương, Mả Ông Đá) là một di tích khảo cổ tại xã Hàng Gòn, thành phố Long Khánh, tỉnh Đồng Nai, Việt Nam[1]. Đây là một ngôi mộ cổ được phát hiện và khai quật từ năm 1927, thuộc loại hình mộ táng Dolmen độc đáo trong hệ thống di chỉ khảo cổ học ở Việt Nam.[2][3]",
    "events": []
  },
  {
    "name": "Khởi nghĩa Bắc Sơn",
    "location": "Huyện Bắc Sơn, tỉnh Lạng Sơn",
    "types": "Di tích lịch sử[79]",
    "detailLink": "https://vi.wikipedia.org/wiki/Kh%E1%BB%9Fi_ngh%C4%A9a_B%E1%BA%AFc_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Khởi nghĩa Bắc Sơn - Trong thời kỳ Chiến tranh thế giới thứ hai, vào tháng 6 năm 1940, nước Pháp bị quân đội Đức Quốc xã xâm lược và chiếm đóng. Nhân cơ hội này, tháng 9 năm đó, đế quốc Nhật Bản xâm lược bán đảo Đông Dương từ tay Pháp. Từ đây, Việt Nam bị hai thế lực cùng thống trị là thực dân Pháp và phát xít Nhật. Khởi nghĩa Bắc Sơn là một cuộc khởi nghĩa của người Việt chống lại thực dân Pháp và phát xít Nhật diễn ra tại Bắc Sơn, Lạng Sơn vào năm 1940. Quân Nhật đánh vào Lạng Sơn ngày 22 tháng 9 năm 1940, quân đội Pháp trên đường thua chạy đã rút lui qua châu Bắc Sơn. Nhân cơ hội đó, Đảng bộ Bắc Sơn thuộc Đảng Cộng sản Đông Dương đã lãnh đạo người dân nổi dậy tước khí giới của tàn quân Pháp để tự vũ trang cho mình, giải tán chính quyền địch, thành lập chính quyền cách mạng (27-9-1940). Nhưng sau đó Nhật thỏa hiệp với Pháp để quay trở lại đàn áp phong trào khởi nghĩa.",
    "events": []
  },
  {
    "name": "Địa điểm diễn ra Đại hội Đại biểu toàn quốc lần thứ II của Đảng",
    "location": "Huyện Chiêm Hóa, tỉnh Tuyên Quang",
    "types": "Di tích lịch sử[80]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:6-80",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "An toàn khu (ATK) Chợ Đồn",
    "location": "Huyện Chợ Đồn, tỉnh Bắc Kạn",
    "types": "Di tích lịch sử[81]",
    "detailLink": "https://vi.wikipedia.org/wiki/ATK",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "ATK, viết tắt của an toàn khu, là khu vực mà Quân đội nhân dân Việt Nam giành được quyền kiểm soát gần như tuyệt đối trong thời gian chiến tranh chống Pháp, Nhật, Mỹ. ATK có 2 cấp: xã An toàn khu và vùng An toàn khu.",
    "events": []
  },
  {
    "name": "Chùa Bổ Đà",
    "location": "Thị xã Việt Yên, tỉnh Bắc Giang",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[82]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_B%E1%BB%95_%C4%90%C3%A0",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/NNU_Ch%C3%B9ab%E1%BB%95%C4%91%C3%A0.jpg/250px-NNU_Ch%C3%B9ab%E1%BB%95%C4%91%C3%A0.jpg",
    "description": "Chùa Bổ Đà, còn được gọi là chùa Bổ, chùa Tam Giáo,[1] còn có tên chữ là Tứ Ân tự (四恩寺) là một ngôi chùa toạ lạc trên ngọn núi Phượng Hoàng (Bổ Đà sơn), bờ tả dòng sông Cầu, thuộc địa phận thôn Thượng Lát, xã Tiên Sơn, huyện Việt Yên, tỉnh Bắc Giang (thời phong kiến là xã Tiên Lát, tổng Tiên Lát, huyện Yên Việt, phủ Bắc Hà, trấn Kinh Bắc xưa). Chùa nằm cách trung tâm thị trấn Bích Động khoảng 10 km về phía Tây, Chùa Bổ Đà là một trong những ngôi chùa độc đáo nhất vùng đất Kinh Bắc, là trung tâm Phật giáo lớn của dòng thiền Trúc Lâm Yên Tử. Chùa đã được công nhận là Di tích quốc gia đặc biệt năm 2016 và bộ kinh phật khắc trên gỗ thị lưu giữ trong chùa được đánh giá là cổ nhất của dòng thiền Lâm Tế,...",
    "events": []
  },
  {
    "name": "Quần thể An Phụ - Kính Chủ - Nhẫm Dương",
    "location": "Thị xã Kinh Môn, tỉnh Hải Dương",
    "types": "Di tích lịch sử, danh lam thắng cảnh[83]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:9-83",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Tuong_dai_THD.jpg/250px-Tuong_dai_THD.jpg",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Chùa Keo Hành Thiện",
    "location": "Huyện Xuân Trường, tỉnh Nam Định 20°20′32″B 106°19′18″Đ",
    "types": "Di tích kiến trúc nghệ thuật[84]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Keo_H%C3%A0nh_Thi%E1%BB%87n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/GacchuongChuaKeoHT.jpg/180px-GacchuongChuaKeoHT.jpg",
    "description": "Chùa Keo (tên chữ: Thần Quang tự 神光寺) là một ngôi chùa ở làng Hành Thiện, xã Xuân Hồng, huyện Xuân Trường, tỉnh Nam Định, Việt Nam. Đây là một trong những ngôi chùa cổ ở Việt Nam được bảo tồn hầu như còn nguyên vẹn kiến trúc 400 năm tuổi.[cần dẫn nguồn]",
    "events": []
  },
  {
    "name": "Khu lưu niệm Phan Bội Châu tại Nam Đàn",
    "location": "Huyện Nam Đàn, tỉnh Nghệ An",
    "types": "Di tích lịch sử[85]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:11-85",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Phật viện Đồng Dương",
    "location": "Huyện Thăng Bình, tỉnh Quảng Nam",
    "types": "Di tích khảo cổ, kiến trúc nghệ thuật[86]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ph%E1%BA%ADt_vi%E1%BB%87n_%C4%90%E1%BB%93ng_D%C6%B0%C6%A1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Th%C3%A1p_%C4%90%E1%BB%93ng_D%C6%B0%C6%A1ng_2.jpg/180px-Th%C3%A1p_%C4%90%E1%BB%93ng_D%C6%B0%C6%A1ng_2.jpg",
    "description": "Tháp Đồng Dương là một di tích quan trọng vào bậc nhất của Chăm Pa, gồm có hệ thống các tháp nằm gần nhau, nằm ở làng Đồng Dương, huyện Thăng Bình, tỉnh Quảng Nam. Tháp được xây dựng vào thời kỳ Chăm Pa còn bị ảnh hưởng của Phật giáo, nên có tính chất đặc biệt so với các tháp khác trong hệ thống tháp Chăm, nó được mệnh danh là tòa tu viện Phật giáo giữa đô thành. Hệ thống tháp Đồng Dương nằm ngay chính trung tâm đô thành Indrapura trong thời kỳ vương triều Indrapura.",
    "events": []
  },
  {
    "name": "Địa điểm Chiến thắng Đăk Tô-Tân Cảnh",
    "location": "Huyện Đăk Tô, tỉnh Kon Tum",
    "types": "Di tích lịch sử[87]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:13-87",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/T%C6%B0%E1%BB%A3ng_%C4%91%C3%A0i_Chi%E1%BA%BFn_th%E1%BA%AFng_%C4%90%C4%83k_T%C3%B4_-_T%C3%A2n_C%E1%BA%A3nh_%2840022454161%29.jpg/250px-T%C6%B0%E1%BB%A3ng_%C4%91%C3%A0i_Chi%E1%BA%BFn_th%E1%BA%AFng_%C4%90%C4%83k_T%C3%B4_-_T%C3%A2n_C%E1%BA%A3nh_%2840022454161%29.jpg",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Tháp Hòa Lai",
    "location": "Huyện Thuận Bắc, tỉnh Ninh Thuận",
    "types": "Di tích kiến trúc nghệ thuật, khảo cổ[88]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_H%C3%B2a_Lai",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Th%C3%A1p_H%C3%B2a_Lai%2C_Ninh_Thu%E1%BA%ADn.JPG/250px-Th%C3%A1p_H%C3%B2a_Lai%2C_Ninh_Thu%E1%BA%ADn.JPG",
    "description": "Tháp Hòa Lai là một trong những cụm tháp cổ Chăm Pa, gồm có ba tháp hiện nằm ở thôn Ba Tháp, xã Bắc Phong, huyện Thuận Bắc, tỉnh Ninh Thuận. Được đánh giá là một trong những di tích cổ nhất và đẹp nhất còn tồn tại.",
    "events": []
  },
  {
    "name": "Tháp Pô Klong Garai",
    "location": "Thành phố Phan Rang – Tháp Chàm, tỉnh Ninh Thuận",
    "types": "Di tích kiến trúc nghệ thuật[89]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_Po_Klong_Garai",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Po_Klong_Garai.jpg/250px-Po_Klong_Garai.jpg",
    "description": "Tháp Po Klong Garai là tên gọi chung cho một cụm tháp Chăm hùng vĩ và đẹp nhất còn lại ở Việt Nam, phụng thờ vua Po Klong Garai.[2] Tháp Pô Klong Garai là một tổng thể gồm ba tháp: tháp chính (cao 20,5m), tháp lửa (cao 9,31m), tháp cổng (cao 8,56m). Công trình này có trình độ kiến trúc, nghệ thuật, điêu khắc đạt đến đỉnh cao. Di tích kiến trúc nghệ thuật này được Bộ Văn hóa xếp hạng di tích di tích quốc gia năm 1979 và được Thủ tướng Chính phủ xếp hạng di tích quốc gia đặc biệt.[3]",
    "events": []
  },
  {
    "name": "Đồng Khởi Bến Tre",
    "location": "Huyện Mỏ Cày Nam, tỉnh Bến Tre",
    "types": "Di tích lịch sử[90]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:16-90",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Nha_truyen_thong_Dong_Khoi.JPG/180px-Nha_truyen_thong_Dong_Khoi.JPG",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Mộ và Khu tưởng niệm Nguyễn Đình Chiểu",
    "location": "Huyện Ba Tri, tỉnh Bến Tre",
    "types": "Di tích lịch sử[91]",
    "detailLink": "https://vi.wikipedia.org/wiki/L%C4%83ng_Nguy%E1%BB%85n_%C4%90%C3%ACnh_Chi%E1%BB%83u",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/M%E1%BB%99_Nguy%E1%BB%85n_%C4%90%C3%ACnh_Chi%E1%BB%83u_v%C3%A0_v%E1%BB%A3.jpg/250px-M%E1%BB%99_Nguy%E1%BB%85n_%C4%90%C3%ACnh_Chi%E1%BB%83u_v%C3%A0_v%E1%BB%A3.jpg",
    "description": "Lăng Nguyễn Đình Chiểu là nơi an táng và thờ nhà thơ Nguyễn Đình Chiểu, cùng với vợ ông là bà Lê Thị Điền và con gái là nữ sĩ Sương Nguyệt Anh. Khu di tích hiện thuộc ấp 3, xã An Đức, huyện Ba Tri, tỉnh Bến Tre, được Thủ tướng Chính phủ Việt Nam xếp hạng di tích quốc gia đặc biệt vào cuối năm 2016.[1][2]",
    "events": []
  },
  {
    "name": "Đền Cửa Ông",
    "location": "Thành phố Cẩm Phả và huyện Vân Đồn, tỉnh Quảng Ninh",
    "types": "Di tích lịch sử[92]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_C%E1%BB%ADa_%C3%94ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/C%E1%BB%ADa_%C3%94ng_Temple_2017.jpg/250px-C%E1%BB%ADa_%C3%94ng_Temple_2017.jpg",
    "description": "Đền Cửa Ông nằm tại phường Cửa Ông, thành phố Cẩm Phả, tỉnh Quảng Ninh. Đây là nơi thờ Hưng Nhượng Đại Vương Trần Quốc Tảng cùng nhiều nhân vật nổi tiếng thời nhà Trần, và cũng là nơi diễn ra Lễ hội đền Cửa Ông hằng năm. Cuối năm 2017, đền Cửa Ông được Chính phủ xếp hạng là Di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Văn miếu Mao Điền",
    "location": "Huyện Cẩm Giàng, tỉnh Hải Dương",
    "types": "Di tích lịch sử[93]",
    "detailLink": "https://vi.wikipedia.org/wiki/V%C4%83n_mi%E1%BA%BFu_Mao_%C4%90i%E1%BB%81n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/V%C4%83n_mi%E1%BA%BFu_Mao_%C4%90i%E1%BB%81n.jpg/180px-V%C4%83n_mi%E1%BA%BFu_Mao_%C4%90i%E1%BB%81n.jpg",
    "description": "Văn miếu Mao Điền thuộc làng Mậu Tài, xã Mao Điền, nay thuộc xã Cẩm Điền, huyện",
    "events": []
  },
  {
    "name": "Địa điểm khởi nghĩa Ba Tơ",
    "location": "Huyện Ba Tơ, tỉnh Quảng Ngãi",
    "types": "Di tích lịch sử[94]",
    "detailLink": "https://vi.wikipedia.org/wiki/Kh%E1%BB%9Fi_ngh%C4%A9a_Ba_T%C6%A1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Khởi nghĩa Ba Tơ là cuộc nổi dậy giành chính quyền của quân dân châu Ba Tơ thuộc tỉnh Quảng Ngãi, nổ ra ngày 11 tháng 3 năm 1945, sau 2 ngày Nhật đảo chính Pháp ở Việt Nam.",
    "events": []
  },
  {
    "name": "Địa điểm Chiến thắng Biên giới năm 1950",
    "location": "Huyện Thạch An, tỉnh Cao Bằng",
    "types": "Di tích lịch sử[95]",
    "detailLink": "https://vi.wikipedia.org/wiki/Chi%E1%BA%BFn_d%E1%BB%8Bch_Bi%C3%AAn_gi%E1%BB%9Bi",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Pháp: 4.800 chết hoặc bị thương\n2.000 mất tích hoặc bị bắt\nQuốc gia Việt Nam: Hơn 1.000 chết hoặc bị thương, hơn 500 bị bắt",
    "events": []
  },
  {
    "name": "Chùa Đọi Sơn",
    "location": "Thị xã Duy Tiên, tỉnh Hà Nam",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[96]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_%C4%90%E1%BB%8Di_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Chùa Đọi Sơn là một ngôi chùa cổ tại Việt Nam. Chùa nằm trên đỉnh núi Đọi, hiện nay thuộc địa phận xã Tiên Sơn, thị xã Duy Tiên, tỉnh Hà Nam, cách Hà Nội 50 km về phía nam; cách thành phố Phủ Lý 10 km về phía đông bắc.",
    "events": []
  },
  {
    "name": "Đền Xưa - Chùa Giám - Đền Bia",
    "location": "Huyện Cẩm Giàng, tỉnh Hải Dương",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[97]",
    "detailLink": "https://vi.wikipedia.org/wiki/Di_t%C3%ADch_qu%E1%BB%91c_gia_%C4%91%E1%BA%B7c_bi%E1%BB%87t_(Vi%E1%BB%87t_Nam)#cite_note-:23-97",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Di tích là dấu vết của quá khứ còn lưu lại trong lòng đất hoặc trên mặt đất có ý nghĩa về mặt văn hóa và lịch sử\".[1] Ở Việt Nam, một di tích khi đủ các điều kiện sẽ được công nhận theo thứ tự: di tích cấp tỉnh, di tích cấp quốc gia và di tích quốc gia đặc biệt. Di tích quốc gia đặc biệt là những di tích Việt Nam có giá trị đặc biệt tiêu biểu của quốc gia. Di tích quốc gia đặc biệt do Thủ tướng Chính phủ quyết định xếp hạng trên cơ sở lựa chọn các di tích quan trọng đã được Bộ Văn hóa, Thể thao và Du lịch xếp hạng là di tích quốc gia, lần xếp hạng đầu tiên là vào năm 2009.",
    "events": []
  },
  {
    "name": "Thành Điện Hải",
    "location": "Quận Hải Châu, thành phố Đà Nẵng",
    "types": "Di tích lịch sử[98]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A0nh_%C4%90i%E1%BB%87n_H%E1%BA%A3i",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Dien_Hai_Citadel_Cannon_2.jpg/250px-Dien_Hai_Citadel_Cannon_2.jpg",
    "description": "Thành Điện Hải là một di tích quốc gia đặc biệt tọa lạc tại thành phố Đà Nẵng, Việt Nam. Tòa thành được xây dựng lần đầu vào năm Gia Long thứ 12 (năm 1813) với mục đích kiểm soát tàu thuyền và trấn giữ Đà Nẵng. Đến năm Minh Mạng thứ 4 (năm 1823), thành được di dời và xây dựng lại theo kiến trúc kiểu Vauban. Đây là thành lũy có vai trò vô cùng quan trọng góp phần đánh bại cuộc tấn công của thực dân Pháp vào Đà Nẵng những năm 1858–1860.[1]",
    "events": [
      {
        "description": "Vào thế kỷ XIX, Đà Nẵng là cửa ngõ của kinh thành Huế, là hải cảng quan trọng nhất ở miền Trung Việt Nam. Nhưng trước đó, từ thế kỷ XVI, cảng Đà Nẵng đã được thuyền buôn phương Tây chú ý, chính vì thế theo quy định của Triều đình Huế, cảng Đà Nẵng là cửa ngõ duy nhất để thông thương với bên ngoài, vừa để kiểm soát tàu thuyền nước ngoài, vừa tránh sự dòm ngó của người ngoại quốc đối với kinh đô. [2] \n\nVới vị trí quan trọng của thương cảng Đà Nẵng, khi vừa lên ngôi vào năm 1802, vua Gia Long (Triều Nguyễn) đã lo tổ chức canh phòng vùng đất này, bằng việc cho xây dựng nhiều đồn lũy ở bán đảo Sơn Trà và dọc hai bên bờ sông Hàn. Đến năm 1813 (năm Gia Long thứ 12), vua cho đắp, xây dựng đài Điện Hải bằng đất, nằm ở tả ngạn sông Hàn gần cửa biển Đà Nẵng. Đài được xây dựng với mục đích kiểm soát tàu thuyền và trấn giữ Đà Nẵng.[2]\n\nĐài Điện Hải ban đầu được đắp bằng đất và gần cửa biển nên bị nước và sóng biển xâm thực, gây nguy cơ sụp đổ. Vào năm Minh Mạng thứ 4 (năm 1823), đài Điện Hải được dời vào bên trong đất liền, được xây dựng kiên cố bằng gạch trên một gò đất cao nằm ở tả ngạn sông Hàn, về phía tây, tại vùng Tràm Trẹm thuộc phường Thạch Thang (địa điểm của di tích ngày nay). Đài này được người Pháp gọi là Fort de l’,Ouest (Pháo đài phía Tây) để phân biệt với đài An Hải - Fort de l’,Est (Pháo đài phía Đông). Đến năm Minh Mạng thứ 15 (1835) được đổi tên là Thành Điện Hải và được dùng cho đến ngày nay. Tòa thành được tiếp tục xây dựng và củng cố vào năm Thiệu Trị thứ 7 (năm 1847). Trong thời kỳ này, Thành Điện Hải là một trong những công trình phòng thủ quan trọng nhất ở Đà Nẵng cùng với Thành An Hải bên kia tả ngạn sông Hàn kiểm soát tàu thuyền vào ra ở cửa biển Đà Nẵng.[3]\n\nNgày 1 tháng 8 năm 1858, liên quân Pháp-Tây Ban Nha đã mở màn cho cuộc chiến tranh Pháp-Việt bằng việc khai hỏa tấn công Đà Nẵng, khởi đầu cho một cuộc chiến kéo dài 26 năm từ 1858 đến 1884. Thành Điện Hải, trong thời gian đó, đã chịu nhiều đợt tấn công dữ dội từ phía quân địch. Đây là nơi diễn ra những cuộc giằng co đẫm máu giữa quân đội Nhà Nguyễn và liên quân Pháp-Tây Ban Nha trong buổi đầu của cuộc kháng chiến chống thực dân Pháp xâm lược.",
        "title": "Giai đoạn thời Nhà Nguyễn"
      },
      {
        "description": "Năm 1885, thực dân Pháp chiếm nước ta thành thuộc địa. Đến năm 1888, Toàn quyền Đông Dương Richaud đã gây sức ép, buộc Triều đình Huế nhượng Đà Nẵng cho Pháp. Dưới sức ép nặng nề từ Pháp, ngày 27 tháng 8 năm Mậu Tý (3-10-1888) vua Đồng Khánh đã ký một đạo dụ gồm 3 khoản, trong đó có khoản nhượng chủ quyền Đà Nẵng cho Pháp để thành lập thành phố Tourane (Đà Nẵng). Nơi đây trở thành nhượng địa của Pháp.\n\nTừ năm 1888, quân đội Pháp đã sử dụng Thành Điện Hải để xây dựng Bệnh viện quân y (Hôpital militaire), nhằm chữa bệnh cho sĩ quan và binh lính Pháp tại khu vực Trung Kỳ. Trong quá trình xây dựng, người Pháp đã phá hủy hoàn toàn các công trình có cấu trúc bằng gỗ lợp ngói trong khuôn viên Thành Điện Hải, chỉ giữ lại các tường thành bằng gạch và các hào bao quanh. Ngoài ra, người Pháp còn đặt thêm một cống ngầm dẫn nước thải của bệnh viện đổ ra sông Hàn ở phía Đông. Đến năm 1900, tướng Pháp Borgnis Desbordes, Tổng chỉ huy quân đội ở Đông Dương, đã tài trợ cho bệnh viện xây dựng một nhà nguyện với tháp cao ở pháo đài Đông Bắc, bên trái phía trước bệnh viện.[3]",
        "title": "Giai đoạn Pháp thuộc"
      },
      {
        "description": "Sau Hiệp định Genève 1954, quân đội Pháp phải rút khỏi Đông Dương, nước ta tạm chia làm hai miền. Tại miền Bắc, quân Pháp rút khỏi Hà Nội và Hải Phòng, vì vậy người Pháp phải đưa các trường Pháp ở ngoài Bắc vào Đà Nẵng, thành lập nên Lycée française de Tourane (Trường Trung học Pháp Đà Nẵng) và sử dụng bệnh viện của quân đội Pháp trong khuôn viên tòa thành làm trụ sở của trường. Về sau, trường này đổi tên thành Lycée Blaise Pascal (Trường Trung học Blaise Pascal). \n\nTrong thời kỳ chính phủ Bảo Đại, ngôi trường này đã được chuyển giao cho chính quyền Việt Nam, và chuyển đổi sang chương trình giáo dục bằng tiếng Việt, với cái tên mới là Trường Trung học Nguyễn Hiền. Để đáp ứng nhu cầu học tập, một dãy nhà đã được xây dựng bên ngoài Thành Điện Hải để làm phòng học cho học sinh.[3]",
        "title": "Giai đoạn Chiến tranh Đông Dương"
      },
      {
        "description": "Vào đầu năm 1974, chính quyền Sài Gòn đã quyết định thành lập Đại học Cộng đồng Quảng Đà, lấy Trường Trung học Nguyễn Hiền trong khuôn viên Thành Điện Hải làm cơ sở giảng dạy. Tại đây, Hiệu trưởng Ngô Đồng, một nhân viên của tổ chức tình báo Mỹ đã thiết lập lực lượng tử thủ tại Đà Nẵng, nhằm chống lại cách mạng đến cùng trong trường hợp quân giải phóng tiến vào Đà Nẵng. Tuy nhiên, vào ngày 22 tháng 3 năm 1975, Tướng Ngô Quang Trưởng của Việt Nam Cộng hòa đã thông báo cho Ngô Đồng rằng Đà Nẵng sắp không còn được bảo vệ và khuyên ông di tản trường đến Cam Ranh. Vào ngày 29 tháng 3 năm 1975, thành phố Đà Nẵng đuợc giải phóng, đánh dấu sự kết thúc của Đại học Cộng đồng Quảng Đà cũng như lực lượng tử thủ Đà Nẵng do chính quyền Việt Nam Cộng hòa thiết lập.[3]",
        "title": "Giai đoạn Chiến tranh Việt Nam"
      },
      {
        "description": "Năm 1981, Uỷ ban Nhân dân tỉnh Quảng Nam – Đà Nẵng quyết định sát nhập Xí nghiệp Dược, trạm nghiên cứu Dược liệu, và Công ty dược phẩm trong tỉnh để thành lập Xí nghiệp Liên hiệp Dược Quảng Nam – Đà Nẵng đặt tại Thành Điện Hải. Đến năm 1985, xí nghiệp mở rộng sản xuất, xây dựng mới hai dãy nhà ba tầng, đồng thời cải tạo các công trình cũ do Pháp để lại bên trong thành. Năm 1986, trước sân xí nghiệp, tượng đài danh tướng Nguyễn Tri Phương do nhà điêu khắc Lê Thị Kim Hằng thực hiện đã được dựng lên, tạo thêm dấu ấn lịch sử và văn hóa cho khu vực. \n\nQua thời gian, Thành Điện Hải đã trải qua nhiều biến cố và sự thay đổi. Hiện tại, di tích này chỉ còn lại hai lớp tường thành vững chãi và hệ thống hào rãnh bao quanh. Những dấu tích của các công trình kiến trúc bên trong hầu hết đã bị xóa sổ hoàn toàn do sự tàn phá của chiến tranh và những cải tạo không đồng nhất từ các chủ nhân sử dụng qua các thời kỳ.\n\nNăm 2005, để bảo tồn giá trị lịch sử và văn hóa của Thành Điện Hải, chính quyền thành phố Đà Nẵng quyết định di dời Xí nghiệp Dược đến một vị trí khác và cho xây dựng Bảo tàng Đà Nẵng ngay trong khuôn viên của thành. Bảo tàng này không chỉ là nơi lưu giữ hiện vật quý giá mà còn là điểm đến cho những ai muốn tìm hiểu về lịch sử phong phú của thành phố và vùng đất Quảng Nam - Đà Nẵng. Hiện nay, di tích Thành Điện Hải nằm trong một vùng tứ giác được bao quanh bởi các con đường Trần Phú ở phía Đông, đường Nguyễn Chí Thanh ở phía Tây, đường Lý Tự Trọng ở phía Bắc và đường Quang Trung ở phía Nam thuộc phường Thạch Thang, quận Hải Châu, thành phố Đà Nẵng.[3]",
        "title": "Giai đoạn từ năm 1975 đến nay"
      }
    ]
  },
  {
    "name": "Quần thể Hương Sơn (Chùa Hương)",
    "location": "Huyện Mỹ Đức, thành phố Hà Nội",
    "types": "Di tích lịch sử, danh lam thắng cảnh[99]",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_H%C6%B0%C6%A1ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Tam_quan_ch%C3%B9a_H%C6%B0%C6%A1ng.jpg/250px-Tam_quan_ch%C3%B9a_H%C6%B0%C6%A1ng.jpg",
    "description": "Chùa Hương (cách gọi dân gian) hay Hương Sơn là một quần thể văn hóa - tôn giáo của Việt Nam, gồm hàng chục ngôi chùa thờ Phật, các ngôi đền thờ Thần và các ngôi đình thờ tín ngưỡng nông nghiệp. Trung tâm của cụm đình đền chùa này là chùa Hương (tức chùa Trong) nằm trong động Hương Tích ở hữu ngạn sông Đáy, thuộc xã Hương Sơn, huyện Mỹ Đức, Hà Nội. Quần thể Hương Sơn là một trong 21 Khu du lịch Quốc gia của Việt Nam và là Di tích Quốc gia Đặc biệt theo quyết định 2082/QĐ-TTg năm 2017.[1]",
    "events": []
  },
  {
    "name": "Đình Hoành Sơn",
    "location": "Huyện Nam Đàn, tỉnh Nghệ An",
    "types": "Di tích kiến trúc nghệ thuật[100]",
    "detailLink": "https://vi.wikipedia.org/w/index.php?title=%C4%90%C3%ACnh_Ho%C3%A0nh_S%C6%A1n&action=edit&redlink=1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Trình soạn thảo sẽ tải bây giờ. Nếu một chốc nữa thông điệp này vẫn xuất hiện, xin hãy tải lại trang.",
    "events": []
  },
  {
    "name": "Đình Chèm",
    "location": "Quận Bắc Từ Liêm, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật[101]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_Ch%C3%A8m",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/%C4%90%C3%ACnh_Ch%C3%A8m_2_-_NKS.jpg/250px-%C4%90%C3%ACnh_Ch%C3%A8m_2_-_NKS.jpg",
    "description": "Đình Chèm là ngôi đình của làng Chèm (tên chữ là Thụy Phương), nay thuộc phường Thụy Phương, quận Bắc Từ Liêm, Hà Nội. Đình thờ Thượng đẳng Thiên vương Lý Ông Trọng (Lý Thân hay Đức Thánh Chèm), một nhân vật huyền thoại và Hoàng phi Bạch Tĩnh Cung sống vào thời An Dương Vương. Đình Chèm là một trong những ngôi đình được xem là cổ nhất nước và là một công trình kiến trúc có nghệ thuật chạm khắc độc đáo. Từ ngàn năm nay, đình Chèm vẫn là nơi thờ cúng tín ngưỡng của người dân ba làng: làng Hoàng, làng Mạc - (Liên Mạc) và làng Chèm - Thụy Phương, Từ Liêm, Hà Nội.",
    "events": []
  },
  {
    "name": "Tháp Nhạn",
    "location": "Thành phố Tuy Hòa, tỉnh Phú Yên",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_Nh%E1%BA%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Th%C3%A1p_Nh%E1%BA%A1n%2C_Tuy_H%C3%B2a%2C_Ph%C3%BA_Y%C3%AAn.JPG/180px-Th%C3%A1p_Nh%E1%BA%A1n%2C_Tuy_H%C3%B2a%2C_Ph%C3%BA_Y%C3%AAn.JPG",
    "description": "Tháp Nhạn trong tiếng Ê-Đê và Jarai gọi là Yang Kơ Hmeng là một tháp Champa nằm trên núi Nhạn, thắng cảnh tiêu biểu của Tuy Hòa, tỉnh lị của Phú Yên.",
    "events": []
  },
  {
    "name": "Chùa Thái Lạc",
    "location": "Huyện Văn Lâm, tỉnh Hưng Yên",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Th%C3%A1i_L%E1%BA%A1c",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Chùa Thái Lạc ở xã Lạc Hồng, huyện Văn Lâm, tỉnh Hưng Yên. Chùa thuộc hệ thống chùa Tứ Pháp, thờ Phật và Pháp Vân. Chùa nổi tiếng vì có các bức chạm gõ từ đời Trần.",
    "events": []
  },
  {
    "name": "Đền thờ Lê Hoàn",
    "location": "Huyện Thọ Xuân, tỉnh Thanh Hóa",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_th%E1%BB%9D_L%C3%AA_Ho%C3%A0n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Đền thờ Lê Hoàn nằm ở làng Trung Lập, xã Xuân Lập, huyện Thọ Xuân, tỉnh Thanh Hóa, Việt Nam. Năm 2018, đền thờ Lê Hoàn được xếp hạng Di tích quốc gia đặc biệt. Trong đền còn lưu giữ nhiều đồ vật quý, đặc biệt có một đĩa bằng đá trắng, đường kính 36 cm trong lòng đĩa ghi chữ: \"Giang Nam nhất phiến tuyết; Trác khí vạn niên trân\".",
    "events": []
  },
  {
    "name": "Đình Tường Phiêu",
    "location": "Huyện Phúc Thọ, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_T%C6%B0%E1%BB%9Dng_Phi%C3%AAu",
    "imageUrl": "",
    "description": "Đình Tường Phiêu (tên gọi khác là Đình Cả) là một ngôi đình có vị trí nằm ở xã Tích Giang, huyện Phúc Thọ, thành phố Hà Nội. Ngôi đình này được Thủ tướng Chính phủ Việt Nam quyết định xếp hạng và công nhận là di tích quốc gia đặc biệt vào năm 2020. Với nhiều giá trị văn hóa, lịch sử và mỹ thuật, đình Tường Phiêu thường được xem là công trình kiến trúc mang tính biểu tượng của xứ Đoài.",
    "events": []
  },
  {
    "name": "Đình Thổ Tang",
    "location": "Huyện Vĩnh Tường, tỉnh Vĩnh Phúc",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_Th%E1%BB%95_Tang",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Dinh_tho_tang.jpg/250px-Dinh_tho_tang.jpg",
    "description": "Đình Thổ Tang là ngôi đình của làng Thổ Tang, nay là thị trấn Thổ Tang, huyện Vĩnh Tường, tỉnh Vĩnh Phúc, Việt Nam.[1][2][3]",
    "events": []
  },
  {
    "name": "Đình So",
    "location": "Huyện Quốc Oai, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_So",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/%C4%90%C3%ACnh_So-C%E1%BB%99ng_Ho%C3%A0.jpg/180px-%C4%90%C3%ACnh_So-C%E1%BB%99ng_Ho%C3%A0.jpg",
    "description": "Đình So là một công trình kiến trúc đã được xếp hạng di tích quốc gia đặc biệt của Việt Nam. Là đình của làng So bao gồm toàn bộ xã Cộng Hòa và xã Tân Hòa (ngoại trừ thôn An Ninh và Thổ Ngoã) huyện Quốc Oai, thành phố Hà Nội, Việt Nam. Đây là một trong những ngôi đình đẹp nhất xứ Đoài, dân gian có câu \"Đẹp đình So - To đình Cấn\". Đình được xây dựng năm 1673 thờ Tam vị Đại Vương là tướng nhà Đinh có công giúp vua Đinh Tiên Hoàng - Đinh Bộ Lĩnh dẹp loạn 12 sứ quân.[3]",
    "events": []
  },
  {
    "name": "Gò Đống Đa",
    "location": "Quận Đống Đa, thành phố Hà Nội",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/G%C3%B2_%C4%90%E1%BB%91ng_%C4%90a",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Go_Dong_Da.JPG/250px-Go_Dong_Da.JPG",
    "description": "Gò Đống Đa là một gò đất và là một di tích nằm bên phố Tây Sơn, phường Quang Trung, quận Đống Đa, thành phố Hà Nội. Tại đây vào năm 1789, quân Tây Sơn đã đại phá và đánh thắng quân Thanh trong Trận Ngọc Hồi - Đống Đa.",
    "events": []
  },
  {
    "name": "Nhà đày Buôn Ma Thuột",
    "location": "Thành phố Buôn Ma Thuột, tỉnh Đắk Lắk",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/Nh%C3%A0_%C4%91%C3%A0y_Bu%C3%B4n_Ma_Thu%E1%BB%99t",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/vi/thumb/3/3c/To%C3%A0n_c%E1%BA%A3nh_nh%C3%A0_%C4%90%C3%A0y.jpg/250px-To%C3%A0n_c%E1%BA%A3nh_nh%C3%A0_%C4%90%C3%A0y.jpg",
    "description": "Nhà Đày Buôn Ma Thuột là một di tích lịch sử tại Đắk Lắk, Việt Nam với kết cấu là một di tích hệ thống nhà tù (nhà đày) cũ từ thời Pháp thuộc, hiện đang do Sở Văn hóa-Thể thao và Du lịch tỉnh Đắk Lắk quản lý. Trước đó, từ 1975 đến 1979 Nhà đày được giao cho Công an Đắk Lắk quản lý. Từ năm 1979, Nhà đày thuộc sự quản lý của Công ty Văn hoá - Thông tin Đắk Lắk. Ngày 10 tháng 7 năm 1980 Nhà đày được Bộ Văn hóa - Thông tin công nhận là di tích cấp quốc gia.",
    "events": []
  },
  {
    "name": "Ngũ Hành Sơn",
    "location": "Quận Ngũ Hành Sơn, thành phố Đà Nẵng",
    "types": "Danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/Ng%C5%A9_H%C3%A0nh_S%C6%A1n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Ngu_hanh_son_toan_canh.jpg/250px-Ngu_hanh_son_toan_canh.jpg",
    "description": "Ngũ Hành Sơn (chữ Hán: 五行山) là một danh thắng gồm 6 ngọn núi đá vôi nhô lên trên một bãi cát ven biển, trên một diện tích khoảng 2 km² nằm cách trung tâm thành phố Đà Nẵng, Việt Nam khoảng 8 km về phía Đông Nam, ngay trên tuyến đường Đà Nẵng - Hội An; nay thuộc phường Hòa Hải, quận Ngũ Hành Sơn, thành phố Đà Nẵng. Ngũ Hành Sơn gồm các ngọn núi: Mộc Sơn, Thủy Sơn (lớn, cao và đẹp nhất), Thổ Sơn, Kim Sơn và Hỏa Sơn (có hai ngọn là Dương Hỏa Sơn và Âm Hỏa Sơn).",
    "events": []
  },
  {
    "name": "Khu bảo tồn thiên nhiên Na Hang – Lâm Bình",
    "location": "Huyện Na Hang và huyện Lâm Bình, tỉnh Tuyên Quang",
    "types": "Danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_b%E1%BA%A3o_t%E1%BB%93n_thi%C3%AAn_nhi%C3%AAn_Na_Hang",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Cot_buoc_trau.jpg/250px-Cot_buoc_trau.jpg",
    "description": "Khu bảo tồn thiên nhiên Na Hang – Lâm Bình là một khu bảo tồn thiên nhiên nằm trên địa bàn hai huyện Na Hang và Lâm Bình thuộc tỉnh Tuyên Quang, Việt Nam.",
    "events": []
  },
  {
    "name": "Chi Lăng",
    "location": "Huyện Chi Lăng, tỉnh Lạng Sơn",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/%E1%BA%A2i_Chi_L%C4%83ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Chi_L%C4%83ng_1.jpg/180px-Chi_L%C4%83ng_1.jpg",
    "description": "Chi Lăng (支棱) là một cửa ải nổi tiếng trong lịch sử Việt Nam. Nơi đây vốn là một thung lũng có sông Thương chảy qua, trải dài gần 20 km từ sông Hóa đến xã Mai Sao, thuộc huyện Chi Lăng, tỉnh Lạng Sơn. Phía đông thung lũng là dãy núi đất Thái Họa – Bảo Đài, còn phía tây là dãy núi đá Cai Kinh.[1][2]",
    "events": []
  },
  {
    "name": "Địa điểm Chiến thắng Xương Giang",
    "location": "Thành phố Bắc Giang, tỉnh Bắc Giang",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A0nh_X%C6%B0%C6%A1ng_Giang",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Thành Xương Giang là một thành cổ hiện chỉ còn lại phế tích tại tỉnh Bắc Giang, Việt Nam. Đây là thành được nhà Minh xây dựng vào đầu thế kỷ XV sau khi xâm chiếm Đại Ngu. Thành tồn tại đến năm 1427 thì bị nghĩa quân Lam Sơn hạ trong trận Xương Giang.[1][2]",
    "events": []
  },
  {
    "name": "Núi Non Nước",
    "location": "Thành phố Hoa Lư, tỉnh Ninh Bình",
    "types": "Di tích lịch sử, danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/N%C3%BAi_Non_N%C6%B0%E1%BB%9Bc",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Huynonnuoc2.jpg/250px-Huynonnuoc2.jpg",
    "description": "Núi Non Nước (tên cổ là Dục Thúy Sơn), là một danh thắng nằm ở ngã ba sông, nơi sông Vân đổ vào sông Đáy, sát với cầu Ninh Bình trên tuyến đường sắt Bắc Nam. Núi là một tiền đồn nằm ở cửa ngõ phía đông thành phố Hoa Lư. Lối lên đỉnh Non Nước qua 72 bậc gạch đá, chia làm 5 cấp. Đỉnh núi tương đối bằng phẳng, cây cối xanh mát, có lầu đón gió rất thuận tiện nghỉ ngơi, giải trí cho khách tham quan. Núi Non Nước đã được xếp hạng là di tích lịch sử và thắng cảnh cấp quốc gia đặc biệt quan trọng của Việt Nam,[1] cùng với núi Cá Voi, núi Cánh Diều và núi Kỳ Lân được mệnh danh là Tứ đại danh sơn - tức bốn ngọn núi nổi tiếng ở trung tâm thành phố Hoa Lư.[2]",
    "events": []
  },
  {
    "name": "Sầm Sơn",
    "location": "Thành phố Sầm Sơn, tỉnh Thanh Hóa",
    "types": "Di tích lịch sử, danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/N%C3%BAi_Tr%C6%B0%E1%BB%9Dng_L%E1%BB%87",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Bi%E1%BB%83n_S%E1%BA%A7m_S%C6%A1n_n%C4%83m_1905..jpg/250px-Bi%E1%BB%83n_S%E1%BA%A7m_S%C6%A1n_n%C4%83m_1905..jpg",
    "description": "Núi Trường Lệ, còn được gọi là Sầm Sơn, Núi Sầm hay Núi Gầm,[1][2] là một dãy núi nằm ven biển phía nam thành phố Sầm Sơn, tỉnh Thanh Hóa. Dãy núi này hiện được bao phủ bởi một diện tích rừng đặc dụng, được đánh giá là có cảnh quan thiên nhiên đẹp và là khu vực đa dạng về sinh học. Trên núi có Hòn Trống Mái là một trong những thắng cảnh của tỉnh Thanh Hóa. Bên cạnh đó, nơi đây còn có một số ngôi đền cổ như Đền Độc Cước, Đền Cô Tiên và Đền Tô Hiến Thành.[3][4]",
    "events": []
  },
  {
    "name": "Ruộng bậc thang Mù Cang Chải",
    "location": "Huyện Mù Cang Chải, tỉnh Yên Bái",
    "types": "Danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/Ru%E1%BB%99ng_b%E1%BA%ADc_thang_M%C3%B9_Cang_Ch%E1%BA%A3i",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/S%C3%81NG_S%E1%BB%9AM_%E1%BB%9E_M%C3%99_CANG_CH%E1%BA%A2I_-_panoramio.jpg/250px-S%C3%81NG_S%E1%BB%9AM_%E1%BB%9E_M%C3%99_CANG_CH%E1%BA%A2I_-_panoramio.jpg",
    "description": "Ruộng bậc thang Mù Cang Chải là những ruộng bậc thang nằm trên các sườn núi, lớp nọ gối tiếp lớp kia với diện tích khoảng 2.200 ha ở huyện Mù Cang Chải, Yên Bái. Năm 2007, 330 ha diện tích ruộng bậc thang thuộc 3 xã La Pán Tẩn, Chế Cu Nha, Dế Xu Phình được xếp hạng là di tích quốc gia như là một trong những danh thắng độc đáo bậc nhất tại Việt Nam. Và đến năm 2019, danh thắng ruộng bậc thang Mù Cang Chải đã Thủ tướng Chính phủ xếp hạng là Di tích quốc gia đặc biệt[1].",
    "events": []
  },
  {
    "name": "Đình Đại Phùng",
    "location": "Huyện Đan Phượng, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_%C4%90%E1%BA%A1i_Ph%C3%B9ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Đình Đại Phùng là một ngôi đình có vị trí nằm ở xã Đan Phượng, huyện Đan Phượng, thành phố Hà Nội. Ngôi đình này được Thủ tướng Chính phủ Việt Nam quyết định xếp hạng và công nhận là di tích quốc gia đặc biệt vào năm 2020. Đình nổi tiếng được biết đến với nghệ thuật kiến trúc gỗ cổ được coi là kinh điển quý hiếm ở Việt Nam.[2]",
    "events": []
  },
  {
    "name": "Đền - Chùa - Đình Hai Bà Trưng",
    "location": "Quận Hai Bà Trưng, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_%C4%90%E1%BB%93ng_Nh%C3%A2n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Ch%C3%ADnh_%C4%91i%E1%BB%87n%2C_%C4%91%E1%BB%81n_Hai_B%C3%A0_Tr%C6%B0ng%2C_qu%E1%BA%ADn_Hai_B%C3%A0_Tr%C6%B0ng%2C_H%C3%A0_N%E1%BB%99i.jpg/250px-Ch%C3%ADnh_%C4%91i%E1%BB%87n%2C_%C4%91%E1%BB%81n_Hai_B%C3%A0_Tr%C6%B0ng%2C_qu%E1%BA%ADn_Hai_B%C3%A0_Tr%C6%B0ng%2C_H%C3%A0_N%E1%BB%99i.jpg",
    "description": "Đền Hai Bà Trưng, còn gọi là Đền Đồng Nhân, là một ngôi đền thờ Hai Bà Trưng tọa lạc tại phường Đồng Nhân, quận Hai Bà Trưng, thành phố Hà Nội. Hiện nay, đền Hai Bà Trưng nằm trên cùng một khuôn viên với hai di tích khác là chùa Viên Minh và đình Đồng Nhân, tạo thành Cụm di tích Đền – Chùa – Đình Hai Bà Trưng được Thủ tướng Chính phủ công nhận là di tích quốc gia đặc biệt vào ngày 31 tháng 12 năm 2019.[1][3]",
    "events": []
  },
  {
    "name": "Hệ thống di tích lưu niệm Chủ tịch Hồ Chí Minh tại Thừa Thiên Huế",
    "location": "Thành phố Huế, tỉnh Thừa Thiên Huế",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/w/index.php?title=H%E1%BB%87_th%E1%BB%91ng_di_t%C3%ADch_l%C6%B0u_ni%E1%BB%87m_Ch%E1%BB%A7_t%E1%BB%8Bch_H%E1%BB%93_Ch%C3%AD_Minh_t%E1%BA%A1i_Th%E1%BB%ABa_Thi%C3%AAn_Hu%E1%BA%BF&action=edit&redlink=1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Trình soạn thảo sẽ tải bây giờ. Nếu một chốc nữa thông điệp này vẫn xuất hiện, xin hãy tải lại trang.",
    "events": []
  },
  {
    "name": "An toàn khu II Hiệp Hòa",
    "location": "Huyện Hiệp Hòa, tỉnh Bắc Giang",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/An_to%C3%A0n_khu_II",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "ATK II (An toàn khu thứ hai) của Trung ương và Xứ ủy Bắc kỳ trong thời kỳ tiền khởi nghĩa là vùng đất gồm huyện Hiệp Hòa (Bắc Giang), huyện Phổ Yên và phần phía nam của huyện Phú Bình (Thái Nguyên). Nơi đây được Chính phủ Việt Nam xếp hạng Di tích quốc gia đặc biệt.",
    "events": []
  },
  {
    "name": "Căn cứ Cái Chanh",
    "location": "Huyện Hồng Dân, tỉnh Bạc Liêu",
    "types": "Di tích lịch sử",
    "detailLink": "https://vi.wikipedia.org/wiki/C%C4%83n_c%E1%BB%A9_C%C3%A1i_Chanh",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Căn cứ Cái Chanh là một di tích lịch sử quốc gia đặc biệt tại ấp Cây Cui, xã Ninh Thạnh Lợi, huyện Hồng Dân, tỉnh Bạc Liêu, Việt Nam.[1]",
    "events": []
  },
  {
    "name": "Đền An Xá",
    "location": "Huyện Tiên Lữ, tỉnh Hưng Yên",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_An_X%C3%A1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Đền An Xá, tên chữ là Thụy Ứng quán, còn được gọi là đền Đậu An, là ngôi đền thuộc thôn An Xá, xã An Viên, huyện Tiên Lữ, tỉnh Hưng Yên, Việt Nam. Đền được xây dựng trên một khu đất rộng, cao ráo, là nơi thờ Ngọc Hoàng Thượng Đế, Ngũ Lão Tiên Ông (những vị thần tiên của văn hóa Đạo giáo), cùng các vị Thiên tiên, Địa tiên tương truyền là những vị tiên giúp đỡ dân làng khai khẩn đất hoang, diệt trừ thú dữ, bảo vệ mùa màng.[1]",
    "events": []
  },
  {
    "name": "Đình Hạ Hiệp",
    "location": "Huyện Phúc Thọ, thành phố Hà Nội",
    "types": "Di tích kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_H%E1%BA%A1_Hi%E1%BB%87p",
    "imageUrl": "",
    "description": "Đình Hạ Hiệp là một ngôi đình có vị trí nằm ở xã Liên Hiệp, huyện Phúc Thọ, thành phố Hà Nội. Ngôi đình này được Thủ tướng Chính phủ Việt Nam quyết định xếp hạng và công nhận là di tích quốc gia đặc biệt vào năm 2020. Đình này còn có tên là đình Liên Hiệp hay đình Kẻ Hiệp.",
    "events": []
  },
  {
    "name": "Lăng mộ và Đền thờ Nguyễn Xí",
    "location": "Huyện Nghi Lộc, tỉnh Nghệ An",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật",
    "detailLink": "https://vi.wikipedia.org/wiki/Nguy%E1%BB%85n_X%C3%AD",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/%C4%90%E1%BB%81n_th%E1%BB%9D_Nguy%E1%BB%85n_X%C3%AD%2C_Nghi_H%E1%BB%A3p%2C_Nghi_L%E1%BB%99c%2C_Ngh%E1%BB%87_An_3.jpeg/180px-%C4%90%E1%BB%81n_th%E1%BB%9D_Nguy%E1%BB%85n_X%C3%AD%2C_Nghi_H%E1%BB%A3p%2C_Nghi_L%E1%BB%99c%2C_Ngh%E1%BB%87_An_3.jpeg",
    "description": "",
    "events": []
  },
  {
    "name": "Gành Đá Đĩa",
    "location": "Huyện Tuy An, tỉnh Phú Yên",
    "types": "Danh lam thắng cảnh",
    "detailLink": "https://vi.wikipedia.org/wiki/G%C3%A0nh_%C4%90%C3%A1_%C4%90%C4%A9a",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/G%C3%A0nh_%C4%90%C3%A1_%C4%90%C4%A9a.jpg/250px-G%C3%A0nh_%C4%90%C3%A1_%C4%90%C4%A9a.jpg",
    "description": "Gành Đá Đĩa hay Ghềnh Đá Đĩa là một danh thắng thiên nhiên tại xã An Ninh Đông, huyện Tuy An, tỉnh Phú Yên, Việt Nam.[1] Địa điểm này là một đoạn bờ biển có các cột đá bazan hình lăng trụ, trông giống như những chiếc đĩa xếp chồng lên nhau.[2]",
    "events": []
  },
  {
    "name": "Quần thể di tích Tây Sơn Thượng Đạo",
    "location": "Thị xã An Khê, huyện Đak Pơ, huyện Kbang và huyện Kông Chro, tỉnh Gia Lai",
    "types": "Di tích lịch sử[102]",
    "detailLink": "",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "",
    "events": []
  },
  {
    "name": "Khu lưu niệm Chủ tịch Hồ Chí Minh trên đảo Cô Tô",
    "location": "Huyện Cô Tô, tỉnh Quảng Ninh",
    "types": "Di tích lịch sử[103]",
    "detailLink": "",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "",
    "events": []
  },
  {
    "name": "Khu di tích lịch sử cách mạng Việt Nam - Lào",
    "location": "Huyện Yên Châu, tỉnh Sơn La",
    "types": "Di tích lịch sử[104]",
    "detailLink": "",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "",
    "events": []
  },
  {
    "name": "Thăng Long tứ trấn",
    "location": "Quận Ba Đình, quận Hoàn Kiếm và quận Đống Đa, thành phố Hà Nội",
    "types": "Di tích lịch sử, kiến trúc nghệ thuật[105]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C4%83ng_Long_t%E1%BB%A9_tr%E1%BA%A5n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Thăng Long tứ trấn là tên gọi chỉ 4 ngôi đền thiêng thờ 4 vị thần trấn giữ 4 vị trí huyết mạch phía đông, tây, nam, bắc của kinh thành Thăng Long xưa.[1] Bốn ngôi đền bao gồm:[2][3]",
    "events": []
  },
  {
    "name": "Rộc Tưng – Gò Đá",
    "location": "Thị xã An Khê, tỉnh Gia Lai",
    "types": "Di tích khảo cổ[106]",
    "detailLink": "",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "",
    "events": []
  },
  {
    "name": "Văn hóa Sa Huỳnh",
    "location": "Thị xã Đức Phổ, tỉnh Quảng Ngãi",
    "types": "Di tích khảo cổ[107]",
    "detailLink": "https://vi.wikipedia.org/wiki/Khu_di_ch%E1%BB%89_v%C4%83n_h%C3%B3a_Sa_Hu%E1%BB%B3nh",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/%C4%90%E1%BA%A7m_An_Kh%C3%AA.jpg/250px-%C4%90%E1%BA%A7m_An_Kh%C3%AA.jpg",
    "description": "Khu di chỉ văn hóa Sa Huỳnh là cụm di chỉ khảo cổ tại thị xã Đức Phổ, tỉnh Quảng Ngãi, nơi phát hiện ra nền văn hóa Sa Huỳnh. Cụm di chỉ này gồm các di chỉ Phú Khương, Thạnh Đức và Long Thạnh, nằm trên địa bàn phường Phổ Thạnh và xã Phổ Khánh.[1][2]",
    "events": []
  },
  {
    "name": "Cụm đình Hương Canh",
    "location": "Huyện Bình Xuyên, tỉnh Vĩnh Phúc",
    "types": "Di tích kiến trúc nghệ thuật[108]",
    "detailLink": "https://vi.wikipedia.org/wiki/H%C6%B0%C6%A1ng_Canh",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Hương Canh là thị trấn huyện lỵ của huyện Bình Xuyên, tỉnh Vĩnh Phúc, Việt Nam.",
    "events": []
  },
  {
    "name": "Đền thờ Vua Mai Hắc Đế",
    "location": "Huyện Nam Đàn, tỉnh Nghệ An",
    "types": "Di tích lịch sử[109]",
    "detailLink": "https://vi.wikipedia.org/wiki/Mai_H%E1%BA%AFc_%C4%90%E1%BA%BF",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Mai Hắc Đế (chữ Hán: 梅黑帝; 670 – 723), tên thật là Mai Thúc Loan (梅叔鸞),[1] là vị vua lãnh đạo cuộc khởi nghĩa chống lại sự chiếm đóng của nhà Đường ở miền Bắc Việt Nam vào đầu thế kỉ thứ 8.[2] Trong lịch sử Việt Nam, ông được xem như một vị anh hùng dân tộc.",
    "events": []
  },
  {
    "name": "Địa điểm Chiến thắng Ấp Bắc",
    "location": "Thị xã Cai Lậy, tỉnh Tiền Giang",
    "types": "Di tích lịch sử[110]",
    "detailLink": "https://vi.wikipedia.org/wiki/Tr%E1%BA%ADn_%E1%BA%A4p_B%E1%BA%AFc",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Ap_Bac_Victory_Tien_Giang.jpg/180px-Ap_Bac_Victory_Tien_Giang.jpg",
    "description": "",
    "events": []
  },
  {
    "name": "Thương cảng Vân Đồn",
    "location": "Huyện Vân Đồn, tỉnh Quảng Ninh",
    "types": "Di tích lịch sử[111]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C6%B0%C6%A1ng_c%E1%BA%A3ng_V%C3%A2n_%C4%90%E1%BB%93n",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Thương cảng Vân Đồn từng là một thương cảng của nước Đại Việt, tồn tại từ giữa thế kỷ 12 đến cuối thế kỷ 18 ở vùng biển nay thuộc tỉnh Quảng Ninh, Việt Nam. Đây là trung tâm giao thương lớn và quan trọng của Việt Nam lúc bấy giờ với nhiều thuyền buôn từ khắp châu Á và châu Âu đến buôn bán, trao đổi hàng hóa.[1][2]",
    "events": []
  },
  {
    "name": "Đình Trà Cổ",
    "location": "Thành phố Móng Cái, tỉnh Quảng Ninh",
    "types": "Di tích kiến trúc nghệ thuật[111]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_Tr%C3%A0_C%E1%BB%95",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/DinhTraCo.jpg/250px-DinhTraCo.jpg",
    "description": "Đình Trà Cổ nằm ở khu Nam Thọ, phường Trà Cổ, thành phố Móng Cái, tỉnh Quảng Ninh, Việt Nam. Đây được đánh giá là ngôi đình khá đồ sộ ở địa đầu đất nước và hoàn toàn mang dấu ấn nền văn hoá Việt[1]. Ngày 24/10/2023, đình đã được Thủ tướng chính phủ ký quyết định số 1225/QĐ-TTg xếp hạng Di tích Quốc gia Đặc biệt.[2]",
    "events": []
  },
  {
    "name": "Di tích khảo cổ Hang xóm Trại và Mái đá làng Vành",
    "location": "Huyện Lạc Sơn, tỉnh Hòa Bình",
    "types": "Di tích khảo cổ[112]",
    "detailLink": "https://vi.wikipedia.org/w/index.php?title=Di_t%C3%ADch_kh%E1%BA%A3o_c%E1%BB%95_Hang_x%C3%B3m_Tr%E1%BA%A1i_v%C3%A0_M%C3%A1i_%C4%91%C3%A1_l%C3%A0ng_V%C3%A0nh&action=edit&redlink=1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Natural_landmark_without_photo.svg/250px-Natural_landmark_without_photo.svg.png",
    "description": "Trình soạn thảo sẽ tải bây giờ. Nếu một chốc nữa thông điệp này vẫn xuất hiện, xin hãy tải lại trang.",
    "events": []
  },
  {
    "name": "Di tích khảo cổ Vĩnh Hưng",
    "location": "Huyện Vĩnh Lợi, tỉnh Bạc Liêu",
    "types": "Di tích khảo cổ[112]",
    "detailLink": "https://vi.wikipedia.org/wiki/Th%C3%A1p_V%C4%A9nh_H%C6%B0ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Vinh_Hung_tower%2C_Vinh_Loi%2C_Bac_Lieu.jpg/250px-Vinh_Hung_tower%2C_Vinh_Loi%2C_Bac_Lieu.jpg",
    "description": "Tháp Vĩnh Hưng là một di tích tọa lạc tại ấp Trung Hưng 1B, xã Vĩnh Hưng A, huyện Vĩnh Lợi, tỉnh Bạc Liêu[1][2]. Đây là một trong số các kiến trúc tháp thuộc nền văn hóa Óc Eo còn sót lại tại Nam Bộ Việt Nam.",
    "events": []
  },
  {
    "name": "Di tích lịch sử Các địa điểm khởi nghĩa Trương Định",
    "location": "Thành phố Gò Công, huyện Gò Công Đông và huyện Tân Phú Đông, tỉnh Tiền Giang.",
    "types": "Di tích lịch sử[112]",
    "detailLink": "https://vi.wikipedia.org/w/index.php?title=Di_t%C3%ADch_l%E1%BB%8Bch_s%E1%BB%AD_C%C3%A1c_%C4%91%E1%BB%8Ba_%C4%91i%E1%BB%83m_kh%E1%BB%9Fi_ngh%C4%A9a_Tr%C6%B0%C6%A1ng_%C4%90%E1%BB%8Bnh&action=edit&redlink=1",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/%C4%90%E1%BB%81n_v%C3%A0_m%E1%BB%99_Tr%C6%B0%C6%A1ng_%C4%90%E1%BB%8Bnh.JPG/250px-%C4%90%E1%BB%81n_v%C3%A0_m%E1%BB%99_Tr%C6%B0%C6%A1ng_%C4%90%E1%BB%8Bnh.JPG",
    "description": "Trình soạn thảo sẽ tải bây giờ. Nếu một chốc nữa thông điệp này vẫn xuất hiện, xin hãy tải lại trang.",
    "events": []
  },
  {
    "name": "Quần thể di tích đình, đền, chùa Tiên Lục",
    "location": "Huyện Lạng Giang, tỉnh Bắc Giang",
    "types": "Di tích kiến trúc nghệ thuật[113]",
    "detailLink": "",
    "imageUrl": "",
    "description": "",
    "events": []
  },
  {
    "name": "Đình Đình Bảng",
    "location": "Thành phố Từ Sơn, tỉnh Bắc Ninh",
    "types": "Di tích kiến trúc nghệ thuật[113]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C3%ACnh_%C4%90%C3%ACnh_B%E1%BA%A3ng",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gate_Dinh_Bang_communal_house.JPG/220px-Gate_Dinh_Bang_communal_house.JPG",
    "description": "Đình Đình Bảng, tên Nôm là đình Báng là một ngôi đình nằm ở làng Đình Bảng (xưa là làng Cổ Pháp hay tên Nôm là làng Báng), thành phố Từ Sơn, tỉnh Bắc Ninh. Đình được xây dựng vào đầu thế kỷ 18, thờ các vị thành hoàng gồm Cao Sơn đại vương (thần Núi), Thủy Bá đại vương (thần Nước) và Bách Lệ đại vương (thần Đất) đồng thời thờ sáu vị có công lập lại làng vào thế kỷ 15.",
    "events": []
  },
  {
    "name": "Khu di tích Đa Hòa - Dạ Trạch",
    "location": "Huyện Khoái Châu, tỉnh Hưng Yên",
    "types": "Di tích lịch sử - kiến trúc nghệ thuật[113]",
    "detailLink": "https://vi.wikipedia.org/wiki/D%E1%BA%A1_Tr%E1%BA%A1ch",
    "imageUrl": "",
    "description": "Dạ Trạch là một xã thuộc huyện Khoái Châu, tỉnh Hưng Yên, Việt Nam.",
    "events": [
      {
        "description": "Tên xã lấy từ tên của đầm Dạ Trạch xuất phát từ điển tích đầm một đêm (Nhất Dạ Trạch) của truyền thuyết Tiên Dung-Chử Đồng Tử trong dân gian.",
        "title": "Nguồn gốc tên gọi"
      },
      {
        "description": "Thế kỉ thứ VI, Triệu Quang Phục đã ém binh trong vùng đầm lầy Dạ Trạch, đêm đêm tiến ra đánh tỉa quân xâm lược nhà Lương.\n\nĐây còn là căn cứ của nghĩa quân Nguyễn Thiện Thuật trong phong trào Cần Vương chống thực dân Pháp xâm lược của vua Hàm Nghi.\n\nNgày 24 tháng 7 năm 1999, Chính phủ ban hành Nghị định số 60/1999/NĐ-CP[4] về việc chuyển xã Dạ Trạch thuộc huyện Châu Giang cũ chuyển về huyện Khoái Châu mới tái lập quản lý.",
        "title": "Lịch sử"
      }
    ]
  },
  {
    "name": "Mộ và Khu lưu niệm Lê Hữu Trác",
    "location": "Huyện Hương Sơn, tỉnh Hà Tĩnh",
    "types": "Di tích lịch sử[113]",
    "detailLink": "https://vi.wikipedia.org/wiki/L%C3%AA_H%E1%BB%AFu_Tr%C3%A1c",
    "imageUrl": "",
    "description": "Hải Thượng Lãn Ông (chữ Hán: 海上懶翁, 27 tháng 12 năm 1724 – 18 tháng 3 năm 1791), tên thật là Lê Hữu Trác (黎友晫) là một lang y, được coi là ông tổ của ngành y học cổ truyền Việt Nam.",
    "events": []
  },
  {
    "name": "Đường Hồ Chí Minh trên biển",
    "location": "Thành phố Hải Phòng, tỉnh Phú Yên, tỉnh Bà Rịa - Vũng Tàu, tỉnh Cà Mau",
    "types": "Di tích lịch sử[113]",
    "detailLink": "https://vi.wikipedia.org/wiki/%C4%90%C6%B0%E1%BB%9Dng_H%E1%BB%93_Ch%C3%AD_Minh_tr%C3%AAn_bi%E1%BB%83n",
    "imageUrl": "",
    "description": "Về các con đường khác cùng tên \"Đường Hồ Chí Minh\", xem Đường Hồ Chí Minh (định hướng).",
    "events": [
      {
        "description": "Trước sự phát triển của phong trào cách mạng miền Nam Việt Nam, năm 1959, Bộ Chính trị Việt Nam và Quân ủy Trung ương quyết định tổ chức nghiên cứu mở tuyến đường vận tải trên biển chi viện trực tiếp cho Quân Giải phóng miền Nam.\n\nTháng 7-1959, tiểu đoàn vận tải biển 603 được thành lập, đóng tại cửa biển sông Gianh- Quảng Bình với tên gọi là \"Tập đoàn đánh cá Sông Gianh\". Thuyền được nguỵ trang giống thuyền đánh cá của ngư dân miền Nam. Sau một thời gian tập luyện, thăm dò và chuẩn bị mọi mặt, đêm ba mươi Tết Canh Tý (ngày 27 tháng 1 năm 1960), chuyến tàu đặc biệt đầu tiên xuất phát, gồm 2 tàu và 6 người, do Nguyễn Bất chỉ huy đã đi chuyến vào Khu 5. Nhưng chuyến tàu bị gặp bão, thuyền bị hỏng nặng rồi lại gặp tàu tuần tra của địch, phải thả hàng xuống biển rồi rút lui.\n\nThời kỳ ban đầu, đoàn tàu gồm các tàu vận tải cỡ nhỏ để thâm nhập vào miền Nam, mặc dù có số hiệu đầy đủ, song để giữ bí mật, các tàu này không sơn số hiệu lên thân tàu. Vì thế, những con tàu này được biết đến với tên gọi chung là \"Đoàn tàu Không số\".\n\nTừ tháng 6 năm 1961 đến tháng 2 năm 1962, những người lãnh đạo của Mặt trận dân tộc giải phóng miền Nam Việt Nam ở các tỉnh Bến Tre, Cà Mau, Trà Vinh, Bà Rịa đã cử năm con thuyền gỗ từ miền Nam ra miền Bắc để báo cáo tình hình, xin tiếp tế vũ khí và sau đó trực tiếp vận chuyển vũ khí cũng như dẫn đường cho các tàu tiếp tế giả dạng tàu đánh cá từ Bắc vào Nam. Những người chỉ huy chủ chốt gồm các ông Phan Văn Nhờ (tức Tư Mau), bà Nguyễn Thị Định, ông Bông Văn Dĩa... Trong số 5 chiếc thuyền gỗ, chiếc thuyền của Bà Rịa đã bị lực lượng tuần duyên của Hải quân Việt Nam Cộng hòa chặn bắt tại ngoài khơi Cam Ranh. Không phát hiện thấy nghi ngờ, con thuyền này được trả tự do. Sau đó nó bị bão đánh trôi dạt đến đảo Hải Nam. Đây là chiếc thuyền do ông Dương Quang Đông, nguyên Ủy viên thường vụ Xứ ủy Nam Kỳ của Đảng Cộng sản Đông Dương trước năm 1945, nguyên là cán bộ hậu cần của Việt Minh tại Khu VIII trong Kháng chiến chống Pháp được giao nhiệm vụ mua sắm. Tuy nhiên, khi di chuyển đến Bà Rịa, ba người cũng đi với ông Đông đã bị quân Việt Nam Cộng hòa bắn chết và tịch thu số tiền mà tổ công tác của ông được tổ chức giao cho để mua thuyền. Nhờ có bà Nguyễn Thị Mười ở Phước Hải, Long Đất đã dồn tiền của trong nhà tổng cộng 10 cây vàng để đóng góp, chiếc thuyền này được mua về và được sử dụng trong chuyến liên lạc, vận chuyển đầu tiên. Tham gia chuyến vượt biển trên con thuyền của Bà Rịa còn có ông Lê Hà, con trai bà Mười, sau này trở thành một trong các thuyền trưởng đầu tiên trên các con tàu không số.\n\nTháng 10 năm 1961, Bộ Chính trị và Quân ủy Trung ương Việt Nam quyết định thành lập tổ chức tuyến hậu cần chiến lược Bắc-Nam trên biển. Trung tướng Trần Văn Trà, Phó Tổng tham mưu trưởng được Quân ủy Trung ương giao nhiệm vụ chỉ đạo tổ chức xây dựng tuyến đường này.\n\nNgày 23 tháng  10 năm 1961, Thứ trưởng Bộ Quốc phòng Hoàng Văn Thái ký Quyết định số 97/QP thành lập Đoàn 759, là nòng cốt của Đoàn tàu không số, sau này trở thành Lữ đoàn 125 thuộc Hải quân nhân dân Việt Nam[2]. Đoàn 759 có trách nhiệm chi viện vũ khí cho miền Nam bằng đường biển. Trung tá Đoàn Hồng Phước được giao nhiệm vụ làm Đoàn trưởng.[3] Đây là đơn vị đầu tiên đảm nhận nhiệm vụ vận tải vũ khí, hàng hóa vào chiến trường miền Nam bằng các con tàu không số, mở ra sự phát triển mới của Đường Hồ Chí Minh trên biển.\n\nTại Nam Bộ, Bộ Chỉ huy quân khu IX của Quân giải phóng miền Nam Việt Nam được giao nhiệm vụ thành lập Trung đoàn 962 chuyên trách nhiệm vụ chuẩn bị bến bãi tại bờ biển các tỉnh Trà Vinh, Bến Tre, Cà Mau. Bộ chỉ huy các Khu V, VI, VIII cũng được lệnh thiết lập các bến bãi bí mật để đón nhận nguồn ngân lực và vũ khí, đạn dược, phương tiện quân sự...  từ miền Bắc chi viện cho Quân giải phóng miền Nam  bằng đường biển.",
        "title": "Xây dựng lực lượng:"
      },
      {
        "description": "Đêm 12-10-1962, chiếc tàu \"Phương Đông 1\" gồm 10 thủy thủ dưới sự chỉ huy của thuyền trưởng Lê Văn Một, chính trị viên Bông Văn Dĩa chở hơn 30 tấn vũ khí rời bến k15, Đồ Sơn (Hải Phòng) đi về phương Nam. Đến sáng ngày 19-10-1962, tàu vào tới Chùm Gọng (Vàm Lũng, Tân An) an toàn. Tàu \"Phương Đông 1\" đã đi vào lịch sử, chính thức khai thông tuyến vận tải quân sự đường biển - Tuyến vận tải chiến lược - Sau chuyến đi thành công của tàu \"Phương Đông 1\", ba chiếc tàu khác cũng đã cập bến Cà Mau an toàn; cùng với các bến Trà Vinh, Bến Tre, Bà Rịa hình thành các cụm bến đón nhận những chuyến hàng đầu tiên của tuyến vận tải Đường Hồ Chí Minh trên biển.\n\nSau một thời gian chuẩn bị và đi chuyến đầu tiên thành công, từ tháng 9 - 12/1962, Đoàn 759 đã tổ chức 4 tàu vỏ gỗ, chuyển được 119 tấn vũ khí, đạn cập bến Bồ Đề (Cà Mau) an toàn. Năm 1963, Đoàn 125 bắt đầu sử dụng cả tàu vỏ sắt và vỏ gỗ, chuyển 23 chuyến vũ khí vào cả 4 bến của Nam Bộ (trong đó có 3 chuyến hàng không tới đích); năm 1964 chuyển được 59 chuyến hàng.\n\nTrong thời gian này tuyến đường Trường Sơn trên bộ (được thành lập từ tháng 5 năm 1959), tuy đã rất khẩn trương tiến hành soi đường, gùi hàng, vũ khí vào chiến trường. Nhưng những năm đầu do địa hình phía Đông Trường Sơn quá hiểm trở, mặt khác lại bị địch đánh phá ngăn chặn quyết liệt, nên hoạt động đã gặp nhiều khó khăn...\n\nTrong khi đó tuyến vận tải trên biển đã nhanh chóng sớm phát huy được hiệu quả, nên thời kỳ đầu (1962 - 1965), những con tàu không số đã kịp thời phát huy hiệu quả, trở thành tuyến chi viện chiến lược chủ yếu cho chiến trường Nam Bộ và Nam Trung Bộ. Đã có 89 chuyến tàu chở 4.419 tấn hàng (chủ yếu là vũ khí, đạn dược) chuyển vào Khu 5 và chiến trường Nam Bộ từ tháng 9/1962 đến tháng 2/1965[4].\n\nPhát huy những kết quả giai đoạn 1962-1965, trong những năm tiếp theo, bộ đội ta đã luôn sáng tạo, hoàn thành mọi mục tiêu đề ra, cụ thể được khái quát là:",
        "title": "Giai đoạn (1962-1965): Kịp thời và hiệu quả"
      },
      {
        "description": "• Thời kỳ (1965-1968): Từ sau Sự kiện Vũng Rô, bị mất đi yếu tố bí mật, đội tàu vận tải phải đi xa bờ và chuyển sang hình thức \"lừa miếng\" - đi bằng phương pháp hàng hải thiên văn .\n\n• Thời kỳ (1968-1969): Chuyển sang phương án vận chuyển gián tiếp.\n\n• Thời kỳ (1969-1975\n): Tiếp tục phương án vận chuyển trực tiếp.\n\nTừ tháng 2-1965 đến tháng 1-1973 là giai đoạn khó khăn nhất nhưng hết sức hào hùng của tuyến chi viện chiến lược trên biển. Sau sự kiện xảy ra với tàu C143 ở Vũng Rô (Phú Yên), yếu tố bí mật của tuyến chi viện chiến lược trên biển của Việt Nam không còn nữa. Nhưng công việc tiếp tế cho miền Nam bằng đường biển vẫn phải tiếp tục, buộc quân Giải phóng phải chuyển hướng vận chuyển từ phương thức trực tiếp sang phương thức gián tiếp. Bằng phương pháp vận chuyển này, trong một năm (từ 1-11-1968 đến 31-10-1969), lực lượng vận tải biển đã đưa vào cảng sông Gianh 21.737 tấn vũ khí. Từ đây, số vũ khí này được chuyển vào Nam theo đường bộ. Ngoài ra, trong giai đoạn này, cán bộ chiến sĩ Đoàn 125 còn tham gia chiến dịch vận tải VT5 - Vận tải tranh thủ tụt thang (từ tháng 11-1968 đến năm 1969), cùng các lực lượng trong và ngoài quân đội vận chuyển hàng chục vạn tấn vũ khí, lương thực, xăng dầu... từ Hải Phòng vào các tỉnh Nam Khu 4, tạo chân hàng cho tuyến chi viện chiến lược trên bộ (Đoàn 559).\n\nTính chung, trong 4 năm (1965-1968), tuyến đường trên biển tổ chức được 27 chuyến tàu, song chỉ có 7 chuyến đến đích, giao được 410,4 tấn hàng (chủ yếu cho Nam Bộ), 11 chuyến phải quay trở lại miền Bắc do nhiều nguyên nhân, 6 chuyến phải tự phá hủy tàu để tránh bị địch thu giữ, 3 chuyến bị địch chiếm tàu. Trước tình hình đó, Việt Nam đã tranh thủ sự giúp đỡ của Vương quốc Campuchia, chuyển hướng tổ chức vận chuyển bằng tàu biển quốc tế đưa hàng viện trợ quân sự vào cảng Xihanúcvin, sau đó thuê tàu của quân đội Hoàng gia Campuchia tiếp tế cho chiến trường Nam Bộ và một phần cho chiến trường Tây Nguyên. Bằng cách này, từ 1966-1969, đã có 10 chuyến tàu, chuyển 90.870 tấn hàng cập cảng Xihanúcvin, trong đó có 21.473 tấn vũ khí, đạn dược; chuyển về chiến trường miền Nam được 18.703 tấn.\n\nTừ năm 1971 đến 4/1972, hải quân Mỹ phong tỏa, kiểm soát rất gắt gao trên tuyến biển , khiến hầu hết các chuyến tàu chở vũ khí vào Nam của Đoàn 125 phải quay lại. Ngày 27/7/1971, Quân khu 9 thành lập Đoàn 371 dưới dạng tàu đánh cá hợp pháp. Được tàu của Đoàn 125 hộ tống, dẫn dắt từng chuyến đi qua các vùng biển nguy hiểm, hai năm 1971- 1972, Đoàn 371 đã vận chuyển được 31 chuyến với 520 tấn vũ khí vào Quân khu 9.\n\nĐồng thời với việc đẩy mạnh đưa hàng vào cảng sông Gianh, Quân chủng Hải quân chọn một số tàu và thủy thủ có kinh nghiệm tiếp tục vận chuyển vào Nam theo đường Hồ Chí Minh trên biển.",
        "title": "Giai đoạn (1965-1973)"
      },
      {
        "description": "Sau Hiệp định Paris, hải quân Mỹ rút đi, tàu vận tải chuyển sang phương thức hoạt động công khai. Từ 1973 đến 1975, tuyến chi viện chiến lược bằng đường biển đã dốc toàn bộ lực lượng và phương tiện, sử dụng hàng ngàn lượt chuyến tàu chuyển vũ khí và vật chất các loại vào các chiến trường.\n\nĐoàn 125 được trang bị thêm nhiều tàu mới có trọng tải 100 tấn trở lên. Đoàn 125 đã tham gia cùng ngành Hậu cần vận chuyển từ miền Bắc vào Quảng Bình và Cửa Việt, tạo chân hàng chi viện cho miền Nam qua đường Hồ Chí Minh trên bộ. Trong 2 năm 1973-1974, Đoàn đã huy động 380 lượt tàu, vận chuyển hàng chục ngàn tấn hàng, đưa 2.042 lượt người từ hậu phương vào tiền tuyến và các đảo. Đặc biệt, trong Tổng tiến công và nổi dậy Xuân 1975, đã sử dụng 140 lượt chuyến tàu, vận chuyển 6.282 tấn vũ khí và vật chất khác, cùng cán bộ chiến sĩ vào tăng cường cho chiến trường Nam Bộ và Khu 5, cơ động bộ đội đặc công chiến đấu giải phóng các đảo thuộc quần đảo Trường Sa, Cù Lao Thu, các đảo phía Nam và Tây Nam của Tổ quốc. Trong đó, Đoàn 125 đã vận chuyển vào chiến trường 17.473 cán bộ chiến sĩ, 40 xe tăng, 7.786 tấn vũ khí, nhiên liệu, góp phần giải phóng miền Nam, giải phóng Quần đảo Trường Sa và các đảo trên vùng biển Tây Nam[4]",
        "title": "Giai đoạn (1973-1975)"
      }
    ]
  },
  {
    "name": "Trận địa pháo 105mm của Đại đội 805",
    "location": "Thành phố Điện Biên Phủ và huyện Điện Biên, tỉnh Điện Biên",
    "types": "Di tích lịch sử[113]",
    "detailLink": "",
    "imageUrl": "",
    "description": "",
    "events": []
  }
]
